{"date": "2019-02-02T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Decent pizza, a decent amount of seating, great service... I have nothing to complain about. This is a great go-to pizza spot in the area, and I always enjoy coming here. It isn't the best pizza I've ever had, but nonetheless it is tasty and I keep coming back!"}
{"date": "2018-10-11T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "I have been going to Bella Italia for almost 3 years now! I found out about this gem and was hooked ever since! Being from New Jersey and being used to grade A pizza, I was disappointed by the lack of good pizza in the West Philly, Manayunk, Ardmore area. I decided to explore different local pizzeria's to find a good spot to satisfy my need for good quality pizza. After trying Bella Italia for the first time, I was in love! The pizza is great! The crust is thin, sauce is delicious, perfect amount of cheese. I have tried a few things on their menu other than just the plain slice. I have had a white slice here which is delicious and difficult to pull off; Bella Italia did it perfectly! I have also tried the meatball parmesan hero, the french fries and mozzarella sticks. All were delicious and I would have again! The only downside of this spot is that the pizza is a bit oily but the napkin trick will fix this issue! Other than that Bella Italia is the perfect spot to get a pie to go from, grab a slice, grab a sandwich ect! The staff is very friendly; owned by a sweet husband and wife straight from Sicily! Which is probably why their pizza is so good! If you are in Ardmore and want good quality pizza; try Bella Italia!"}
{"date": "2019-02-24T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "The food is decent, but WAY overpriced. I have had pizza and salad here a few times. The pizza was greasy on my last visit but kids still enjoyed it."}
{"date": "2018-05-21T00:00:00.000", "stars": 1, "venue": "Bella Italia", "review": "Been a few years Hasn't been missed Still have a bad test since last visit Too many good alternatives in the area"}
{"date": "2018-11-18T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Got two slices of cheese pizza and one slice of pepperoni pizza. No complaints other than a little bit too greasy on the pepperoni pizza, but thats quite common. They were new york style and very tasty with some dry chili flakes added. Service was prompt. Definitely would come back again!"}
{"date": "2017-08-06T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "Just your average pizzeria with a decent slice.  Two times ago my pizza was burned a bit more than I prefer and last time the crust seemed thinner...  My co-worker swore that this was the best pizza around.  It was always good pizza, or A-ok, but I  never understood why he loved it.  Once he found out that Acme sold a cheaper slice, he stopped going to Bella Italia...  I learned I work with horrible people that day...  I might be coming here a lot more though...  I can trick co-workers into ordering a pizza at this place and then walking to Delice et chocolat while we wait.  We always get pizza here though, I think I might try something else next time.  Maybe a Stromboli?  We'll see how that goes."}
{"date": "2018-08-04T00:00:00.000", "stars": 2, "venue": "Bella Italia", "review": "We ordered two large cheese pizzas and two of orders of chicken fingers. It was average quality pizza and subpar chicken fingers. It was not the best and it was not the worst. I have better options in the area so I highly doubt that I will order from here in the future."}
{"date": "2017-02-03T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "This place is my hubbie and my go-to pizza spot while we were in college at SJU. I came back to the area a few months ago, and decided to stop back.They serve thin crust NY style pizza, which is my favorite. Dough and ingredients are good quality. I ordered a pepperoni and mushroom pizza. Pizza was $18 for a med 2 topping. It was good but I would have like more cheese and toppings, esp for the price. Service is typical for a casual pizza joint. Would go back if in the area, but I wouldn't go out of my way for it."}
{"date": "2018-03-21T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Good New York style pizza. Food is made quickly and prices are reasonable. This is primary a take out location. Staff is friendly."}
{"date": "2018-11-04T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "I have been coming here for 20 years, and other than the poor customer service and bad attitudes, it's solid expensive pizza by the slice. I smile and a thank you wouldn't kill this place."}
{"date": "2018-08-31T00:00:00.000", "stars": 2, "venue": "Bella Italia", "review": "Horrible service. Gross pizza. At least they serve beer. This is my first time going here I was walking by and I thought it would be pretty good like everything else in Ardmore I was wrong. But the service was the worst., They all had an attitude"}
{"date": "2017-03-28T00:00:00.000", "stars": 1, "venue": "Bella Italia", "review": "I have few issues with this place:1. The customer service....the man (who I'm assuming may even be a manager or owner) handled money and grabbing my food with bare hands *very unsanitary Also after paying my food he left my change on the counter....and turned his back to finish doing what he was doing. No \"thank you\" \"have a nice day\" 2. The pizza Food quality was just not that impressive, wasn't bad but was not very good* will definitely not be returning"}
{"date": "2018-02-09T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "Great Pizza!Terrible Customer Service.. Flat out rude!"}
{"date": "2017-08-15T00:00:00.000", "stars": 1, "venue": "Bella Italia", "review": "Worst customer service ever, wish I could give zero stars.  Avoid specials, they just make them cheap.Italian lady/owner refused to give me the Monday/Tuesday cheese pizza special for $12.95, because she did not hear me specify when ordered (probably because she hung up on me the second I finished ordering).    She quoted, \"We made these pizza's with all the cheese, you pay full price\". She then refused to honor the $13.95 website price, insisting I pay $15.95 per pizza.  Even if you get the special price, she will refuse credit and only accept cash, oblivious to the $0 minimum credit charge on website or $6 min posted in store.Extremely rude on all accounts, she could really care less about customer service or just being nice in general as a decent human being with a soul."}
{"date": "2017-03-18T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "My favorite place for cheesesteak in Ardmore Area. Run by an Italian family. Few free parking upfront but plenty back there with meters."}
{"date": "2017-09-05T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "As opposed to others, I have never had a bad pie, here. The Old Guys that run the joint are brusque,but, I've experienced worse in my life. Sorry, Folks, can't nit-pick. I'll return soon."}
{"date": "2017-06-27T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "Awesome pizza!  Expect some NYC-style service here.  Not the friendliest, but who cares when the pizza is so awesome?  When I first moved to Philadelphia, a young girl on the train told me this was where to go.  Thank goodness for her!!"}
{"date": "2014-07-11T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "This place is literally a 60-second walk away from my apartment so I was interested in trying a quick meal there.When I called to order takeout (Chicken Cheesesteak), a very \"Italian\" lady answered the phone, took my order as quickly as possible, and hung up. By the time I got there a few minutes later, my order was already by the cash register. The woman I spoke to on the phone was much more friendly in person. She began speaking to me very excitedly in Italian, probably noting my tan skin and curly hair. I had to let her know I am not Italian, but actually half Puerto Rican, which seemed to make her equally excited and we began chatting in Spanish instead. She ended up calling her whole family over and they jabbered in Italian about how pretty I am. I walked out the door laughing, with warm smiles and waves.My cheesesteak was very large for the cheap price. The chicken was a little dry but the sandwich was flavored very well. I was excited to see they sell Jarritos (delicious brand of Mexican soda), as well as averagely priced six-packs.Not the most amazing meal I've ever had but it was such a cozy and heartwarming experience that I'll happily give this family my business again. I will report back once I have tried the pizza, for sure!"}
{"date": "2015-12-01T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Still hands-down one of the best-tasting pizza places around. It was my favorite growing up, and visiting from NY a year later, the taste is unmatched. It's the sauce. So flavorful. And they don't skimp on the quality of any of their ingredients. I'd give 5 stars, but as always, there is an undercurrent of unfriendliness from the owners, and the price has increased substantially. Even in NY you can find delicious slices of cheese for under $3."}
{"date": "2016-03-21T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "Stopped in over the weekend to give this place a try, thought I would start out with 2 slices to be safe. I must say this was the best pizza I have tasted in quite some time. The sauce was the star here, very good flavor which added to the cheese and the delicious crust. $3 bucks per slice of plain, but I wont bitch about price because it was worth it in my honest opinion.As far as the owners.... what you read in the reviews is correct! So if you are looking for good  conversation you will not get that here. Kind of felt like a Soup Nazi vibe when I walked in....I had there attention right away and I got the feeling they do not like for people to take there time with the menu or ask alot of questions with the order. This did not bother me because most times I am not looking for annoying, superficial conversation anyway, just good food.The restaurant appeared clean and had a variety of pizza for take-out along with a good beer selection.My next trip I plan on trying out the cheesesteak and fries but so far I can attest to the fact that you cant go wrong with the pizza thats for sure.I plan on returning very soon. I highly recommend this place."}
{"date": "2013-10-15T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "At one point in time Bella Italia was the better option to go with when you were looking for pizza. Times have changed and looks like the quality has changed from what I had remembered. I don't get it why change something that was selling, where others couldn't match up. I was in here a few times recently and I haven't seen the big guy making pies, or his wife greeting you when you come in. Prices before have changed, and now they are asking for an astronomical amount for a slice. Maybe I haven't gotten a slice in a while, but $3.50 for a slice of sausage, or mushroom ? Really , I mean really that is a little absurd , and to think this isn't a gourmet slice, it is one of the usual suspects'  when it comes to the toppings in the world of pizza. Another item that they topped in was their Chicken Parmigiana sandwich, this was one of my \"go to orders\" when I would come here religiously. This , or something has altered my one time \"go to sandwich\". Now I hate to say it its just burnt sauce with  a freezer burned chicken finger. Throughout their existence they have remodeled a bit, opening it up a little more to seat the people. They also have improved their menu to go with the times, but again the quality has diminished . The only thing saving this from becoming a 2 star review is they serve beer while you eat."}
{"date": "2017-10-26T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "I have been trying to find decent pizza in the wynnewood/ardmore area and this led me to order takeout from Bella Italia.  The pizza was ready on time as promised.  Thin crust pizza which had a good sausage topping.  Pretty good Pizza but the crust was not as crispy as true NY pizza.  All in all a pretty solid pie but I will keep searching.  I will order from here again.  No customer service issues that others have mentioned."}
{"date": "2017-03-13T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Our go-to pizza place in Ardmore. My kids love it. Sometimes they overcook the pizza a little so if you don't like that make sure you mention to undercook it a little when you order. Can't comment on anything else because we always get pizza to go."}
{"date": "2016-08-06T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Thin NY style pizza is authentic to NY & affordable. Great choice for just a slice. Recommend."}
{"date": "2016-04-16T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "Been coming here for years.  Their pizza is the best in Ardmore.  My whole family loves their pizza.  I often get their eggplant parmesan sandwich."}
{"date": "2016-02-07T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "Their menu is quite extensive for a corner pizza shop and the food hits the spot. Prices are reasonable and quite competitive with Ardmore Pizza, just around the corner. I prefer Bella Italia when I'm looking for a quick take out meal, but am ALWAYS disappointed with the owner's poor customer service. Many other employees have been kind, but she has made me rethink wanting to come back several times. She's very abrupt on the phone (I realize English is a second language, but she's rude) and seems very passive when we visit. I feel I'm not welcomed there and it's cause for taking away a star."}
{"date": "2014-07-24T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "I love bella italia. They have been around forever and I have great memories of walking here with my mom and meeting my grandmom for lunch as a kid. So it's a bit of a nostalgic place for me, lol. I went here with my boyfriend the other week. I got a slice of plain pizza which was very good, as usual. He got the cheesesteak pizza, which was kind of like a stromboli. I thought it sounded weird but that was also great. This is probably my favorite pizza place in the area and I hope it continues to remain successful."}
{"date": "2016-01-05T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Love their pizza ! Amazing pizza to grab when hopping off the train from work ! Beer & pizza who wouldn't be interested"}
{"date": "2014-06-10T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Came here after a show at the Ardmore Music Hall. Thought pizza sauce was zesty and good. We also liked the crust. It was thin crust. I will come back. Owners were nice.Bathroom was clean. Pizza was good. (also have thick crust - Italian style Sicilian Pizza)..yum. They also sell a good selection of Beer and have other  foods: sandwiches, calzones, strombolis, salads, italian foods and fried platters.  Fri and Sat open late until Midnight. Sunday till 10pm."}
{"date": "2013-02-08T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "So the guy at the register isn't nice enough for you?  Or you didn't check your order to make sure they charged you correctly?  Their carryout beer selection sucks?  Really?  Go to a beer distributor or somewhere that may specialize in it.  Reviewers are funny.  Hands down my favorite NY style, thin crust pizza on Earth.  Yes, its pretty much a hole in the wall type of place...and that's where you usually find the best food anyway, perfect.  I've been here with girlfriends, families, and friends.  The booths can fit you.  There's some grease to the pizza, not a lot of sauce, but just right.  If you want a lot of sauce, this isn't for you.  The crust is crispier when you eat in rather than take out, but thats like that everywhere.Enjoy....and really, look at some of those other reviews.  Lighten up."}
{"date": "2012-12-27T00:00:00.000", "stars": 1, "venue": "Bella Italia", "review": "I don't always get mad, but when I do, it's because I ordered from Bella Italia.I called in a takeout order on a quiet weeknight: one plain Sicilian pizza and a large pepperoni stromboli.  Simple and easy.  Which is why what happened 20 minutes later defies all logic.When I arrived, I greeted the dude at the counter and told him I was there to pick up a Sicilian and 'boli.  He responded with a strange look on his face and went over and whispered with the dude manning the register.  Turns out the pizza had somehow disappeared completely or just never got made -- I never got any sort of explanation.  Instead of apologizing and offering to bake a new one, register dude (who I believe was the manager) offered to heat up a PARTIAL Sicilian pizza that had obviously been festering under the heat lamp all day, acting like he was doing me a massive favor.  I declined, and, either because I'm disgustingly nice or because I was in a state of shock from the absurdity, paid for the stromboli and peaced outta there.  Once I got home, however, my friend realized they'd given him a small cheese stromboli instead of a large pepperoni, but still charged for the large pep.  ARRRGGGGHHHH!!  More fail icing on top of the already overly decadent fail cake.  I even checked my phone log to ensure I'd actually ordered from them and not some other place, because neither my friend nor I could rationalize how the order got totally, 100%, screwed up.I understand restaurants are operated by people and people have off days, so normally I'm pretty flexible and cool with second chances.  But everything about this experience was heinous enough that Bella Italia won't ever be seeing my business again, especially when I've had positive experiences with other pizza joints in the area.  Bella ciao, ciao, ciao."}
{"date": "2015-04-21T00:00:00.000", "stars": 2, "venue": "Bella Italia", "review": "This place grosses me out a bit.  Cool to grab a six pack (but why would you when there's a craft beer shoppe a few blocks away), but the food is questionable.  I say that because I've seen bugs here and the food is not good unless you're starving."}
{"date": "2014-08-17T00:00:00.000", "stars": 1, "venue": "Bella Italia", "review": "First and last visit to this place! I was craving a pepperoni pizza and my usual spot was closed for the evening so I went here. First off I ordered a SMALL pizza... They didn't bother to tell me they only have M and L. $14.95 for a M pizza is outrageous and I should have just walked out! Absolutely nothing special and what a waste as I only ate 1 slice!! Never again! Ever!"}
{"date": "2012-11-01T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "Quick Review-AWESOME slices of pepperoni and plain.   Cheese is perfect, crust is thin.  I will go back again for sure.  I also heard the cheese steaks and cheese steak pizzas are excellent."}
{"date": "2014-08-18T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "Perfect location when you're going to a show at the Ardmore Music Hall.  We went with a slice of cheese and a calzone.  The marinara is quite yummy, and the pizza was standard.  Nothing amazing but you can't beat the convenience for a quick dinner before a concert across the street."}
{"date": "2011-07-16T00:00:00.000", "stars": 1, "venue": "Bella Italia", "review": "OK, I know it seems harsh to go from 5 star FABULOUS all the way down to 1.  However, I make no bones about it, \"DON'T MESS WITH ME\", or I'll take it out on your review, LOL.  But seriously...Had lunch at Bella Italia the other day and was not pleased, AT ALL.  First they called me up for my slice 2 seconds after they put it in the oven, it was luke-warm, second, I tasted a little charcoal on the bottom of the slice.  Clean your ovens people, that is NOT GOOD!!!!!  Third and most disturbing of all is how they think they can omit the price of beverages from their menu (both on the board and on paper) and then proceed to overcharge you (especially the lady-who way overdoes it every time).  I've let it go a few times without saying anything to her, but this time was the last straw!!!!  I've had it with Bella Italia now.  My pizza slice was $2.50 and I was charged $5.00 for the slice and a 20 oz soda.  Which means the soda was $2.50, HUH, what??  That is frickin' ridiculous, most places charge $2.99 for a full 2 liter bottle!!!!I AM DONE WITH YOU BELLA ITALIA!!!!!  If I happen to hear from another source that you've shaped up and changed this policy of ripping off your customers, then maybe I'll come back, but it will be quite a while before I do!!!!"}
{"date": "2014-08-15T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "While the chicken parmesan sandwich is decent (but nothing special), the Sicilian pie (simply as tomato pie or with cheese) is absolutely delicious. While I prefer Felicia's, another Sicilian pizza place just a minute's walk from Bella Italia, I enjoy stopping in for a slice once in a while."}
{"date": "2011-06-11T00:00:00.000", "stars": 1, "venue": "Bella Italia", "review": "This place has gone downhill and fast.  They've always been a bit pricey with the food and especially their takeout beer (probably because they sell to minors and have for years). Each time I go, the pizza gets worse.  I went on Thursday night, after spending the whole day at the hospital and all I wanted was a piece of stuffed steak.  I ordered a medium pizza (steak), had a fountain drink, regular drink, and cheese fries.  Grand total? $36! The medium pizza was $26.  I wouldn't have minded paying this much, but instead of giving me a large box they stuffed and folded the pizza over to fit in a small box.  REALLY? $26 for a medium and you can fit it into a regular box or give me two so you don't have to ruin this pizza?This was the last straw for me, after coming here for over ten years since I was in high school.  The food gets worse with each visit and don't deserve my business."}
{"date": "2012-01-22T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "This place has been open for ages and I remember coming here to grab a slice after school.  It hasn't changed and the pizza is still the same: thin, crispy crust with a generous portion of cheese and sauce.  Owners haven't changed and are still the same friendly guys who have been here for years.  Good for a quick bite."}
{"date": "2011-09-26T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "I know I should base all pizza reviews on the plain slice first.  but I didn't have one on this instance.  the old fat me would have had a minimum of two slices, but i just had the veggie slice.  it was loaded.  problem is it was pretty pricey for one slice (3.75).  its pizza.  we all know it costs about fifty cents per slice - and i can get paying for a few toppings - but DAMN!would've been 4 stars otherwise."}
{"date": "2014-02-12T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "Bella Italia is one of the better pizza places in the Lower Merion/Ardmore area. When I was living on campus at Saint Joseph's University my friends and I drove to this place knowing it was always going to be decent--it's better than Toni Ronis or Dominos that's for sure. I usually get a slice of Sicilian or slice of white pizza. There are definitely better pizza places in Philadelphia, but that doesn't stop me from going into Bella Italia whenever I'm in Ardmore. The pizza comes out fast, and you can also buy alcohol."}
{"date": "2013-08-21T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "My favorite pizza place. Whenever I come back east the owner is super sweet and helps me take slices to go. There just isn't pizza like this in California..."}
{"date": "2013-10-13T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "This place all in all isn't bad. The food, I agree would be on the greaser side but very tasty!  The service is a non nonsense, what u see us what u get type of place but once the owners get to know you they are very friendly.  I would recommend the cheese steaks here, especially the buffalo chicken cheese steak. It is fantastic."}
{"date": "2011-08-13T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "Bella Italia delivers consistently great pizza.  I've been going there for over a decade and have never been disappointed!"}
{"date": "2015-09-05T00:00:00.000", "stars": 2, "venue": "Bella Italia", "review": "Overpriced the service is ok.  The owners are skittle mean but the workers are very pleasant.  There pizza taste like everyone else's nothing fancy."}
{"date": "2014-03-18T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Closest thing to NYC pizza..Im a NYC transplant and it tastes like home.  the owner is from Italy via Brooklyn NY..He knows how to make real pizza..and yes you pick it up and it eat it..not cut it with a fork and knife.."}
{"date": "2009-12-22T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Awesome, thin, genuine Italian-style pizza.  Worth making a trip to get a taste.  They have great mini calzones too.  The rest of the menu is okay.  Fries change every couple of weeks so sometimes they are great and sometimes it's a waste.  Takeout recommended over eat-in.  I went at least twice a week for 3 years and got the cold shoulder the whole time so don't expect to feel like part of the family."}
{"date": "2011-07-07T00:00:00.000", "stars": 1, "venue": "Bella Italia", "review": "Will never go into  this place again. It has gone way downhill the past few years. Way overpriced and rude help."}
{"date": "2013-02-02T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "I'll start this review off by saying that I'm a regular (one a week for the past three years).  It might be because of this that the staff there is always nothing by kind and friendly to me.  I've never had my order wrong and always engage in long conversations with the staff.As for the food, we normally get either the pizza, salad, cheesesteaks, or spaghetti.  Everything, especially the pizza, is pretty awesome.  It's good, greasy, and comforting.  Yes, the beer is expensive, but at least you can buy it in six-pack form.  All in all, it is definitely my favorite pizza in Ardmore."}
{"date": "2012-10-14T00:00:00.000", "stars": 2, "venue": "Bella Italia", "review": "I don't understand these reviews or maybe I don't understand pizza. I've eaten here several times and I think the pizza is kinda bland. Nice people and good beverage selection. Open late."}
{"date": "2009-04-03T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "By far the best pizza in Lower Merion, other options are good, not great but definitely OK.   Place is kid friendly, quick and they have beer which is great.Avoid going here past 8 on a Thurs, Fri or Sat night because all the Villanova douchebag kids eat here before going across the street to Brownies."}
{"date": "2008-03-25T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "I can't even remember how old I was when I started going to Bella Italia...It may have been high school but I don't want to date myself because I think they have been in business for close to 20 years.Bella Italia has everything: pizza, calzones, Sicilian pie, strombolis, sandwiches, salads, burgers, pasta dishes, ziti, lasagna, ravioli,manicotti, hoagies...even Italian ice for dessert.  ...all at very reasonable prices.  The decor is a little old but the food definitely makes up antiquated ambiance. It is open relatively late hours during the week and on the weekends.  They also have domestic and imported beer for purchase."}
{"date": "2012-01-13T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Found this place only recently. This is my new favorite pizza in the area. They make their own dough each day and you can tell. Great crispy crust - not soggy. The owners are always there and are great. I haven't tried the rest of their menu so I can't comment there. Plus, you can get a six pack to go - which is nice."}
{"date": "2012-09-15T00:00:00.000", "stars": 1, "venue": "Bella Italia", "review": "Admittedly, I have not had their food, but their takeout beer section sucks. WAY overpriced, and the price goes up and up the less you buy (e.g. 1 bottle of Yuengling costs as much as half a sixer). Not only that, the 6 packs here cost nearly twice what they cost at the Ardmore Beer Shoppe (which has a way better selection, I might add), and 2/3 the price of a CASE of a comparable spirit at Ardmore Park Beverage. They ripped me off a few times back when I was first in the area. Some folks told me that Bella Italia was where you go to buy beer, but it turns out that this is not at all true.I wouldn't try their food, either, since they would probably gouge me on that front, too. I would expect to leave without my shirt."}
{"date": "2014-04-15T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Place has been there forever.  Been eating their Sicilian pizza since I was a kid.  Don't know much about the regular pizza but if you like Sicilian, Bella Italia's is excellent."}
{"date": "2009-09-17T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "Bella Italia is one of those places that you grow to love more every time you go.  The pizza was above average the first time I had it, but after going back a few more times it became even more enjoyable.  There is definitely character to the place.If you're looking to go to a restaurant that's nice, this is not the place to go.  As soon as you walk in they're selling six packs and 40's... not a real classy look.  And then if you have to go to the bathroom you have to pay a quarter... not a really classy feel to it.As for the pizza... I feel that the dough's the best part.  They also don't add too much cheese on their pizzas, which makes it a lot less greasy then your typical pizza joint.(good thing in my opinion)  Pizza's very consistent.Great choice if you just wanna grab a quick meal or a decent six pack.I'm a fan"}
{"date": "2010-09-17T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "You can't go wrong with a slice from Bella. I've lived in Ardmore for two years and have tried other pizza in the area. None come close to Bella Italia. The owner works every day and is a nice man. The pizza is no gimmick with a lot of flavor. If you go and eat-in you can usually catch a soccer game on TV. They also have a half decent take out selection of beer too."}
{"date": "2012-06-19T00:00:00.000", "stars": 2, "venue": "Bella Italia", "review": "I live in the area and regularly and semi frequently eaten here for the last almost 20yrs,  but sadly BI has been on a slow downhill slide over the last couple of years.Really surprising since the place is still owned/run by the same family. WAS a place to get great NY style slices, and maybe still is sometimes, but lately it seems that pies look old like they have been sitting out for way to long, and sort of taste that way too.My kid and I stopped in there last night and I had a cheese-steak hoagie, or should I say a cheese-gristle hoagie, since I constantly had to pick same out of my mouth, bleech..had to throw the other half away.  To top it off ,tab for my hoagie, my kids 3 slices (2 saugage, 1 cheestake slice -granted more expensive that one) and 2 sodas: 24.00!  Something is not right. My wife told me she stopped by last week for a slice and a drink, 6.50?? I think someone needs their calculator fixed..."}
{"date": "2012-01-27T00:00:00.000", "stars": 4, "venue": "Bella Italia", "review": "The closest thing this homesick NY'er has found to NY style pizza along the mainline.  The help can seem a little gruff and the pizza might be a little pricier compared to its counterparts but I'd gladly put up with both for a quality slice/pie.  Thin crispy dough and high end cheese make this one a winner. They also exhibit a tell-tale sign of a good pizza joint with their back TV permanently tuned-in to Premiership/Serie A games.  Tempted to try their cheesesteak one of these days if I can ever get past the pizza..."}
{"date": "2013-09-07T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "Best Pizza place on the Main Line!  The lovely couple that owns the place I've heard can some times come off as rude but they really are not!  Very nice couple and the employees are friendly as well.  The pizza is delicious -- thin and crispy!  Reminds me a lot of Mac and Mancos Pizza down in Ocean City, NJ.  They also have beer here which is nice.  Sometimes I wish they delivered but every time I have come to pick up from there it was always a speedy process.  I have never once showed up and my pizza wasn't ready.  This place is the best on the Main Line and I recommend everyone to try it out!"}
{"date": "2013-04-20T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "Bella Italia is quite simply the best pizza anywhere on the main line. Been going there since the 1970's and for New York style,thin crisp crust pizza, this is where you go. The owners are very nice. Don't go for ambiance or atmosphere, go for the Pizza. Cheese steaks and french fries pretty good too!"}
{"date": "2012-10-29T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "I absolutely love Bella Italia's Pizza. It's boardwalk style which is very hard to find in the suburbs. Chewy and just perfect for that style.  The large pie is huge and in my experience always cooked perfectly.  I love the Italian owner and the staff too. Buona Pizza! People complain about the beer and prices, take out 6 packs are always expensive especially in PA. Take some time trying to separate alcohol from the State if you want to see some fair pricing competition."}
{"date": "2010-07-21T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "Great place!  What a local corner pizzeria should be.Great pizza.  Beer to go.Pizza is always ready when you call in a takeout order.Its not fancy, nothing crazy, just great pizza."}
{"date": "2012-01-09T00:00:00.000", "stars": 3, "venue": "Bella Italia", "review": "Pizza has been inconsistent in my experience.  Sometimes it is very good, sometimes very bad.  One thing that has been consistent is the gruffness of the staff.  They barely acknowledge your existence."}
{"date": "2009-03-08T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "so much better than peace of -pizzza, pizza hut, dominos and all that other stuff (though I do enjoy the fatty garlic butter dippin sauce that papa john's has..)this pizza is delish. It's a fun place to hang out, eat a couple slices and just chill.I was introduced to bella italia by my cuz who's from the area, and I thank him for him sharing where you can get a decent slice on the mainline..."}
{"date": "2011-03-24T00:00:00.000", "stars": 5, "venue": "Bella Italia", "review": "This place is awesome.  Family run business and they run it old school.  Pizza is authentic and new york style.  They use Grande cheese which is the best you can get.  Cheese steaks are amazing too!"}
{"date": "2009-07-30T00:00:00.000", "stars": 2, "venue": "Bella Italia", "review": "meh! why all the fuss about this place. Perhaps nostalgia for people that have been going for years or because for lack of a better place in the immediate area? I wasn't impressed. It was just okay and honestly I felt a bit stingy. Also a bit over priced for what the quality and the portion sizes of most items. The buffalo wings just plain sucked! Over cooked, chewy and a meager squirt of sauce over the top of those chewy little buggers. I asked for blue cheese and clearly the woman helping me would have preferred not to have given it over. I think she would have liked to have charged me for the supposed \"additional\" sauce and the blue cheese dressing, which I think is standard for wings (note the sign at the register stating the .75 for these things and the dressing is from a can anyway). Nice! gotta buy a forty if you want a beer. Can you say up sell! Take a drive and get your moneys worth unless for the sake of convenience in the area you could be okay with the pizza, but might feel a bit ripped off with all the great choices not to far away!"}
