{"review": "Their Media location originally hooked me to Iron Hill but this location always kept me coming back. Even when I've hard horrible experiences at other locations, this one reminds me why I love Iron Hill and why I will always be a loyal customer to this brand. The moment you walk through the door you are greetes graciously by everyone: the hostess, the manager and any other staff who may be around. They all are happy and ready to assist you.I'll say every bartender is not groomed the same. Some have excellent pour game, some need some work in that department. None the less I had a wonderful experience. I sat at the bar with a friend and discussed work and the usual life happenings. The manager checked on us several times when there was no bartender in sight which was helpful because we were already being taken care of but the fact that he kept checking means they really value customer service.As always the food is amazing. The Santa fe turkey burger is my favorite as is the Voodoo Chicken Pizza.See you next week for another happy hour", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-03-10T00:00:00.000"}
{"review": "This sums me up:  I'm the kind of person who orders wine in a brewery.  But my husband chose a craft beer -- something different than what he drinks in GA -- and he deemed it very good.We really came in for lunch.  I got a delicious reuben. I was annoyed that they served it on charred marble rye.  (I sent it back; problem resolved.) T had what looked like a good, juicy hamburger.  And my daughter ordered a boring Caesar salad with chicken.The staff here is really nice and friendly.  The place is big -- roomy and kind of cool looking.  A good stop for lunch.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-03-20T00:00:00.000"}
{"review": "Went here for a \"Paint and Sip\" event, which was tons of fun. We ordered off of the happy hour menu. The happy hour wine selection is very small. As for the space, it is much more of a restaurant than it is a brewery. Low light with nearly all customers dining at low sitting tables.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-02-19T00:00:00.000"}
{"review": "First time at this location, but I've been going in Delaware for years. Hey, it's more than decent bar food in a great environment. What drove this to 5 stars, was the excellent service we received. Our waiter was punctual, engaging, and gave the best recommendations.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-03-17T00:00:00.000"}
{"review": "This was a pretty fun place. It's an atypical restaurant with its own beer, and you can tell they probably put more effort into the beer and a bar atmosphere than the restaurant part considering service in the seated dining room area was kind of slow. The menu itself boasts every time one of their beers is used or best paired with.We went straight to entrees, and I got the fish and chips while my mom got the falafel burger. While my food was stellar (with the exception of the weird paper that just fell apart underneath the food...cute attempt at the newspaper thing but kind of failed), my mom's burger was lackluster at best. It definitely needed to be pan fried over however they cooked it.Overall, it was a typical experience but definitely nothing that would call me back anytime soon.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-12-03T00:00:00.000"}
{"review": "We have been going to Iron Hill at many locations in the Philly area since we moved here a decade ago. We have always enjoyed their high quality beer and delicious food. On our last visit, which will likely be our last visit, we found a new (recently introduced) menu that removed all but one, the least appealing (falafel burger) vegetarian entree from the menu.  While Iron Hill never had what one would call a vegetarian-friendly menu, there was a least some choice, including a Mediterranean wrap and a couple of pizzas to choose from in the past.  It didn't help when the waitress informed us that there are several options with seafood, indicating she had no idea what a vegetarian eats. The message was clear to us, we have no interest in customers who are vegetarian.", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-04-20T00:00:00.000"}
{"review": "Love this place at first. (I used to go to West Chester location and then Ardmore after). There loaded nachos was unreal. Good beer good food until 1 year ago when the menu started to change. I think they changed the menu 3 times already and the portion keeps getting smaller and smaller. Sorry iron hill I will never come back here again because you are not the restaurant that I used to know", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-04-22T00:00:00.000"}
{"review": "This last time was less than stellar. First we came in and decided to wait a little while because of wanting to sit in a specific area in the back of the restaurant. We were told by the host that there was another area of the restaurant where patrons could seat themselves, but we really didn't mind waiting for the area we wanted to sit in. After a little while longer waiting, we were told again by an employee there was an area for patrons to seat themselves. While I get it, they were trying to get us seated, we had no problem waiting. Overall, to me, it just seemed like unnecessary pressure to sit in that area. We just went, and I admit, I was a little reluctant. When we got to this bar area/dining room, we sat down at a table with no table setting and had to wait a while before any waitress even noticed us. Once she did give us the menus, her attention to us was sporadic. In that particular room, she seemed to be assigned to multiple tables and it was difficult to get a hold of her at all. At one point my husband did a beer tasting to decided on a beverage, and the waitress again just disappeared, leaving all the tasting glasses on the table for an extended time. Our appetizer plates sat on the table for most of our dinner untouched, and we received maybe one refill of water after a considerably long disappearance from our waitress once again.My grilled chicken sandwich arrived with no kind of sauce on it, even though aioli is advertised as the spread. On the bright-side, after I complained to the waitress about this, they did comp our dessert. I guess it was a sweet ending to a not-so-great experience.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-05-30T00:00:00.000"}
{"review": "I usually enjoy the food here. This time I ordered a salad special. It was supposed to have watermelon, cucumber, and pecans with arugula. It was small, had a few tiny pieces of those items, and a lot of stemmy arugula. Not tasty. I would return but not order salad.I did not mention my dissatisfaction to anyone because I was having a lively conversation with my friends. The host breezed by and barely spoke to us. If he had stopped to talk I probably would have told him what I thought.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-03-28T00:00:00.000"}
{"review": "We ate at the bar; the bartender was awesome. She provided great service, while taking care of all the others at the bar. The food came out hot, and was very good. We had salmon salad, a strawberry salad and a cheeseburger.  All were cooked perfectly. I'll definitely come back again!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-03-24T00:00:00.000"}
{"review": "Russell our bartender made our time here enjoyable. Friendly and attentive.He made me the perfect French martini, twice. Lol.Food was tasty and as promised...Fried cauliflower and sprouts..................................not nugget style  had twist to them.................they are a definite must try.The mushroom soup with truffle oil was my starter...follow by seared scallops and shrimp with asparagus,corn ...in the most delicious white cream sauce,  I had to even ask Russell for some pasta to finish it up...yummy yum.The Chef gets points here it was a step above...I'll be back !", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-03-12T00:00:00.000"}
{"review": "This was my first time at this location. Parking was pretty tough during happy hour.  I parked across the street about a block away due to no spaces in front of the brewery. The ambiance and service is what you would expect from any iron hill. I started off at the bar then was seated once a table opened.  I ordered the full rack of ribs and had the calamari as an appetizer. The ribs were very well cooked and the meat slid off the bone. The calamari had a Wasabi sauce that was amazing. I would not hesitate coming back to order the same exact meal again.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-08-06T00:00:00.000"}
{"review": "Great place to relax with friends or family.  I met my children here for their 23rd birthday.  We booked a reservation for eight through Open Table.  We were greeted immediately when we entered and taken to our table.  We had a very good server who quickly took our drink order and recommended a few appetizers for us to try.  I had the drunk monk burger which was very good and well prepared.  The burger to bun ratio was perfect.  My daughter had the chicken pot pie which was huge and very good.  My other daughter had the salmon which she also enjoyed.  Nice menu and plenty of beer selections.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-10-30T00:00:00.000"}
{"review": "Service was a little slow the food was typical bar food for iron Hill little pricey for what you got but you got plenty of food and it served hot I guess they're known more for their beers but I'm not much of a beer drinker", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-02-25T00:00:00.000"}
{"review": "For a mid priced, family restaurant this is always a solid option. Slightly more expensive than say, a P.J. Whelihan's, but much higher quality of food. The Brussels sprouts appetizer is fantastic, salty and slightly charred. The ubiquitous cheese steak egg rolls are served piping hot and crunchy, which challenges other restaurants. The Thai flank steak salad has a nice spice and it cooked well. Also had the grilled chicken caesar, compares to most places. Service was good for a packed Saturday night. Took a while to get the check. I like that they frequently bus the table. Good spot.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-05-13T00:00:00.000"}
{"review": "I heard so much about Iron hill Brewery restaurant and decided to check it out during my earthstrong week. Iron hill restaurant is huge and spacious. When we arrived, we were greeted by a friendly front desk server who informed to us that we could seat ourselves either in the front, back , at the bar, or by the window. We decided to sit in the back, which offered a dim lit setting.Our waiter was very friendly, we started with appetizers, we ordered the sweet potato fries and crispy brussel sprouts. Which both were delicious. The sweet potatoe fries came with two dipping sauce, one was liks a sweet vanilla sauce and the other was a savory aioli. I'll definitely come back just to have an experience with those delicious fries again.I also ordered sparkling water, which made me feel very swanky lol, and for my entree i had a seafood pasta. Our service was friendly and it didn't take long for our food to arrive.Iron hill gives me a vibe of a restaurant for happy hour relaxtion by the bar. The spacious atmosphere also is good for large party gatherings cause they have a private room area and lastly its good for just having a good time while eating delicious food!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-03-31T00:00:00.000"}
{"review": "I've really always had a good experience at Iron Hill. It surprises me due to it's large restaurant and high volume of customers. I figured, they're bound to mess something up one of these days, but they never do! This is such a great and affordable restaurant to go to with a very expansive menu. I love the Naked Burger Salad, Drunk Monk burger, and chicken wings. Every time I go with friends or family they love their own meals too so I don't think you can go wrong. Service is always attentive even when it's busy which is great. They have a huge beer list, so beer lovers should check it out.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-08-26T00:00:00.000"}
{"review": "To preface, I'll keep going back.  I think they have one of the best burgers on the Main Line.However, the service. Oh, the service. It is just so bad.  Last night we were there for over 2 hours. There was an apparent problem with the computers and it took an hour and fifteen minutes to get our food. When our food did come, part of my meal was cold (the other part scalding hot), two of my party's sides weren't cooked through...The manager did come over to apologize and was lovely. But something off happens nearly every time we're here -  either we get the wrong food, something is ice cold, our server is MIA...  such a shame because I truly love the burger. I dream of the burger.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-01-06T00:00:00.000"}
{"review": "Being a chain, you expect consistency. I get the salmon salad every time I go to an iron hill; I love it. The one here had the tiniest piece of salmon on and and a very small portion of greens. It looked like a half portion.... but I still had to pay $18. The manager was no help either. Overall, I would steer clear of this location.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-11-22T00:00:00.000"}
{"review": "I came to Iron Hill for dinner and drinks with friends. The front area is open seating so we opted for the bar area. The specialty cocktails can use a little variety if anyone wants my recommendations for the drink menu update let me know. I decided to get the Raspberry lemonade drink with tequila instead of vodka. It came with muddled raspberries, simple syrup, grand mariner and lime juice. It was fabulous so all my tequila drinkers out there try it. I ordered dessert for dinner. I got the Apple crisp and it comes warm with vanilla ice cream. The crisp was freshly prepared, cinnamon and nutmeg dance around inside and the apples were soft but not mushy. My friend ordered a turkey burger and it came out not prepared to her liking. They sent it back and then Jason the manager came out to apologize to her and talk with the table until her food was remade. The customer service we received was outstanding. Mistakes happen but it's all about how you recover and the staff here definitely aim to please. Thanks for a great time!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-03-31T00:00:00.000"}
{"review": "One of the best places to go to eat for a casual night out with family. Jerk style pork was amazing and service was ok as well", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-12-08T00:00:00.000"}
{"review": "Just meh. Pizzas are meh. Whatever my husband got he didn't like. We might consider giving it a other shot but we left unimpressed. Average at best..", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-08-27T00:00:00.000"}
{"review": "When I arrived with my mother, we were warmly greeted by the hostess. Upon being seated, our waiter Noah came and greeted us. He was helpful in helping us make selections for our dinner. His warm and gentle style made us feel right at home. The food came out HOT and amazing! I had the turkey burger and my quest had the ribs. The sever was so attentive that we never had to ask for refills or napkins. They came without hesitation. I would recommend coming here for a delicious HOT meal. And if you can get Noah.. the BEST waiter EVER!! Thanks for making this a great experience!!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-04-24T00:00:00.000"}
{"review": "Service is good. Food is good. My only complaint is the lack of space. They try to seat you around the bar and that's often the most busy and loudest place. The actual seating place is the back area. It is pretty small. I think if they had a bigger space it would be more comfortable for people.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2019-01-28T00:00:00.000"}
{"review": "Iron Hill is out goto place for good beers and food. I am a member of their club so this gives extra perks like larger beer for free, special prices on growlers and member events. Went that time with a group of friends and we share basically all happy hour appetizers from sweet potatoe fries, Brüssel sprouts, cheesesteak rolls and pizza. All good. Same is the beer. If you go there more often sign up for their club - it is worth it.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-05-06T00:00:00.000"}
{"review": "Chosen because of its gluten-free menu, Iron Hill Brewery served our group of 6 solid, standard pub fare.Pros: Great, friendly service, ideal location, and roomy booths.Pings: The \"medium\" burger was more \"medium rare,\" and the \"pizza\" felt more like a flatbread that needed to be fired in the oven at least a few more minutes.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-05-25T00:00:00.000"}
{"review": "Beer rating; At this time of year so many places have a variety of porters, stouts and just plain good dark beers. Iron Hill, I'm a fan of your Pig Iron porter but I'd suggest you consider stepping it up with the variety when it comes to dark beers.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-11-18T00:00:00.000"}
{"review": "Really decent place. Like an upscale Applebee's- in a good way. Food is consistent and good. Nothing is too wild or unusual and portions are huge. Great bar area too.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-09-09T00:00:00.000"}
{"review": "Great burgers, beers, and Baja Taco's!!! Friendly staff makes for a nice dining experience.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-09-09T00:00:00.000"}
{"review": "Nice drinks with friendly service. Grabbed a couple of drinks with my fiancee here. I highly recommend the strawberry mojito, it's a tad sweet, but quite flavorful and refreshing. The bartender was really helpful and told us about a few other bars that were open later. Overall, a decent sports bar for drinks. The Great American pub next door is a bit nicer, but the drinks aren't as good.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-05-29T00:00:00.000"}
{"review": "Great food, great service and of course the beer is good. Service is friendly and take good care of you. I have hosted many of parties and events there and they are always on point.  Whenever you need something you get it right away. Their menus change with each season and are always excellent.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-05-13T00:00:00.000"}
{"review": "I visited Iron Hill Brewery with the family for lunch on Mother's Day and we were all pretty disappointed. Three out of four ordered burgers and one ordered the seafood risotto which the server highly recommended. The only person who enjoyed their food was the one who ordered the risotto. Tip if you decide to go to the restaurant: listen to your server! I have no idea how you can make a burger so bad, but they amazingly did it. The burger was burnt along the sides of the patty, the lettuce was wilted, and the sweet potato fries were more like mushy sweet potato wedges. There are so many good restaurants in the area, don't bother with this one. Two stars because the server was attentive and the bloody mary was well made.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-05-25T00:00:00.000"}
{"review": "I came here starving so I probably could have eaten anything and thought it was good, but the burger I had here was delicious. I got the one with mushrooms and bacon. It was super juicy and cooked perfectly. The mushrooms were cooked down nicely and it was topped with 2 large slices of bacon and on a fresh bun. The only downside was it was too salty.  The service was ok at first but then it took forever to get the check. I did appreciate the constant water refills though. The atmosphere is also really nice here and they have some really large booths.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-03-02T00:00:00.000"}
{"review": "The food is delicious, service is always great, and of course there's always good beer! I've been here at least 6 times and it's always a pleasant experience. I'd recommend a reservation for dinner as it can get pretty busy.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-02-09T00:00:00.000"}
{"review": "This place is a default go-to for us. Menu has something for everyone and I generally look forward to having a beer. Tonight (a Saturday night) they were moderately busy but not \"lines out the door\". Service was slow, saw our main server only a few times. My daughter ordered the $29.50 rib steak with the onion rings asked to be on the side. The onion rings never appeared and we almost got charged for them as an extra because of the way the order was put in. Overall, the place means well but servers seem very disorganized with no supervision apparent in the dining room. We'll probably be back in spite of ourselves as it is a place that can accommodate a group but I wouldn't call this place a jewel on the Main Line.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-12-01T00:00:00.000"}
{"review": "Great service, fast food to table delivery, the waitress repeated the order for correctness, and prompt service upon checking in.They do understaff their waitresses so it did take a little longer to get the bill than preferred. They only had one waitress working a giant area so management ofthe plan was poor.The waitress herself was a sweetheart and very thorough. The table was very clean, in addition to the physical booth itself.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-01-01T00:00:00.000"}
{"review": "My husband and I have frequented this location multiple times both alone and with our kids. Each time satisfied with the beer selection and our food. My absolute favorite thing on the menu would have to be the Zeus Burger. While we enjoy good food, we appreciate good service to go along with it. Tonight we were lucky enough to have Elizabeth grace us with her service. Pleasant, knowledgeable of both the beer selections and menu, and very attentive. Thank you for a great evening!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-09-03T00:00:00.000"}
{"review": "Every time i take my dog to get groomed i head to Iron Hill for lunch. It's quiet on Friday afternoons and I can sit in a booth and work and eat lunch. Today i ordered the grilled chicken sandwich and a strawberry salad as my side. They were super accommodating as that is not a usual side, it's a starter salad. The sandwich was pretty good, a bit difficult to eat but sort of to be expected. The salad. The salad was interesting. So it comes with strawberries, goat cheese, almonds and spinach. All of these were good together but the salad was overdressed and weirdly salty. I'll chalk it up to a mistake because I've had it before at other Iron Hill locations and it was good. I would still come here again.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-12-08T00:00:00.000"}
{"review": "Disappointing. Beers were just so so. Mushroom soup was excellent.  Unfortunately the cheeseburger rolls were very greasy and actually without cheese.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-06-12T00:00:00.000"}
{"review": "So why would I visit here when there is an insanely popular privately owned brewery within walking distance.  I'd mention their name but I'm too \"Tired\" to remember it.  Also my \"Hands\" are shaking from drinking too many beers.I can think of at least three reasons to visit here.1. These folks have a serious and well executed food menu.  The other guys have great food but are not suited for folks that want to have a full meal.  2. The menu here is main stream gastro brew pub.  Almost everyone will find something that they will enjoy eating.  The other guys walk on the wild side.3. The beers here are typical chain brew pub suds and they are very good.  The others guys are quite eclectic and may be too much for some folks although I dearly love them.I dropped in today in the mood for some brew and a couple of appetizers.  The beer I enjoyed is irrelevant but what is important is the description was spot on.  It was exactly as described and I really appreciated that. First up was a Louisiana Chicken Gumbo for $5.25.  I've enjoyed it before at the Media location and here it was just as delicious.  It was packed with meat and just the right amount of heat. Next was Asian Style Meatballs for $7.95.  They were plated beautifully, slightly spicy, and completely satisfying.I have a recurring fantasy of meeting a bartender that is a Victoria's Secret model. Alas that was not the case today but the gentleman that waited on me was excellent.Yup, they are a chain but they have their act together and are well worth as visit.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-03-31T00:00:00.000"}
{"review": "Super friendly service from every single personGood food with delicious kids menu options that include some great vegetarian optionsGood value and nice extensive menuOnly flaw was that the place could use a good cleaning. They are always so jammed but the booster seat they gave us for my son was sticky all over - ew! - and the booth was a little \"crumby\". I know how fast they turn tables but a good scrub down every night and some more meticulous cleaning between diners would make it a 5-star experience for me.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-04-09T00:00:00.000"}
{"review": "Iron Hill has gladly become one of the few restaurants that I will regularly return too. I am not a fan of \"chain\" restaurants, so this is the perfect step above. And they have many locations.Our only problem was the wait, and I can't blame them for being busy. Our service has always been great and the food is always really good! I cannot say that the whole experience wows me and that is the lacking star. But don't take that as a reason now to go. This place is great for a date, a family get together, and a reasonably affordable location to get together and have fun. This is also really casual.We enjoyed the meatloaf and the calamari amongst other things. I will be returning!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-04-27T00:00:00.000"}
{"review": "We absolutely love this place!!!! It never disappoints us!!!The rib eye steak is one of our favorites and probably the best we've ever had, plus, it comes with the most delicious chimichurri!!! The meatloaf is really good as well!!! Yum!!! ....As appetizers we love the fried calamari and the hummus, both are amazing!!! They also have outstanding beer/wine selections and last but not least the service is outstanding (specially Kevin, he's super nice) Honestly I think this place deserves more stars!!!*****", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-01-07T00:00:00.000"}
{"review": "This is what has been missing from the area.  I moved to the burbs from the city and I was sad to be moving about a 1/2 hour drive away from the Chestnut Hill location.  I was so pleased when I saw the signs going up in the old DSW saying \"Iron Hill Coming Soon\".The food, beer, atmosphere, and staff are totally stellar!  The happy hour prices are nearly unbeatable for the quality of the offerings. $4-6 bucks for lots of food options and $2 off most beers... wowza.  I'm a sucker for a deal so its hard to turn down a quick weekday meal for under $10. Menu is hip while still providing solid standbys.  Pizza's are terrific, all the apps are fresh and well thought out.  Beers are cold and bar staff is friendly.The parking and some of the patrons are a little less unsavory.  Parking can be tough, very limited parking right out front but ample parking is available in the lot across the street.  Some of the customers are a bit condescending to staff/other guests. However all things considered its not that bad when you factor in all the rich old white guys who come in here.I have never been let down by Iron Hill in Ardmore, always a solid choice for lunch, dinner, weekday or weekend, proud to call myself a regular.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-05-13T00:00:00.000"}
{"review": "Came here late night for beers and a few appetizers. We were at Tired Hands, but after a few beers we wanted to try a new place. They told us there would be a 30 min wait for the dining room but if we could find something in the bar area, that would be open seating. We found a high table in the bar area which worked out because we could be seated immediately. I ordered the calamari and the chilled noodle dish. My boyfriend ordered a sampling of beers which come at a great deal of $1.50 each when you order 4. I highly recommend doing the flight,  it's a great deal and they have a large variety of beers on tap for you to choose from. Calamari - the breading was okay and the flavors were kind of bland.  Not amazing.Chilled noodles - this was the best thing for $3.95. The small plate is a good size and it satisfied my craving for Asian noodles with lots of good flavors. Solid choiceFlight of beer - great! We loved this.Service - it was good, but not great. We were looking for our waiter for awhile at one point. Also, there was and ton of seating In the dining room so I'm not sure why they couldn't seat us immediately?", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-03-09T00:00:00.000"}
{"review": "WOW! This place is huge! Somewhat of a quiet night compared to what I always imagined. We purchase at neighboring establishments quite often and this place just always seem really crowded from the outside. Then again it was a bit late!Our options were limited to the late night menu so we only had a few items to choose from. The appetizers seemed rather \"appetizing\" but apparently would not make good for combos (if you're thinking of pairing different items from that section). Our waiter was kind enough to point that out.We eventually decided to go with the calamari and nachos which were packed with cheese, beans, halepineos and sour cream. I've had better nachos but it was tastey and good for sharing. The  drinks were way better than I expected. I had the pomegranate margarita and hubby had the raspberry lemonade. Call me weird but I honestly thought the glasses were the cleanest I'd ever come across in a restaurant. They were crystal clear!After reading other reviews, I definitely will be going back to try other items on the menu. Clean environment, great ambience, pleasant staff...I'd say it was a good night overall!", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-02-14T00:00:00.000"}
{"review": "They have a decent GF menu. But they have awful GF beer and NO ciders!  Get this people. GF beer is the pits. Hamburger was good not great. Service excellent", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-04-30T00:00:00.000"}
{"review": "It's always a great time at the Iron Hill. This is usually a go-to place for my family and I. We enjoy the service, food, and BEER. We ALWAYS order a pitcher of their Vienna red lager. They have a couple of beers on tap and usually something seasonal for you to try. Just recently, I tried their Imperial pumpkin ale. If I remember correctly, they also serve a flight of beers if you want to try mutiple at a time.I am one to try something new each time, but I almost always get their brick oven Voo Doo chicken pizza. It's sweet, savory, and has a little kick to it! As a family we tend to order their hummus app and chipotle buffalo wings! Yum! I've also had their pulled pork, fish and chips, and chicken salad sandwich. All pretty fantastic! It can get busy at times but the servers are still attentive and nice. Will contine to come back here! FYI- You can order to take out including the beer. They have growlers for you to take home.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-10-27T00:00:00.000"}
{"review": "A belated review given the solid event I've hosted inside of it, and the different times and settings that I've been able to check out within. But in an area that's a such a huge beer haven now thanks to Tired Hands (especially with my being less than 3 blocks from Fermentaria), its been easy to lose track of Iron Hill as another solid option, with it being no fault to them whatsoever. Because with the eclectic food offerings, solid beer menu, and ability to offer other alcoholic beverages to the non beer drinkers; IH is a standout brewery that delivers with a unique level of character despite them holding down so many locations.The first visit was just to savor some beers and try some appetizers among friends. And with a Celtic red, one of their solid Belgian ales, and a an exceptionally hoppy IPA I got to experience the widespread and frequently updated variety of brews that they typically have to offer. Meanwhile the chicken wings were reasonably price and yielded a decent spicy kick without the overkill. Being the former cheese monger that I am I was instantly drawn to the odd sounding fried goat cheese, and while it was as weird and random as I expected, it was also kind of decent.On my second visit I got to host a vast table of friends and Iron Hill accommodated us admirably. It also gave me a chance to trying a n amazing dish from their veggie menu, and savor even more brews like their impressive Jumanji. Add in a 3rd visit that delivered some Hawaiian inspired brews and their incredibly priced  meal deal, and between all three I had enough different experiences to leave me sold!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-09-03T00:00:00.000"}
{"review": "This is your standard Iron Hill, with all of the same food and drinks.  The only difference was that the staff were rude to a person with an intellectual disability.  That's just not cool and I've had zero desire to return to this location.  Hopefully the hostess some wait staff and possibly a manager has been fired, but I'm in no rush to find out.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-08-24T00:00:00.000"}
{"review": "Surprisingly, this was our first time trying this Iron Hill location, even though it has been open for a while now. We were able to get a reservation on short notice on a Friday night. The place is huge, they must have at least 100 tables in there.  There big thing here is  beer but I am not a beer drinker so I stuck with a cocktail. We decided to just order a couple apps as we weren't super hungry. We ended up getting:Cheesesteak Eggrolls- definitely a stand out, some of the best i've had but kinda pricey at $12 for a tiny thingBacon Wrapped Scallops- Good, about averageHoney Sriracha Chicken- Also delicious, had a bit of a kick to itService was pretty good, I didn't have any complaints. For dessert, we got the triple chocolate hill, which is a large brownie and ice cream type dessert and that was also great. I guess my review would be better if I could comment on the beer, since this is a brewery, but even if I tried it I wouldn't even know what's good, haha. But, it is definitely above average gastro pub food. However, the price tag reflects that. We didn't even do entrees and still spent around $60. Now, I will probably be back as it's nearby and I really enjoy the food. But, I would come more if it was a little less.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-09-21T00:00:00.000"}
{"review": "Friendly, attentive, service, in a clean modern environment.  A varied selection of menu items make this an appropriate place to meet for a meal or just share some appetizers with friends.  The fried zucchini and calamari were both great.  A good standby if you are in the Ardmore area.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-08-30T00:00:00.000"}
{"review": "Iron Hill is a great chain restaurant to escape having to cook and do the dishes for the night.  My family that lives here tends to go here for good food and to try an occasional beer and avoid doing dishes at home.  Service is always speedy and polite and the few times that I've been here my server is always knowledgeable about their draft list and very helpful to suggest a particular beer based on the guests palate preferences.  For an affordable price with great service to avoid a night of cooking and dishes, this place has earned a spot on our local restaurant rotation list when the family needs a night off from cooking and cleaning.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-08-31T00:00:00.000"}
{"review": "Iron Hill was a great new restaurant when it first opened. I always enjoyed grabbing a bite to eat with friends and family and never had an issue. In fact, it was a place I recommended to many people in the past. However, the past couple of times I have been, their food seemed to have gotten sloppy and hasn't been the same since. My favorite, the cheese steak egg rolls have gotten very greasy and simply don't taste as good as they once did. Not to mention, the last time I went, I had gotten a flat bread pizza that tasted as if it was a frozen pizza from the food market!! I am not sure if they got a new chief or maybe just got lazy but i'm quite disappointed. I used to love it here and now i'm not sure if I will come back.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2018-05-08T00:00:00.000"}
{"review": "With a spacious restaurant and wide selection of good beer, Iron Hill will please everyone. So of course I'm going to compare Iron Hill Brewery with local microbrewery favorite Tired Hands next door. Tired Hands is a beer lovers brewery, with a menu that reads like a wine tasting list. However, if you're not into all that stuff and just want a wide variety of great beers with a diverse menu, Iron Hill Brewery will more than satisfy. The beers at Iron Hill are your more traditional selections such as  IPAs, Hefeweizens, Lagers, and Ales. The ones I sampled were superb, such as the Witberry, the House Lager, and my favorite the Hefeweizen. This is but a small sample of the beers they have on tap, and I plan on coming back many more times to check out the entire beer menu.I was also able to sample the food at Iron Hill, starting with the nachos. The nachos comes in two sizes which are both pretty large, so if you only have a few people I'd recommend the smaller option. They were excellent by the way - good amount of chip-to-cheese-to-salsa. I also ordered the House Smoked Pork Sandwich ($12.95). The pulled pork I thought was a little so-so, lacking the hickory smoke flavor I was promised from the menu. The coleslaw was a bit watery as well. It was the only disappointing part of the entire meal.Overall, I really enjoyed Iron Hill (especially the beer), and I plan on coming back many more times.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-07-05T00:00:00.000"}
{"review": "Our first visit to the new Iron Hill in Ardmore got off to a rocky start, but all ended well.  Props to the manager Kristen who saved our meal and this review!We got off to a bad start...This is a HUGE restaurant with TONS of tables and several different seating areas.  The hostess seemed to keep walking and walking and walking leading us down the primrose path...I was sure she was about to take us out the back door when we finally sat down at our table for 2.  It was in a very high traffic area between the kitchen\\bar.  There was a constant stream of Iron Hill employees going back and forth with empty plates, buckets of ice, food for patrons, trays of drinks, etc.  It was not a nice place to be seated, but the restaurant was pretty full so we sat and waited.  And waited.  And waited.  Finally said to my wife...The seats are bad, but the service is terrible!  We hadn't even met our server yet, much less gotten an offer for a drink.  Mere seconds after I voiced this a manager showed up at our table apologizing and offered to get us drinks and take our order.  She probably noticed me looking around the restaurant and thought I was looking for our server.  I was actually checking out the decor as this was our first time here, but I am glad she noticed that we were waiting a while and hadn't been attended to.  Kristen explained that our server Cory was very busy so she was helping out, and that she did!  We ordered the 5 cheese cheese plate, which comes with jam, craisins, some type of nuts I really liked, and some carmelized onions, along with some crackers and sliced focaccia.  It was a fine cheese board for 15 bucks, they also offer a 3 cheese board for 11.  My wife got a salad to start...but the kitchen had an issue getting our starters out...Kristen told us they would be out soon, and due to the delay, they would be comped, which really made me happy.  Not only did they recognize our dismay, but they did something about it without being prompted.  BIG plus Kristen!  Way to step up to the plate!  So the delay with the starters meant our entrees came out while we were still working the apps...No biggie, I'd personally rather have to shuffle plates than think about my food under a heat lamp back in the kitchen.  We finished our apps then got into our entrees.  My wife loved her seafood soup.  Delicious but not very filling in her words.  My chicken was very good.  It looked small at first, but they were thick breasts sunk into the mashed potatoes.  Juicy and delicious, I was very pleased with my chicken! Our actual server, Cory, came over as we were finishing our entrees and apologized, explaining that he was very busy with a large table.  He also reiterated that our apps were comped, and had a nice big smile the whole time.  Props to Cory for coming up to a table and apologizing!  Many would have just skipped that interaction. We split the iron hill brownie sunday for dessert...2 brownies, scoop of ice cream(you can sub out the vanilla if you like), Peanut Butter\\chocolate sauce(i'll ask for all chocolate sauce next time).  It was good and the only way nicer to end the meal was to see the 20$ in apps taken off the bill!  We definitely left feeling good and will be back for sure!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-06-16T00:00:00.000"}
{"review": "Went today for lunch.  Ordered a plate of Calamari, it was good but not great, the calamari did not have that chewy texture you expect, the sauce it comes with is tasty.  The beer was great, $6 for a 22oz!  I had the Blue Burger which came topped with thick cut bacon and onion strings as well as a side of fries.  Given the price and the quality of the food I would definitely recommend based off of the burger and beer.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-10-07T00:00:00.000"}
{"review": "I really like Iron Hill and I have always had good experiences at this location. Most recently, came here for Mother's Day. I had a few smaller pours of beer to try some of the stuff I haven't had before and my mom and I split 5 apps for dinner. We had an order of fries, nachos al pastore (forgot the guac but brought it promptly on request), cheesesteak egg rolls, lamb meatballs, and chicken Thai lettuce wraps. Everything was delicious, especially the lamb meatballs. Served with a spicy tomato sauce and feta cheese, the meatballs were super juicy and had great flavor. Would recommend.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-05-19T00:00:00.000"}
{"review": "Food and beers were fantastic. This is probably our favorite sit-down restaurant so far in Philly area. There's a ton of beers on tap and they were all awesome. We tried the crab cakes and Jamaican pork chop and both were so great and good size portions. We would definitely go back here!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-07-14T00:00:00.000"}
{"review": "Great service..ambience ..management is very approachable.. and asks for your perspective. .I like that !  All brews on location with a nice selection. . Shrimp Chipotle dish to die for. .deeeeliciius. will return!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-06-19T00:00:00.000"}
{"review": "I believe I checked out Iron Hill years ago, at the Media location. I was just entering the world of craft beers and tried one of their IPAs. I hated it. Not really the fault of Iron Hill, it's more that I learned here that I just don't like hoppy, pale ale/ipas. This may partly explain why it's taken me this long to give the place a second shot, but I also don't go out too often and when I do lately it's been primarily to Philly Proper. I can now say I'm glad to be back, because we had a fantastic experience there at McThrill's Pregame. There was a light crowd at happy hour and I was one of the first to show so I took a seat at the bar. Knowing now what kind of beers I like (and don't), I went straight for their Pig Iron Porter. I actually don't care what other beers they have or will ever have, so long as they keep this gem. I was planning on having 1 before the event, which promised booze, but I ended up having 3 because it was so good.I sampled some of their happy hour snacks; chips and Guac and the amazing roasted Brussel sprouts. I've been on a Sprout kick recently and these were better than expected. Our small group grew larger and we moved from bar to table, (McThrill did make a reservation for 15). The staff handled our ever growing party fantastically. I know it wasn't easy when we all had to shoot over to Pinot's and needed separate checks quickly. To backtrack, most of us are meals there because the event was food free. I saw some amazing choices but none deterred me from thinking I made the right choice with their bacon bleu burger. It was an above average burger that really hit the spot after a few porters. Again, an overall great experience and an added bonus that it took place almost exactly where Kiddie City had their video game (all 2600 titles!) section in my early years of riding my bike out here. We rolled into our painting event completely stuffed and satisfied.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-03-31T00:00:00.000"}
{"review": "The place is huge. Verrrrrrry long bar, dark wood furniture, and ample seating both in the bar area and in the dining area. I stopped in for happy hour on a Tuesday with another couple and sampled 8 beers @ $1.50 each. The glasses are about 4oz. One friend got a martini (I know! We were AT a brewery!) and the other had a couple pints. We shared the guac and chips which was great, but looking forward to trying more of the menu.Btw, they have free Wifi which is helpful because I didn't get very good internet. Why am I on the Internet when my friends are hanging out? Why, to Yelp of course!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2014-12-17T00:00:00.000"}
{"review": "Tremendous addition to the burgeoning beer capital of the Main Line, Ardmore. Very solid food with a big, diverse menu. Excellent brews, especially their seasonals. Staff is tremendous, from the greeters to the bartenders all the way through the wait staff. Can get busy, so be aware of that. I think the fish & chips are particularly excellent, and their specials are usually on point. Between Tired Hands, Beer Shoppe and the Iron Hill, Ardmore is the spot. Great place!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-05-19T00:00:00.000"}
{"review": "We have dined here several times and enjoy it. The pizza with whole grain crust is a favorite, as are the voodoo shrimp. And, of course, the beers. Love the beers. The kids menu is great. I do feel a bit rushed sometimes. But that is to be expected at that type of place.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-05-30T00:00:00.000"}
{"review": "I went here to celebrate father's day with my family and I was very impressed. The restaurant was well designed. Good ambience. There is a large selection of beers. Someone in my party enjoyed trying out a couple and gave them both stellar reviews. I also like that they describe the individual beers on the menu.  Had the nachos for an appetizer and the portion was huge. They tasted great and had their own flare with cilantro and other atypical ingredients. My bleu cheese burger was flavorful.  Service was good and friendly. I subtracted 1 star for pricing being slightly higher than the average bar and grill and for booth being a little tight. Overall great food, good environment, and a comfortable place for a family outing or a cozy date. Will go again in the near future.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-06-18T00:00:00.000"}
{"review": "I always seem to have above average experiences with this place.  Whether it's this one or the one in Media.   Was here with 2 coworkers and our server Sam was like a walking talking beer encyclopedia .  Very nice too.  Had a sampler of the seasonal brews.  Good way to get a feel for the different types they have. But after that - just decided to go with the \"Red\" one and stayed with that. The egg rolls and the chicken sliders were fantastic.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-07-22T00:00:00.000"}
{"review": "Iron Hill Ardmore is a solid spot. We've been here several times in the past two years. They have a larger high top section than the the Media or WC location but it remains busy during peak hours. Food I'd rank at 4 out of 5. The offering is the same as the other locations and has been of quality with drool worthy specials. For those who don't like asperagus, they're always willing to sub in broccoli or the daily veggie for no extra charge. Staff is always friendly, eager to please and on point with recommendations and making our visit good/great. Parking is usually good, there is a large free public lot across the street next to the fire house.Beer selection is good and theres always something for everyone on draft or you have the option of a full bar. Would recommend as a safe dinner bet. :) Also they didn't give me any grief for asking when I asked for a childrens menu to color.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-12-16T00:00:00.000"}
{"review": "I am a frequent flyer of the Chestnut Hill and have visited the locations in Media and North Wales.  I was glad to see the location and the size of the place.  I love the selections of beer of course - this is what they are about!!  I am a HOP Head...so when they have special releases - Such as Lex Luthor - I will clear my calendar and make my way to a location to get a taste!!  Now, don't get me wrong, they have some pretty good food too:  Calamari, Salmon Egg rolls just to name a few.  The brunch is something to check-out too.  This location does have a bit too many young folks at times, but it's ok - I remember those days and I am more forgiving once I am sipping an enjoyable beer.  Hint:  Join the King of The Hill Club...You get pretty good perks and a cool Mug whenever you go to enjoy your favorite beer selections.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-04-30T00:00:00.000"}
{"review": "Meh!We went there for a couple of beers and salads.Awful! The salmon on the salad was burnt. We showed it to the waitress, who stood at the table helpless, hapless, and, frankly, stupid--offering no solutions.The beer is similarly disappointing, watery, tasteless, and just underwhelming.We are not returning.There are simply too many choices for a great beer, responsive wait service, and satisfactory food.", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-02-29T00:00:00.000"}
{"review": "Multiple visits at different locations! Price is reasonable and beers are tasty! Besides, the service are always great at different branches.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-10-29T00:00:00.000"}
{"review": "When I signed up to go to this restaurant I envisioned a cool atmosphere with boutique beer and upscale bar food. I was disappointed with the space and since it was a Friday night it seem like every family with their crying baby was out at this restaurant. My husband wanted some plain old comfort food and I pushed him towards the chicken pot pie. He was fairly happy with it although I'm not a huge fan of chicken pot pie... This chicken pot pie did not win me over either. I had some scallops wrapped in bacon which because it had bacon was pretty darn good. I believe it's pretty hard to mess up scallops and bacon but still the presentation was underwhelming. Saving grace of Ironhill brewery was our waiter. He was a delightful, friendly and accommodating. It was a very busy night and he was good at his job. I will not go back to this location of Ironhill brewery.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-12-21T00:00:00.000"}
{"review": "The Iron Hill Brewery gets just an A-OK. Their beers are worth a stop-in. However, the food and the service lack the luster of their beers. Lee was polite enough but needs a refresher in excitement about a well-designed menu and a variety of flavors and combinations. While we wanted a light meal, the server was unable to recommend viable options and even asked if \"that was it\" when we only ordered appetizers.Well, the \"excitement\" didn't stop there, the chef must have found a deal on salt as our food was oversalted - two orders of seafood bisque and the crab cake entree with a side salad (also over salted) were worth the wait except for the small clumps of undissolved flour roux in the bisque. Such a disappointment.Training on the front end and the back end greatly needed!", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-02-26T00:00:00.000"}
{"review": "Too busy to serve you well! Server dumped a whole glass of ice water on my husband and wasn't really concerned about it. Mentioned it to the manager, when he came by to \"see how everything was\" and  he was less concerned! Too bad! Have visited this restaurant several times in the past but I think this will be our last time!", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-11-18T00:00:00.000"}
{"review": "I recently stopped by at 5.00pm on a Monday after missing out on lunch. No worries parking outside at that time of day.  The small free lot out front probably fills up pretty fast most nights but there's also a public parking across the street.Was trying to be good so resisted my usual desire to benchmark their fish and chips (...I grew up in England) until another day and ordered the flank steak salad as an entrée.  Washed it down with a couple of malty lagers.  One was a Wildcat special (Villanova being down to the final four in March madness at this point), the other was their red lager - both were solid.  The man sized steak salad was delicious too, would order it again anytime. The menu covers a lot of bases, can't imagine you won't find something you'd like here.  Service sitting at the bar was the right balance of attentive and friendly while leaving customers to enjoy their drinks and food at the same time. I just liked the fact that this Iron Hill is fresh, clean and has good food, drink and service, I'm sure I'll be back again soon.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-04-01T00:00:00.000"}
{"review": "Great service.... we just had apps, but everything was good.. the bacon wrapped scallops and the honey Sriracha chicken were excellent  !!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-03-11T00:00:00.000"}
{"review": "I'm a big fan of all iron hill restaurants and was excited to find this hidden gem. Food was great, ordered salads with chicken and salmon, and beer was fresh as usual. The only reason I gave 4 starts was because the location is a bit awkward.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-04-30T00:00:00.000"}
{"review": "Yes, the beer selection is undeniably on point, especially for a raging IPA enthusiast who loves her hops. But the food leaves something to be desired, every. Single. Time. The hardest thing about Iron Hill isn't the parking. It's remembering what I ate there for dinner. Their grub follows a pattern of bland that is truly lackluster and devoid of inspiration or flavor, but hey. At least it's consistent.  The cheesesteak egg rolls, though? Surprisingly, they're amazing, and perhaps the sole outlier within an expansive menu of mediocrity that takes the form of a novella (not Cheesecake Factory-level redonkulous, but you get the gist). Something for everyone, but almost nothing for me.Every time I go, which is probably once a year, if that, I ask myself why I'm here, and why it's so popular. I first went to one in Phoenixville and was underwhelmed. Then I lunched at their Chestnut Hill spot, and I felt the same. When the Ardmore one came along, I knew what to expect.Fool me once, shame on you. Fool me twice, shame on me. Fool me three times, and I'm no fool. I'm probably just along for the ride to humor you.I have a better time at Ardmore Beer Shop, and their hotdogs rock my world. Want atmosphere? Head on over to Tired Hands or Fermentaria for epic eats and libations.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-01-25T00:00:00.000"}
{"review": "I have visited this place 2 times now. I should admit that beer menu is just too good. It has some thing for everyone ranging from lager to IPAs to stouts. But on the other hand, my experience with food has always been sub-par. Hope they make it better.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-04-23T00:00:00.000"}
{"review": "The worst.  Came at 10:30 pm -  unwelcoming staff and every single table  was dirty.   No one to speak to and after walking around looking for a table someone finally came to is snd told us to sit anywhere. How gross - no where to sit that was bussed and the server didn't understand what to do.  Walked out - plenty of other places to go .  Unfortunately had to give 1 star because no way to give none", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-03-18T00:00:00.000"}
{"review": "Great beer selection, good bartenders. Crap food. My \"burger\" was premade, as were my fries. But then, with a multi-page menu, expecting the food to be made to order is ridiculous.I don't miss much about DC, but I do miss knowing that restaurant food can be made in house and served fresh", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-11-06T00:00:00.000"}
{"review": "Although this was my first trip and only had beers and appetizers at the bar the place was delightful. The bartender helped me pick out a beer that would complicate my taste and she did a wonderful job. We had a few appetizers and they were great. Everyone in the place I spoke to was pleasant and friendly. I would surely go back another night for dinner.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-04-08T00:00:00.000"}
{"review": "We took two co-workers out to lunch here yesterday to celebrate their birthdays. The restaurant was pretty empty, so we figured there would be no problem finishing in the one-hour lunch time we had. To be safe, we ordered our drinks and food right away. The waitress spilled ice water on the table and said she would be right back to clean it up. Needless to say, it was lucky that the place was empty and we could take napkins from an empty table to clean it up ourselves, since she didn't come back for awhile...for a long while.The service went downhill from there. We waited and waited and waited for our food; one person's order was wrong. We had to ask for the check because our one-hour lunch had turned into an hour-and-a-half.Food was okay, but with service like that I doubt I would go back for another birthday lunch.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-12-08T00:00:00.000"}
{"review": "For whatever reason we didn't order any beer - but the cocktails we ordered for a late lunch were delicious!We wanted some good comfort food for lunch and headed over on NYE. Surprisingly there weren't a lot of people and we got a table quickly. Our server was young and maybe because it was NYE she seemed anxious for us to finish. I don't like being asked if I'm done when my fork is midway from plate to mouth. She did this 3 times before I got fed up and let her take my plate away. The food was decent - like it's been mentioned here already the steak egg rolls are stupid expensive for the size. We ordered standard fare - burger - pizza - fish & chips.  Maybe I would have ordered dessert if I hadn't been rushed with the meal.Not sure if we'll be back.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-01-02T00:00:00.000"}
{"review": "Great beer selection and beautiful ambiance. Fits the neighborhood well.Also, the burger was really good. Headed back there tonight for our third time.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-10-30T00:00:00.000"}
{"review": "The restaurant has a nice friendly open ambiance. The food is always spectacular and trying out the different beer selections is always fun. They offer free beer tasters so you can try before you commit. They have a rotation features menu that are always delicious and makes a fun change to the usual selection. They are a little pricey but they do make the food fresh from scratch so it's understandable and definitely worth it.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-12-26T00:00:00.000"}
{"review": "Not impressed. This place has been on my to-do list for quite awhile so maybe I built it up too much in my head and had high expectations...but there are some key factors leading to my rating that can't be ignored.Number one issue - the service was weak for a slow Sunday evening. I look around us and there are servers checking their phones, chit-chatting, the place is pretty much looking overstaffed. But somehow it took 15 minutes to even have our drink orders taken. And then at the end of the meal it took even longer to receive our check. Number two issue - the value for the price. I have no problem paying $10 for a well-crafted small plate. But we ordered the Voodoo Shrimp for $9.95 and received 5 measly little teeny tiny shrimp swimming in some spicy sauce and a little scoop of rice to the side. If the shrimp were large, that would be one thing, but these were laughable. We also had calimari (nothing special) and a grilled salmon salad (equally unexciting - although a nice portion size for that). The beers were pretty yummy, so maybe we'll sit at the bar someday but I highly doubt we'll return again for a meal.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-05-26T00:00:00.000"}
{"review": "I've been to this location of Iron Hill Brewery with friends (who live close by) several times! We just can't seem to get enough of this place. It's cozy, welcoming, spacious, and... just plain delicious!There are usually about a dozen fresh beers on tap... definitely your seasonal favorites, at any time of year. I've loved the pumpkin spice varieties in October, wheat beers in summer, and Christmas ales in December. The food is amazing too. Pizza, steaks, pastas, salads, and more. Iron Hill serves up generous portions of your hearty staples, with the perfect sides, garnishes, and flavors! Still loving that pint? Take home a growler, and bring it back to refill at a discount! That's what I usually do.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-06-19T00:00:00.000"}
{"review": "Healthy options, decent beers, and pretty good Happy Hour deals. The food is a little overpriced but my \"healthy selection\" beef tenderloin medallions were cooked perfectly rare as requested, were well-seasoned, and the mashed potatoes were good. I found it to be the perfect amount of food for dinner, but I wish the asparagus had a touch more flavour than just being steamed and naked (a few more spears would also have been great, 3 just left me wanting more veg). I don't think I'd go out of my way to come here, and I prefer Tired Hands in general, but it's a big space and a people-pleaser.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-03-30T00:00:00.000"}
{"review": "I love this place, the ambiance, the staff is great....but the food is incredibly salty!  And I love salt. But this is too much. Third time. Still massively salty.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-12-02T00:00:00.000"}
{"review": "Great lively atmosphere on a Saturday night. Family friendly. Excellent service. Really great nachos. I liked the onion soup that I ordered. I hated the entree I ordered - ahi tuna salad. It was grilled and just tasted burned. It pained me to eat it.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-09-10T00:00:00.000"}
{"review": "Brick and Brew is a great place to go with friends and family (they have a separate area with no bar so you can bring your kids) I almost can't tell their is a bar on the other side.And the food 98% of the time is amazing!!! I always get the Big Bold Blue Burger.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-01-12T00:00:00.000"}
{"review": "This place is the bomb! I am pumped to have another cool brewery in Ardmore, and one so close to my apartment too.My friends and I have come here a few times to watch football and to indulge heavily from the appetizer list. I have sampled a pretty large number of their goodies now and they are all amazing--especially the Brie Stuffed Mushrooms and Salmon Spring Rolls. I wish I could have an endless supply of either delivered to my front door!The service is also fantastic. All of the servers and bartenders greet you with a smile and are happy to chat. This place obviously did a great job of stocking up on good people to get a positive first impression going. Another cool thing about Iron Hill is that you can become a \"member\" for extra benefits. I'm not exactly sure what the details of that process are, but it does get you a free mug and discounts on drinks and food every once in awhile! More research needed, but it sounds cool for brewery junkies like myself.Did I mention that their beer selection is great??", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-02-04T00:00:00.000"}
{"review": "I can't say enough good things about Iron Hill in Ardmore! The entire staff is very friendly and helpful, the beer list offers something for everyone and the food is phenominal! I have yet to have a bad meal here.Flights are a great way to sample a few beers and narrow down your beer selection, if the detailed descriptions don't do it. And once you find a favorite it's best to go back often because they're always changing out the selection. Most recently I had their anniversary brew \"Ferrous 20\" and it surprisingly became my new favorite beer (surprising because it has a very bright yellow hue to it, which I assumed equated to not liking it). I had to bring a growler of it home it was so good.A new offering on the appetizer menu was Fried goat cheese, served with onion confit and strawberry compote. This is a great dish, and the flavors work so well together! I do suggest asking your server for a side of crostini or \"bruschetta bread\" to smear all that tasty goodness on. The crunch of the bread helps breakup the richness of the cheese and really sets the dish off!They also have this awesome to-go offer where you can get 2 pizzas and a growler of your choice for $25. You can't beat this deal! The pizzas are smaller, so probably best for 2-3 people, but a perfect answer to a cozy date night in, with a few pieces left over.The bar area is really nice with numerous TVs around and high-top tables and booths for groups of all sizes. I've always sat in the bar are because I really like the vibe, but the dining room behind the bar looks really nice, quiet and a great place for families or a date night out. The parking isn't the best, with a small strip lot directly in front of the building, and a larger lot across the street, but both fill up quickly and on a Friday or Saturday definitely expect to take a few laps around before finding a space. But I promise, your reward inside will be worth it!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-11-14T00:00:00.000"}
{"review": "Really good waiter. He explained everything and gave us good beer suggestions. He was nice. The portions are really small for the price. My boyfriend got the fried chicken and it was really small and the cornbread the came with it tastes like it was made with pure depression. I got the black bean burger which wasn't flavorful but did come with some cool toppings. They literally gave me 15 fries. The fries were really good so that sucked. Also we had no idea it was self serve so we waited at a seemingly host stand for almost ten minutes and no one said anything to us. The beer was cheap and really good, and that's the only thing I think I would come back for. Do not go if you want food to take home or want good portions.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-06-04T00:00:00.000"}
{"review": "Good ole reliable pub food. Great selection of brews. Seasonal selections are a treat", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-09-09T00:00:00.000"}
{"review": "Horrible customer service! I had a made a reservation online, arrived 15 minutes early, checked in and was told to have a seat. Watched multiple people come and be immediately seated. When I approached the desk, and asked about our table was told they were getting it ready. When they finally seated us, I looked around and noticed at least a dozen empty tables. No apology from the girl seating us. The only positive from the evening was our waiter who was very attentive and provided excellent service. Sad that the first impression that guests get are rude, unapologetic, staff.  Will not be returning!", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-04-14T00:00:00.000"}
{"review": "Go-to spot for a casual dinner when hanging with the boyfriend in Conshohocken (yes, I know it's in Ardmore)...I've had the brussel sprouts to share (a little oily, but hey, they're fried - not battered, but still flash fried), crab cakes with coleslaw and the flat iron dry rubbed steak. Everything has been within the \"casual fare\" expectations and Iron Hill is very flexible with dietary restrictions and making sure your food is made to order.Iron Hill also serves one of my favorite California Cabs - Josh, it's very decently priced too, which for the East Coast is refreshing. We always sit in the bar area which is first come, first serve and is livelier than the restaurant section, which is why we prefer it to the main dining room. On Friday and Saturday nights though you may be waiting for tables/seats to open up, but definitely worth it. Great atmosphere to catch a local game without your shoes sticking to the floor and with a more sophisticated crowd.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-04-22T00:00:00.000"}
{"review": "I enjoyed my experience here. Two friends and I came here for dinner and some beer, and I ordered the petit filet mignon. My only qualm was that while I asked for medium, my steak came out well done. The server was very quick to address it however, and they got me a new one out relatively quickly without any issues or argument. Once I got my steak at the right temperature it was delicious! The smashed potatoes with the corn and the crabmeat was so good. We also got a pitcher of the Witberry, which I'd recommend if you like kind of fruity wheat beers. It was a good choice. I wish though, that they offered dessert before dropping the check, because as I was walking back to the car, I thought that I'd have really liked some dessert! lol, but no big deal.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-12-15T00:00:00.000"}
{"review": "We used to come in a lot. Until last time we were there a few weeks back (accidentally) witnessed the cook handle our tuna steak with his bare hands. This took out passion for this place... but until that incident, we loved the food especially the salmon salad with the tuna steak on top and of course the beer is nice.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-04-26T00:00:00.000"}
{"review": "The knowledge of Sam with the gluten free was very good when it came to ordering beer and my food.  The brewskie burger was awesome.  Very juicy!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-08-13T00:00:00.000"}
{"review": "First, this place is absolutely huge. It's a perfect spot for a big group gathering. The staff is nice, efficient, and very flexible. I organized a farewell party there for about 20 people, and the waiters kindly agreed to keep separate tabs for everyone. When I went back a second time with just 3 friends, we sat in a more intimate booth, and the waitress was incredibly thoughtful and helpful as well.When I went with a large group, the food I got to try came from the shared plates section on the menu: the house nachos were very good, as were the hummus and the excellent hand cut Carolina sweet potato fries (those are really thick). My second experience was more of a dinner situation in which everyone had burgers. My Santa Fe burger (which comes with beef or turkey) could have been excellent. The brioche bun was delicious, the guacamole fresh, and the bacon crispy to boot. Sadly, the meat paddy was so incredibly thick that the beef completely overtook the other flavors. The burger turned out to be overly messy as a result, too. The salad that came with the burger (you can pick two kinds of fries if you prefer) was fresh and nicely seasoned. I hope this helps!", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-05-05T00:00:00.000"}
{"review": "I was skeptical of the new Ardmore Iron Hill considering the Media one had always been massively disappointing.  But after a few visits for dinner now my mind has been changed and I'm really happy to have this place nearby.The food menu is extensive and everything I've tried so far has been very good.  In addition to more traditional pub fare like mac and cheese and fish and chips, you can also find a good selection of healthier meals like a variety of fish plates, a quinoa salad, a couple chicken dishes, etc.  In fact there is a whole \"lighter fare\" section with entrees under 600 calories.  I love the nachos here, the shrimp penne has been excellent both times I've gotten it (although the sauce seemed a little watery the second time), there was a duck breast special once that was phenomenal, and the quinoa salad is also excellent.The beer here won't knock your socks off, but it's definitely still passable.  On the first few visits they offered a sampler of 8 beers (6 house beers selected for you plus two seasons you got to pick), but disappointingly that has since been removed from the menu.  I asked the server about it and she told me you can still get it if you ask for it, but if your server's new and doesn't know about it you're probably out of luck.  There still is a smaller seasonal sampler available but I really liked the original larger one.The rewards program is very odd and seems to be littered with gotchas.  You have to pay to be in it ($25/year I believe), you have to fully register online or it won't start working, I guess even if you have a reward on your card and don't tell them it won't be applied automatically, and above all, BEER PURCHASES DO NOT COUNT!  Yes, a brewpub that brews its own beer and is supposedly all about beer but no rewards for drinking their beer!  I had received the rewards club as a christmas gift but I probably won't renew it next year as it has just been complicated and confusing.  I could've sworn two visits ago there was a note that I had a $25 credit for next time but that wasn't applied on the next visit, nor any account status given that time and I really didn't feel like trying to flag someone down again after paying to figure it out.  I wish they would just do something similar like Rock Bottom where you get points for the beers you drink, the credits are automatically applied, and it's free.  Paying to be in one restaurant's reward program seems like something from the 90's, not 2015.The restaurant itself is well done inside.  Modern, clean, and well lit.  There is a nice bar area up front and a huge dining room in the back, plus some smaller rooms off to the sides for private parties.  It does seem to attract large groups and as such can get pretty loud and chaotic depending on when you come in.Service overall has been ok, it's always been friendly but sometimes has been very slow.  Prices seem to be a bit on the high side-- I was a little surprised by the check on the first visit and probably would be visiting a lot more often if it was just a little cheaper.Overall, very good food, good beer- a great addition to Ardmore that I will certainly be back to visit in the future.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-02-16T00:00:00.000"}
{"review": "What a great idea for Ardmore.  A good brewery/restaurant for a good hamburger and such.  Unfortunately, this is not it.The place is really huge and quite well thought out.  The restaurant with reserved seating is in the back and must have 120 seats.  They seem to be fully booked most of the time.  The bar area is similarly huge and is open seating, so you can stop by and find a table.  The place is comfortable and the noise level reasonable and the service is well trained.The food is another story.  The menu is too large, trying to satisfy all comers with something of interest, but the quality is right off of the T.G.I.Friday motif, with sauces from a can and low quality meat.  The hamburger was large but greasy and tasted like low quality beef fried in oil.  The fish taco had small fried bits of fish on a nicely decked out taco, but without a clean fish flavor.  And the pork cutlet was good, but covered with a mushroom sauce that was inedible: sweet and gloppy and had to be scraped off.The beers were delicious however, and this venue is just fine for a few brewskis and some bar food appetizers.  Nothing more and nothing less.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-03-13T00:00:00.000"}
{"review": "I was excited to hear another great restaurant was moving in the Ardmore area. It amazes me that more businesses have not captaziled on the wide open market of the \"mainline.\"   I found the Iron hill brewery to be an excellent place to relax and have dinner, with and without kids.Their beer selection is as good or better than any in the area. A little secret drink that my girlfriend always gets here is an amazing Bloody Mary. I don't ordinarilly like these, but the bartender here makes them with pepper vodka and they are amazing. Our favorite appetizer is the Tempura Asparagus and all the entres we have ordered so far have been great. That includes steaks down to salads.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-03-05T00:00:00.000"}
{"review": "By no means am I a drinker, but I wanted something different than our usual Tuesday night 55+ BOGO fare from the IHOP around the corner - so hubby and I stopped into Iron Hill Brewery. We were pleasantly greeted upon our arrival and whisked immediately to our table. Now, let me stop right here to address a new issue in my life. I'm presently on a walker/rollator, so to enter a restaurant that has a ramp to get to the main floor of the restaurant is a BIG PLUS for me these days...but I digress. Our server (who was in training) was Mr. \"Johnny On The Spot\", he was very attentive and knowledgeable about the menu. I ordered the crab cake entree w/a side salad and hubby ordered the fish & chips. The food was so good, but I realized that I was overeating & had to force myself to stop. They packed up our \"to go\" bags and replenished the sauces for the entrees. The next day, the food was just as delicious for lunch, and those awesome potato wedges reheated excellently in the microwave! Now it's a little pricey, but not overly so, especially since the food was good and enough for two meals. The Arnold Palmers were not really tasty, so we just returned them and got Cokes instead. That was our first time at Iron Hill Brewery - Ardmore, but definitely not our last!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-10-13T00:00:00.000"}
{"review": "I personally didn't enjoy this place very much; I didn't like the beers I sampled, nor did the food strike me as worth the price. I thought it was extremely bland and gussied-up cheap bar food. Also, as someone who uses a cane, I had trouble getting the right seating for me, and I stood around for a while before I found anyone to help. It wasn't a total disaster, but it was by no means worth it.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-02-22T00:00:00.000"}
{"review": "The chefs know how to prepare solid meals.  If you like to taste real good food, go.  The beer is made with expetise and is flawless.  Service is up to par, may be above par, very eager to please the crowd.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-06-27T00:00:00.000"}
{"review": "Iron Hill is a great place to hang out, and the food is pretty good.  I prefer places with a little more local flair and this place has more of a chain feel to it.  That said, the menu is solid and I haven't had a bad meal there.  I like hanging out there with friends for happy hour, having a beer or two (the beer is good), and some appetizers.  I wish there were a little more selection for appetizers, but otherwise, it's a solid place.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-07-18T00:00:00.000"}
{"review": "I really like it here.   Unfortunately, I'm afraid to sway from what I've found I love- and that's the Fried Goat Cheese appetizer and the Parma Pizza.   They're both delicious.   One of my daughters refuses to try anything but the Parma pizza!  We've tried numerous other appetizers and have been pleased with all of them.  The brussels sprouts are delicious, as well as the calamari, the hummus platter and my family says that the mushrooms are great- although I don't eat mushrooms.  The Voodoo Chicken pizza, meat lovers pizza and the mushroom pizza are good (although the last one is per my family...)  I haven't had anything that I didn't like, yet.  I can't vouch for the beer, although I've heard it's great.  I'm just not a beer drinker.    I'm hoping to be able to move on to an entree eventually, but I really love so many of the appetizers, it's super hard not to order a few-  then I can't fit a full entree in, also.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-04-06T00:00:00.000"}
{"review": "This is a fine establishment with excellent food and friendly staff. The chicken with teriyaki glaze and rice is amazing. Under the 600 calories or fewer section, this dish makes eating healthy fun and delicious. 10/10", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-06-23T00:00:00.000"}
{"review": "Overall i always have a great experience. The pitchers of beer available is great for group setting. Everytime we visit we always get a pitcher of beer and then order some appetizers and a pizza.  I would recommand their voodoo chicken pizza and the buffalo chicken wings.  They compliant the beer we ordered.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-04-24T00:00:00.000"}
{"review": "We have passed by this restaurant a few times and always wanted to try it. It was definitely a great choice, the food was great, our server was attentive and took the time explain the difference of the beers we chose for our sampler. My husband was also extremely pleased that the Barcelona game was playing on 5 different TV's around the bar/self seating area. I would also like to say unlike some other restaurants we didn't feel pressured to leave or pay our bill even though we took time between finishing our entrees and ordering dessert (which was also to die for - Triple Chocolate Hill).", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-06-06T00:00:00.000"}
{"review": "Food here is quite good.  Nice selection too.  The beer is acceptable.  Nothing to write home about, but it's cool that it's brewed in house.Best thing is the two pizzas and a growler deal for $25.  Takeout only but an awesome easy dinner.If you go here a lot you can become part of their mug club to get $25 for free when you spend $350 in food.  You also get points just for going there.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-02-08T00:00:00.000"}
{"review": "Another roll out of the regional chain. Beer: goodFood: some dishes were better than othersService: started strong and then disappeared 2 courses took 90+minutes.Ambiance: we sat in the bar. Decor is traditional iron hill but the view of a car dealer service entrance and plumbing supply business is lack luster as is the parking.Take away on this location. Order food inside their comfort zone, and sit in the dining room if you like to people watch or are going for an event or ocassion. However the music was better than most locations assault of satellite service wmmr-esque rock.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-02-15T00:00:00.000"}
{"review": "A  crowd pleasing, family friendly menu seems to have made this place an instant hit with the Eastern Main Line crowd.  On a recent Sunday night the place was bustling. I would recommend reservations though they do have an area for self seating I am not sure how it works. We made reservations on opentable, and there was a little confusion at our arrival because we were 5 minutes late for our reservation and they couldn't \"find\" it --apparently your name goes off the list if you are one second late. However, the manager was able to \"find\" our reservation and we didn't have to wait too long to be seated.For apps we had the cheesesteak eggrolls which had a good crisp exterior and what you'd expect inside, and the fried Brussels sprouts which were delicious .The seafood bisque was a hit.Of the entrees,  I most enjoyed the Jaegerschnitzel ( a \"brewhouse favorite\") which consisted of two tender breaded and fried pork chops with a rich mushroom sauce, served with buttered noodles and green beans. Very tasty, my only criticism it was a little on greasy side so not for  light eater!There is, of course, also a variety of house brewed beers on tap and available for take home in growlers. So that's a plus if you enjoy craft beer, or just want to give it a try.  Ambiance is casual, bustling and a bit on the noisy side for conversation. Service was quick though as this place is new it was not surprising that our server seemed a bit inexperienced.Overall, we had a good experience here and would return.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-02-24T00:00:00.000"}
{"review": "Everything on the menu is great.  The service is very good.  My only complaint is I wish people would take small noisey children to chuck e cheese or get a baby sitter.  A bar is no place to have to put up with them.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-01-22T00:00:00.000"}
{"review": "I came here around 10pm with my BF & they had a late night menu . I read reviews about this place & was not disappointed. The salmon spring rolls really are amazing with just the right About of zingggg!! Their drink menu isn't too shabby . I love all the drink options here. The staff was great & always on point. I love the attentiveness we received as if we were the only table our server had. If you're in Ardmore, stop in & check this place out!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-02-28T00:00:00.000"}
{"review": "I like this place a lot and am usually here for lunch.  Beers are solid, and the food is good.  Although more than once I have been here for dinner and things weren't as good as when I was here for lunch.  But all in all I thoroughly enjoy all the iron hills I've been to.  The bartenders are awesome, especially Christina!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2017-05-06T00:00:00.000"}
{"review": "Great service, solid beer variety. Been there twice now and a couple of misses on the food.This time the pork belly app was not anything like a proper pork belly dish (rushed, not cooked/braised) and previously the nachos were poorly prepared. The hits, though were spot on. Great salmon dish tonight ; last time we had the fish and chips and out was excellent.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-01-24T00:00:00.000"}
{"review": "This restaurant was very good!We came late last night and they accommodated us. First, drink orders 1 Coke, 1 Root Beer, 1 Water! Root beer, I got it was pretty good.Food: 2 Chicken Pot Pies, 1 Ahi Tuna SaladChicken Pot Pie: Very goodTuna Salad: Very good and tasty.I would come back.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-02-01T00:00:00.000"}
{"review": "Got a gift card so Sunday got some apps and paid $11 for two cheesesteak rolls which is ridiculous! Ordered a cheeseburger for $14 the next night to finish the gift card and it was rare when I asked for medium well.  Their prices are outrageous for the junk of food they're putting out.  It's bar food that sucks for a ridiculous price. Definitely not worth the money and I myself am not a chef and can cook a better meal. All I can say is the poor people in Ardmore being fooled and I'm glad it wasn't my money. Chilis in Wayne has way better food and a lot cheaper!", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-02-01T00:00:00.000"}
{"review": "This was my first time visiting.  Thankfully I had a reservation as they have two areas - a large open seating bar area and a reservation only dining room.  The restaurant is large and the decor tasteful but not stuffy.  I had the Witberry ale which I adored enough to bring home a \"Growler\" or jug which they sell for all of their brews.  The food was tasty - a notch above typical brew pub fare.  We had the veggie wrap, the eggs florentine, fish and chips, and the chicken salad burger- everyone was happy with their meals. Our kids had the standard kiddie fare - chicken tenders and pizza- which also comes with a dessert ice cream if desired.  All in all, a nice place with homey food and really nice brews. My only complaint was the front staff where there seemed to be a lot of people standing around doing nothing despite it taking a bit to set up our table; we had to wait briefly despite having a reservation for our party of 7. Still, We will be back!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-04-06T00:00:00.000"}
{"review": "I was very pleased to find Iron Hill less than a mile from me. After a couple of visits I knew that I would be returning and often, so I joined their frequent guest club. I've enjoyed most meals I've had there. Sometimes they are a bit heavy handed on the salt, so on those meals where it's possible, I ask for no added salt. It was a much needed addition to the neighborhood! Most everyone will be able to find food and drink that they'll enjoy and return for more!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-11-25T00:00:00.000"}
{"review": "Great addition to the neighborhood. Parking is good across the street. Beer selection is unexpectedly good for a growing chain. Menu has something for everyone.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-01-22T00:00:00.000"}
{"review": "Sweet potato fries- deliciousGumbo soup -really deliciousLettuce wraps -deliciousBrewski burger-deliciousWaiter Terrell was great!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-01-13T00:00:00.000"}
{"review": "Good food. Good drinks. Terrible service.Summary: served nearly raw ground meat, stole money, then made accusations of dishonesty &  exploitation.Placed the very difficult order of burgers... one of which was perfect to the order. The second of which was nearly raw... When we finally flagged down a server to rectify the mistake, they were very apologetic & were quick to rectify the error.Second time around the burger was great, although everyone eating together would have made for a much better outing.Then they somehow managed to use the entire $50 gift card for a bill that was definitely less. When prompting the staff about it, the response was given there was no way to verify that the Gift card had not been previously used & thus had the asserted balance.Resolved the bill & left just to end the abhorrent experience.", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-05-28T00:00:00.000"}
{"review": "Good food good beer taken aback that this place is the size of an outback or some other chain restaurant. Also waiters were painfully slow. Like it was miserable but overall nice and I will probably be back with my boyfriend", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-08-12T00:00:00.000"}
{"review": "Good food.. I really love the cheesesteak eggrolls, but why are they $12 !!? Its 2 small rolls. A burger is $14 and comes with fries, cole slaw, and a pickle.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-10-12T00:00:00.000"}
{"review": "My boyfriend and I dropped by for some beers and a snack a few weeks ago. I haven't been able to get Iron Hill out of my mind since. The beers were excellent, and there was a good amount of variety among them. As a snack we ordered the sweet potato fries, they were thick and crisp, but the main event was the dipping sauces that came with them. There were four kinds, each one better than the next - though the vanilla bourbon sauce was easily the winner. I still daydream about those fries.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-10-17T00:00:00.000"}
{"review": "Big, sumptuous restaurant. Must've spent millions of dollars renovating. The servers were well groomed and delightful The seafood pot pie, outrageous! The baked salmon large salad, excellent. Very fast service. Make sure you slow them down. The four of us enjoyed everything we chose. Total price $100 plus tip. No booze ordered. Easy parking. Looking forward to returning soon with another couple.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-10-17T00:00:00.000"}
{"review": "I'm a King of the Hill member and am usually in on a weekly basis. Lately though, the servers have failed to put my beer in the King of the Hill mug even after I've presented my membership card (which is paid for yearly) and asked for the mug. I'm pretty easygoing and have let it slide however, the last time I ask to speak with a manager and this guy, Jason shows up and is pompous and condescending. He suggests it is somehow my fault that I didn't get the service I was hoping for. I'm pretty offended and will not return to the Ardmore location thanks to this Jason guy. There are a lot of other restaurant choices in the area, like Not Your Average Joe's, that have quality food and where you will at least be treated decently by the staff.", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-07-09T00:00:00.000"}
{"review": "For me it is about the food and service . . . not a beer drinker.This was my second visit. The first visit I had Fish 'n Chips, and they were really very good.This time I ordered my standard Dewar's & Water for a drink, and once again had to explain how to make it. Really?? With a big bar like that no one can make a pretty standard mixed drink? Ice, Scotch, Water . . . not that complicated.We ordered some Calamari to start off and it was very tasty and crispy.For dinner I had been looking forward to trying the Seafood Pot Pie . . . sounded really good to me. It wasn't !! It was a very small serving with very little seafood and a very thin gravy, topped with a pretty good crust. I would rather have had a big bowl of creamy clam chowder with a crust. Very disappointing!! My son in law had the burger, which was good, and my daughter had the crab cake sandwich, which she had gotten several times before and had really enjoyed. This time it was just \"okay.\" The service was okay.It will be a while before I go back.Update: Was pleasantly surprised to get an email from management apologizing after reading my review. I guess I'll go back sooner than expected. If they can do that, I can give them another try . . . but not the Seafood Pot Pie.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-12-28T00:00:00.000"}
{"review": "We were fairly excited as this restaurant is a favorite of a close couple.We were greeted in a timely manner and the front hostess was friendly. We were seated very quickly on a Friday night which was nice as many places have hour long wait times even at 9pm on a Friday. We we were asked drink orders from a waitress promptly. We placed orders for peach tea and water with lemon. No more than a few moments later different waitress came up and asked us the same thing. It seemed that there was not much communication between people at this point. The original waitress came back probably about 5 minutes later with our drinks and states she would be back with lemons (which she never did return). I took a drink of my \"peach tea\" which tasted like a weak regular ice tea with no sweetness at all. BUT MUCH to my disgust there was a fly in my drink. Which did cause us to be a little turned off already. The second waitress came by to take our order and we mentioned the fly and that it was not peach tea but she seemed to kind of pass it off with a Ohh, hmm (as she looked in the glass at the fly) and mentioned that the other waitress said it was peach tea. She never really apologized for this but asked if she wanted something else to drink. We ended up doing a couple taste test and ordered the beer sampler as well. The free taste test were of decent size and were appreciated. The beer sampler was nice because it was not the cost of a full glass and it gave us a chance to see what we would want for a glass with dinner. The waitress was well versed in the beer varieties and suggested appropriate flavors after asking our likes. The cheesesteak egg rolls were delicious, we would have wished there were just one more on the plate as an appetizer. We both ended up getting burgers which were good, just not amazing. We decided to try a dessert- the apple crisp. Which ended up begin far from crisp at all it. It was warm but not enough to actually start to melt the ice cream like we are used to. the portion size was generous and was perfect for sharing. Overall we would be willing to come back another time and hope for a better experience. However i was very disappointed that there was not a real apology from the waitress but mostly not from a manager. I would expect a manager to apology for the fly in the drink to ensure that we would not let this first experience deter us from returning again.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-12-16T00:00:00.000"}
{"review": "Love it here! Only thing is, if you don't make a reservation you will probably have to wait two hours. Make a reservation on the weekends!!! You won't be disappointed!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-03-30T00:00:00.000"}
{"review": "I got a seasonal sampler and loved it!  I also got the banana bread pudding.  Yum!  I went here on a saturday night and I was surprised that the place cleared out somewhat early.  I can't complain because it wasn't too loud, it just seems like this could be a good late night spot.  I will definitely be back for more brews.  There is plenty of parking across the street.  I wouldn't bother trying to park directly in front.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-01-21T00:00:00.000"}
{"review": "Popular, so make a reservation if you can! Great food, awesome peanut butter ice cream brownie dessert. Love the malt crust on the pizza and wide beer selection!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-07-18T00:00:00.000"}
{"review": "5 stars from start to finish. The beer was amazing from the seasonal menu. Clean place, the service was top notch. Our bartenders name Brian he was  the definition of professional. Started with a salad for the wife she forgets the name but from eating it myself I can say it was great. I ordered the blue cheese burger being is I always order it when it's from a promising menu and boy was it. The bacon was perfectly cooked I had a food boner when I laid eyes upon it. Wow I don't want to leave this place I want to spend it all on beer and food. Def will be back. Mmmmm beer.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-09-02T00:00:00.000"}
{"review": "We went on a Saturday evening, had wings, a burger and a kid's meal.  The beer is good, but the food was all just a little off the mark.  The wings were under-sauced, a couple were under-cooked (ick); the burger was good, but under-seasoned.  If the prices were a little lower, I wouldn't complain, but for the prices ($14 burger) you expect something special.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-10-16T00:00:00.000"}
{"review": "Went for lunch on Sunday one week after opening day.  I was pleasantly surprised with the excellent service given it's been open only one week.  They clearly know what they're doing.  My wife had the black bean burger done Mexicali style which she said was tasty.  My mother had the same burger but with beef and said it was perfectly cooked.  I had the ahi tuna salad which was just ok since the fish didn't taste very fresh and wasn't thinly sliced as I was expecting.  Had the crusher pale ale which was nice, hoppy, and fresh.  Kid's menu is excellent with lots of great healthy choices for the little ones.  That and it being family friendly is huge in my mind.  I definitely plan on coming back.  So nice to have an Iron Hill nearby now.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2014-12-21T00:00:00.000"}
{"review": "This place was fantastic! Very good beer, tasty food, and excellent service! As a vegetarian, I always appreciate when a restaurant takes the time to make their own black bean burgers from scratch. The pico on top was a nice addition that took the flavor the extra mile. My husband got the grilled chicken sandwich with sweet potato fries that he was very happy with. We both got beers he really liked the Pilsner. I did a sampler of the Wit, Witberry, Hefeweizen, and summer crush. The Witberry was a little too berry for my taste, but the wit and Hefe were delicious. The real surprise for me was how much I enjoyed the summer crush: part grapefruit, part Hefe, all perfect summer refreshing. Hisham's service was impeccable and friendly. On a crowded Friday evening he made us feel like his only table. We're excited to go back tonight for their take out special.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-07-16T00:00:00.000"}
{"review": "UPDATE (March 6):Manager Jordan apologized by email for the rude behavior of the woman and child who previously ruined the ending of our dinner in the bar area.  Tonight my husband and I had a wonderful meal served by our attentive and professional server, Dan.  The dining room and the bar have two distinct atmospheres with the same delicious food and beverages.  Next time we sit in the bar area, we will offer our table to a party from the vestibule to take our table or booth rather than be intimidated by pushy patrons who impatiently hover nearby to stake their claim.  We will be back!______________________________________________________________________We've been to Iron Hill in Ardmore on three occasions: The first time was for a late lunch on a Saturday afternoon.  Food, service and ambiance were great.The second time was at 6pm on a Saturday when we found the place packed - no room in the bar area and a two-hour wait for dining room.  We left for McCloskey's.The third time was a Saturday afternoon at 4:30pm.  There was plenty of seating and we chose a booth at the window.  By the time our food arrived so had the rude vultures and their broods, staring at us while we tried to enjoy our meals and brew.  For 30 minutes this very rude woman pretended not to notice her 5-year-old daughter who stood inches away from our table making impatient gestures for us to finish so that they could have our table.Although this is not the fault of the management it was very annoying and cast a pall over the whole experience.  One must remember that this is the Main Line, home of the original entitled masses.  Do not expect to linger over the last sips of your IPA in the bar area without another party leaning against your table claiming it as their own.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-02-08T00:00:00.000"}
{"review": "Food is decent but servers are extremely slow to the point it almost ruins the experience", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-06-06T00:00:00.000"}
{"review": "Came here for a lunch meeting. The layout is of a 5 star steak house. Everything is new, modern and very clean. The place is huge with a mot of large tvs everywhere and is ideal to watch sports. I tried their house IPA beer and it was spectacular. For my lunch I ordered chicken quesadillas and they were really good. The best part was the service... Our waitress was very friendly and our orders came out in less than 10 minutes. Very pleased with my experience.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-04-14T00:00:00.000"}
{"review": "Super extensive menu with lots of diverse great options.  I had the turkey burger, which comes with guac and bacon and spicy mayo and is absolutely delicious. They have a great beer selection with lots of seasonal favorites.  Highly recommended place to grab lunch, dinner or just drinks.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-05-19T00:00:00.000"}
{"review": "Great addition to the hottest Philly suburb these days...Ardmore!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-04-22T00:00:00.000"}
{"review": "We love this place! Ardmore needed a fun place to eat - so happy iron hill came here! Outstanding servers include Dani, Alix, and Emily!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-06-13T00:00:00.000"}
{"review": "Friendly and informative service.  Fresh brewed beers and good variety.  Nothing we didn't like about this very large restaurant.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-05-06T00:00:00.000"}
{"review": "It's a solid spot for the suburban area. Offers good options, and the salmon burger is good.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-06-01T00:00:00.000"}
{"review": "The food and the ambience was great. I would recommend the fried calamari appetizer. The burgers there are excellent. My only complaint is the wait staff didn't seem very friendly. Our waiter seemed like he had better stuff to do. Which was a shame because it was a birthday party and he probably could've made a much better tip.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-08-31T00:00:00.000"}
{"review": "Now that a local Iron Hill has opened in Ardmore, I don't have to drive to Wilmington. Excellent beer brewed in house and upscale pub food. The bar has plenty of high-tops for casual dining and there is a separate dining section in the rear. Great music playing at a conversation level which is appreciated too.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2014-12-16T00:00:00.000"}
{"review": "GREAT addition to the area.  We came for dinner.  The menu's huge with lots of options to eat a big meal, a light bite, everything inbetween.   We all had appetizers (soup, mussels, beet salad) and entrees. Didn't order beer although the selections looked really good and it's what they're known for.  And sadly, no dessert although the options were on the heavy side.  What made this a 5 star rating is the \"...everything else.\"  Service was really attentive and brought refills on beverages, delivered special orders right, not obtrusive.  The noise level in the main room was surprisingly decent and easy to hold conversations.  There are a few side rooms and one had a private party; noise didn't carry.  I don't know how noise was in the bar area.  And the tables and booths are spaced far apart, so you aren't stuck with your table neighbor's butt or laugh in your face.  There's parking in front, which was packed, but also a free lot diagonally across the street.  I made reservations so don't know how easy it is to get in without them.For those who don't want to schlep to Bryn Mawr or Berwyn for a good meal, this is a perfect choice.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-03-25T00:00:00.000"}
{"review": "It's simple.  I'm a burger guy but today I went out of the comfort zone with the grilled chicken sandwich.  Well, again #ironhill delivered with a delicious,  well cooked, well seasoned meal.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-07-04T00:00:00.000"}
{"review": "So far so good for this traditional Iron Hill...it's pretty much just like the rest of them but that's a good thing.  Ardmore needed a larger venue like this for eating out and grabbing a drink.  Parking is a pain at this entire shopping center but just park next to the fire house to be safe!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-07-01T00:00:00.000"}
{"review": "Excellent food and wine. Atmosphere is art meets CEO Bro. New and shiny. The hostess staff is disorganized and has spelling errors in their text notifications. Some waiters are great. Some are not great but okay. It's expensive for what it is, but the booths are comfortable and the best time to go is at lunch.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-06-24T00:00:00.000"}
{"review": "I am writing an update regarding my visit on 2/6/15. Met up with co-workers who were already there and immediately from the time we sat down our waiter Bob was there to take our drink orders and hand us menus. He was very attentitive to our needs and never made us feel rushed. I ordered the Seafood pot pie, mushroom soup, and pecan ice cream. All were absolutely delicious! Glad I gave this place a second chance as I had high hopes.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-02-08T00:00:00.000"}
{"review": "Iron Hill never disappoints. Delicious beers, excellent food, reasonable prices. One of my favorite Happy Hour places.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-04-10T00:00:00.000"}
{"review": "I thought this place was great! Service was excellent and food was fantastic. We brought our kids and even they loved it!", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-06-09T00:00:00.000"}
{"review": "Great beer. Great food. Great prices. This place puts steak houses to shame. Their chef knows how to properly treat meat and mushrooms. The steaks I've had here put every other steak I've ever had to shame. Get the soups, pastas, steaks and burgers. The beef stroganoff is incredible. You have to go there if you like..... Anything", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-06-08T00:00:00.000"}
{"review": "Sorely disappointed. Entrees took 50 minutes to arrive. Food was bland and tasteless. Then with 45F outside they put the fan on over our heads and took another 10 minutes to turn it off. We asked to have our dessert packed and the apple crisp was straight from the freezer. Saralee? Won't be going back.", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-04-08T00:00:00.000"}
{"review": "The place is really nice- the seating is cozy, the staff friendly and attentive, the menu varied, appetizing and affordable. There's only one small problem- the food is bland at best.", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-09-13T00:00:00.000"}
{"review": "Not sure what the appeal is here.  Although I did only order carry-out, no beer - maybe good beer makes a bad meal better - like with wine.  We ordered the ahi tuna salad - pathetic - greens with three small oranges pieces and a few crispy wonton strips - for $17.95 - the fish was over cooked.  The chicken teriyaki with rice was like a slightly nicer lean cuisine - pretty bad really.  I was expecting something more like California Pizza Kitchen.  Their take out is just as good as their in-house meals - I assume this is the case for Iron Hill too which is why I would not go in there to eat.  Too many other places to try to waste my time here!", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-03-17T00:00:00.000"}
{"review": "I was super excited when this location opened because I had been to other locations and really loved it. I came for dinner a few weeks after it opened & had made a reservation in advance for 3 people, we were seated in the back room with a table the size for 6. It was super awkward. We waited about 20 minutes for a table in the main room. The service was fine but the food was not as good as the other locations. The presentation was lacking and reminiscent of diner food.  Overall, it was okay but definitely won't be on my go-to list of restaurants.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-02-08T00:00:00.000"}
{"review": "I have been here 3 times for take out dinner, the food was very good and ready in the amount of time promised. Not your typical chain restaurant, very high quality. I would have liked to eat in the restaurant but they are usually very busy with wait lines.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-05-06T00:00:00.000"}
{"review": "I go here before I get a massage up the way- such great food, knowledge on the beer and an excellent IPA. This place makes me happy!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-04-25T00:00:00.000"}
{"review": "Love Iron Hill!  I have never had a bad experience here or at the one in Media.  Food is always good, beers are consistent, the only downfall is that the Ardmore location seems to be a bit too popular and I have found that a reservation is probably the way to go if you don't want to wait!  Definitely give it a try though.  Servers are well compensated, which comes through in their attitudes- they are professional, friendly, and attentive.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-07-20T00:00:00.000"}
{"review": "Too expensive for the C- level food they serve. The lighting is weird. It makes you feel like you're in an interrogation room. The parking is bad as well. Don't waste your time.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-03-28T00:00:00.000"}
{"review": "We had a wonderful experience our third time back. I'm not a beer fan so I love the fact that I can get a decent wine by the glass at a fair price. The food was delicious and hot! Kennet Sq mushroom soup is fantastic! 4 of us split the tasty nachos for an appetizer and had some left- we loved the fresh jalapeño peppers on them and the guacamole was great- well worth the extra $2 or 3 bucks.Burgers are big and come with fries or a salad. The beer lovers like the large selection. The service was the best I've had in a long time and she was extremely busy on a Friday night. Call ahead so you don't have to wait!", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-03-09T00:00:00.000"}
{"review": "Went there for dinner with my daughter this past Sunday night.  The place was busy - which shows how much something like this is needed in Ardmore.  It has nice atmosphere and decor and even though it was busy, the noise level was not a problem.  I ordered the veggie bean burger.  They were able to make it non-dairy, which involved using a different bun (the one they use for their regular burgers).  They were very accommodating about that.  Often veggie burgers are not that good at restaurants.  But this one was great. Good texture and very tasty.  My daughter had a fish taco and a penne pasta dish, both of which she enjoyed.  That Sunday, a free beer and salad came with my daughter's entree - but not the burger.  All in all a pleasant evening.  It's nice to have another place in Ardmore.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-01-21T00:00:00.000"}
{"review": "Excellent service, excellent beer. Friendly staff. We loved the menu; simple & reasonably priced. I had the salmon and my wife had the turkey burger. Both were excellent.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2014-12-18T00:00:00.000"}
{"review": "Great food and good atmosphere.  We have never had a bad experience here and the service is always friendly.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-01-19T00:00:00.000"}
{"review": "Love the cheesesteak egg rolls!! All of the beer is awesome, you can't make a bad choice. Service is always quick and staff is very pleasant. So sad they did away with their black bean burger though, it was amazing.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-01-08T00:00:00.000"}
{"review": "I really do love this place, even better than the previous location I used to go to!  The food is AMAZING every time, especially the cheesesteak eggrolls and fajita chicken salad. We usually sit at the bar and the service is on point.  They always offer a large and tasty beer selection, plus they have a full bar with specialty cocktails.  I never get the feeling that I'm in a \"chain restaurant.\"  Bonus - they also do take out and they do it exceptionally well.  If you order a cold salad with hot chicken, they package the chicken separately so as not to wilt the salad.  All restaurants should put as much thought into their take out as Iron Hill.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-11-12T00:00:00.000"}
{"review": "I would not recommend this restaurant to anyone. We went Fathers Day. It wasn't that busy. For appetizer we had the guacamole, it was bland. We had quesadilla chicken and fish and chip and my son had fish and chips. He got fruit a as side. The fruit came in mott's fruit cup ( hardly fresh). My son ate one bite of fish, it was black. My quesadilla was discusting. I'm not even sure it was chicken, it was a tan color. The waitress (wendy) never once came to ask how was everything. I had to ask for ketchup from another waiter. When wendy finally came to the table she ask how was everything. I said \" the food was really awful\". She laughted and walked on. Needless to say we won't be back in the iron hill brewery in ardmore.", "stars": 1, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-06-23T00:00:00.000"}
{"review": "Having been to the Iron Hill in Media a number of times and really liked it, I was really excited when I heard that one would be opening up closer to home.  It took us a while but we made it here and I have to say I was disappointed.  I  honestly don't know whether all Iron Hill sites have the same menu, but it seemed some of the best and unique things, like the special entrees, were missing. Now it's just standard pub grub- nothing bad just OK.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-05-14T00:00:00.000"}
{"review": "Second time at Iron Hill last evening around 7PM. In simple words...what a sh** show. The bar area was too crowded, not able to reserve a table in the bar area, more of a first come first serve. I felt like we were hunting for our prey, but it was just a table to hold our group of 10. There needs to be a better system in place. Once our group was able to get a long high top, trying to get a server's attention was our next big task - took way too long to get more drinks, asked for water and that took more than 10 minutes, and the overall service was not up to par. Needless to say, our meet up group won't be back on a Saturday evening to this establishment unless major improvements are made in the overall service. Quite disappointed.", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-01-18T00:00:00.000"}
{"review": "I want to like this place. We've always enjoyed going to the one in Media.  The food here is good but some things are overpriced. Something like 12 bucks for three cheesesteak eggrolls.  As someone else said, stick to the things they do best and you will be fine. The burgers, for example, are flavorful, moist, and juicy. There are certain things they do well.We're been here a few times now and most of the time and most of the time the service has been adequate, at best.  Tonight our service was dismal. The waitress seemed completely clueless. She never removed the huge menus from our table throughout the entire meal.  She also never cleared our app plates. Finally another server came and took them away.  When my husband's drink was low and he requested a refill, she brought him one but did not refill mine, which was completely empty.  Through my entire meal I had nothing to drink.  When our entrees came, I had to send mine back.  I had requested no mushrooms, yet there they were on my burger.  My companion sat there with his food and I had nothing, after being informed that it would be several minutes before they could cook me a new burger.  Meanwhile, our waitress came back to the table and asked, \"How is everything tasting?\"  I was sitting there with no plate. Did I look like I was \"tasting\" anything?  Eventually she said she had had \"a brain fart\" putting the order into the system. Yes, those were her actual words!  Finally, the staff that deliver the food always \"auction\" it and never seem to know who is supposed to get what.  When our waitress finally returned and I asked for a drink, she looked at my glass and appeared shocked. Towards the end of the meal we finally asked another server to remove the menus from our table, which he quickly did.  You would think by now enough of the staff were aware of the fiasco that was happening at our table, and a manager would have come by. Nope.  No one apologized, thanked us for visiting, or even noticed us eventually exiting the restaurant.  These folks need to go back to restaurant training school.  Rant finished!", "stars": 2, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-06-05T00:00:00.000"}
{"review": "The food here is great and this is definitely one of the nicer Ironhill's that I've visited. The food is awesome. I have not had one meal that I've disliked yet. The soup sampler is great, wings are great, pizza is good, sandwiches are on par and Ive also enjoyed the salads. Oh and I can't forget to mention the desserts! If you can save room I highly recommend the triple chocolate hill. On the other hand the beer isn't super impressive in my opinion. I've definitely had good beers here, but I live in Ardmore so I blame the other great brewery in town for spoiling my tastebuds. Ironhill is still a great spot if you're lucky enough to get a seat. I have had great service each time I've visited so it's been worth the trip.", "stars": 4, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-05-05T00:00:00.000"}
{"review": "I  took  my  daughter  to  this  busy  restaurant  for  dinner.........I  was   greeted   by  a  hostess   and  seated    immediately.   The  bathrooms   were  spotless    and  a  good  sign.     I  sampled  two  beers    and  finally  decided  upon  the  whitberry,,,,,,good  choice.......  my  daughter ordered  the   steak  egg   roll.     Delicious,    wow,     the  best........I  had  the  crabcakes   over  some   potatoes  bathed  in  mayonaise.      Not  my  fav  side  dish.   the   crab  cakes   were   ok  and  very   pricey,  almost  27$........the   sides  were   bland  and  portions    very  small.       My  daughters  salmon   was  very  small  (4oz)   for  23$         very  pricey   for    farmed  (cheap   salmon),     Everything  is  pricey    and     a  bill  for  two  can  be   75$,,,,,,,,,,,,,,,,,,,There  are  many  restaurants  where one  can  get  a     nice  meal  for  far  less.......    Waitress   was  not  very  familiar  with  the   menu,,    bad   sign  inept   training.from    management...............", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2016-05-15T00:00:00.000"}
{"review": "The atmospehere is spacious, and not overwhelmingly loud at all. I was in a party of seven and we all enjoyed our food immensely. I love their brie stuffed mushrooms and the baby back ribs were delectable and so tender! The sweet potato fries are also fabulous. Our service was excellent, but to top it off, I had called two daysahead to make a special request for dessert as we were celebrating a birthday. Their banana bread pudding is absolutely delicious, and a favorite of the birthday girl, so I asked them to put eight pieces together and serve it like a cake. Well, it came beautifully served (candles supplied by us) with their excellent ice cream scoops all around the edge. I truly appreciated the staff going above and beyond for us and we will definitely dine there again! I don't drink, but this restaurant is just fine for the non-drinker. The wonderful food is reason enough to go here, and there are choices for meat eaters and vegetarians alike, and everyone in between.", "stars": 5, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-09-21T00:00:00.000"}
{"review": "Iron Hill Brewery is a nice addition to Ardmore. We had dinner in the back restaurant section. The food was good and our server was very (maybe even too) friendly. I do think the wait staff needs some additional training. Our drinks were served to us with the server's hands all over the glasses -- a good way to spread germs. Also, although we liked her very much, she was overly chatty. I had an opposite experience when I was there for lunch recently, seated in the bar area: once our food was served, we didn't see the server (or any other staff) again at all until well after we had finished eating. We weren't asked about beverage refills until or anything else until she finally returned. At dinner, part of the chicken breast in my entree was completely undercooked, but they did take it off the check and ask if I wanted something else. To sum up, I basically like the restaurant but do think they need to upgrade their staff's professionalism.", "stars": 3, "venue": "Iron Hill Brewery  Restaurant", "date": "2015-01-28T00:00:00.000"}
