{"venue": "John Henrys Pub", "stars": 5, "review": "Been coming here for many years. The owner (Jimmy) and bartender (JP) are super nice, and the food is pretty good too!Things to try:- The Impossible Burger- The Steak Fries- The Fish Tacos- The SalmonSeriously, stop by, you won't be disappointed.", "date": "2019-04-20T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 1, "review": "Went to John Henry's on a whim last night after seeing it in passing on the way to Nudys or McCloskeys. It was definitely quiet on a Monday night, which I later found out was wing night from 5-9 (half priced wings), so that was exciting. My boyfriend and I ordered the wings to start which were delicious. He ordered a Guinness to drink and I ordered a Diet Coke- unfortunately it was extremely flat and tasted like an off brand soda so that was disappointing. I liked the feel of the place overall, had a friendly neighborhood vibe that was very comfortable. For dinner I ordered the south philly pork sandwich. It was served on a long roll that was very fresh. The sandwich had a good amount of meat and had some hot peppers. Came with delicious steak fries. The problem arose when I got home. I took half of my sandwich home with me and went to eat it tonight but saw a dead fly in it. I am disappointed because I enjoyed the food but I can't get around a dead fly.", "date": "2018-08-14T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 2, "review": "Fine place for bar food. However, one time I went in during a foot ball game (Vikings vs saints. Not the eagles) and i was verbally harassed by a man at the bar who was a Viking fan. He asked me what my problem was after clapping for the first saints touch down. Being the only woman in the bar, i was surprised by this. Bartender did nothing to stop this guys mouth. Since that day, anytime i came in i was given the cold shoulder. I live across the street and would never go back after the way they treated me.", "date": "2018-11-11T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 2, "review": "The food wasn't terrible, but seeing that roach crawling around when we got up to leave at the end of our dinner was a little off-putting.", "date": "2019-02-17T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 1, "review": "Place used to be my favorite.  Went in at 10 and since the bar was dead the decided it would be a good idea to spray paint the tops of the tables while the doors were closed and I was trying to eat. Go to McCloskeys instead. They care about the people that go in their bar", "date": "2018-12-04T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "John Henry's has been a fixture in Ardmore for some time now. It's a great local bar to meet with friends for some super casual drinks and food. They have plenty of seating indoors with a nice outdoor seating area. I particularly enjoy sitting outside in the rear on one of the comfortable chairs or couches. They offer a few drink specials. Including a deal where you purchase a mug and can use it to get beer specials during happy hour. I haven't experienced too much food here, but the onion rings are good. It's a pretty large portion, enough to share with friends. Also I have to mention that J.P. is a great bartender!!!", "date": "2016-06-15T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "I actually have dreams about these wings. When the waitress offers to write on the order slip to \"smother\" the wings in sauce at your request, you know I'm coming back time and again. They also have fries in all shapes and sizes. It's heaven.", "date": "2018-03-30T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "I've been going here for years. Celebrated last night a party for about 30-35 guests. I can't tell you how seamless everything went and the amazing service. Jules and Ryan are great! Thank you Kathy for everything. A local bar, family feel, great food, and would highly recommend!", "date": "2018-06-16T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "Great food! Occasionally a little disappointing with service or food but not too much", "date": "2018-02-05T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "Great service with a smile from Kelly! Huge portions. Was there on a Sunday night and their house-smoked BBQ was fabulous!", "date": "2017-12-10T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "This place has the absolute best wings ever!!!! My coworkers and I love going to this pub after work for happy hour and for dinner! Great atmosphere and love the back patio set. Julie is the best!", "date": "2017-07-18T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "Went here on the recommendation of a local.  Good place to get drinks.  Pretty extensive beer selection, friendly bar tender, nice ambiance.  The night I was there a guitarist was playing and it made the atmosphere all the better.  It was a good vibe and the late night menu was average.  I would return to see how the crowd is during sporting events.  Cool place in the burbs.", "date": "2014-10-26T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "The Reverend Dr. Steak and I came by to check out their new menu for 2013.  We were mostly pleasantly surprised.  John Henry's has clearly done some rethinking about their 'theme' - gone are the sports team pennants from the region, replaced with B & W old photos of the region tastefully framed, Pottery Barn style.  They are clearly looking to be seen not as the college sports pub, but as a 'neighborhood' pub now.The menu, likewise, has been overhauled, with some old favorites gone (no *sob* curly fries...*sob*) or reworked.  They've added some more 'upscale' additions as well.   The Rev. Dr. Steak thoroughly enjoyed a center cut pork chop stuffed with apples and nuts with a peach glaze.  I stopped him from gnawing on the bone that remained.  Two hearty carnivorous thumbs up.  He is grieving the loss of the hot open faced turkey and roast beef sandwiches, though, as he felt they were the best in the region.  I, likewise, am grieving the downsizing (though not price wise) of their legendary house salad bowl, now a 'plate' of house salad with exactly 3 chunks of bleu cheese dancing around.  Also gone are the curly fries, an item they did well.Service was fine, our server though really did not have any skill at 'selling'  a dish to a diner.  She was reasonably responsive though, so 'adequate' would be the rating here.The new menu overall seems to have some good additions to explore.  I just wish they hadn't messed so much with what was working for us in the process.  Change. Ugh.", "date": "2013-03-27T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "I had their chef's special - Kobe cheese burger with candied bacon and caramelized onion on a chimichurri butter toasted Brioche bun. It was extremely delicious. After the meal, I walked out of the restaurant for a few steps and I already wanted to go back to have another one. (I did not do that only because I was too full for that...) The best burger ever!", "date": "2018-01-03T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 2, "review": "Stopped in for a few games of darts and some beers.  They had an appetizer special running where each item was $5.  We I couldn't pass up a deal so we got a few items to split.  Most of the items were overly greasy, even for fried food, not sure if the oil was hot enough or they didn't drain properly.  Even for bar food standards, I wasn't impressed.  Beer prices were standard and the selection was nothing to write home about.  They had some big TV's playing some different games.  I threw a few rounds of darts on one of the over played boards.  I was thinking of joining a darts league here, but I think I will stop in again to see if the food improves.", "date": "2015-12-09T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 1, "review": "My friend and I went here for drinks and had 4 vodka sodas and my friend had 5 rum and cokes. We also did 1 shot each and ordered the loaded tots.  My bill was 64 and I had asked to be on the same tab with my friend so I paid it with a 20% tip and thought nothing of it. My friend mentioned when we left that she had paid a tab when I conveniently went to the bathroom of 47 dollars.  We were charged over 100 dollars for these drinks which I would expect in the city but not this place. It's just a small townie bar in Ardmore which has weird people in it anyway.  And if it is this pricey.. they need to check themselves because they are nothing special. My friend had also mentioned when we left someone was saying to watch out that the bartender overcharges. Clearly that's what happened so I hope that bartender feels great about himself in screwing over two young girls.  It was also a gaggle of dudes playing darts and we were basically the only two girls so you're welcome for our presence. Dicks.", "date": "2017-11-28T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "I feel pretty guilty giving this place only four stars, to be honest. However, the only reason I make such frequent stops here is because it's literally right across the street from my apartment.For football games, it's a blast. My friends and I will load up on appetizers (awesome cheese fries) and their beer selection is pretty solid. It feels extra good to walk in with an Eagles jersey on but they're also very considerate to the fans of other teams. The service is also amazing. I absolutely love Mary, who usually works on the weekends when I'm there. She tries to stay on a first-name basis with the locals.On the other hand, dinner here is not good. I took my boyfriend once and it was a pretty mediocre experience, both with food and service. Moral of the story: this is a great place to hang out with your crew, but go elsewhere if you want a more tasteful experience with your significant other.", "date": "2014-09-17T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "This is the BEST pub in Ardmore, Pennsylvania. We love John Henrys. Jules, Ryan, Dave, and JP are the best and they are always there for you. Highly recommend. The food is solid too.", "date": "2017-06-26T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "My new go to neighborhood pub! The staff is super friendly . The steak fries and draft selection are great! Let's not forget about the war of the jukebox ; love being able to play music without even having to get up from the bar.", "date": "2016-01-05T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "Good place to get drinks.  Pretty extensive beer selection, friendly bar tender, nice ambiance.  There is a patio around back that is a great place to sit in the warmer months.Last time I ate off the late night menu and it was a little disappointing.  The spinach and artichoke was pretty gross-  I would bet a fair amount of money the dip was just microwaved and it wasn't even really mixed together well- just a really dry paste on top of a very watery base; barely edible.  The california club was nothing special but decent.", "date": "2014-07-22T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "Great suburban bar outside of Phila! The cheese fries are a must!  The staff are super friendly and attentive. The drinks are reasonably priced with really great happy hour specials.  Please get the old bay fries with cheese sauce...... Yummy!", "date": "2014-02-16T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "Ok, I go here a bit but I don't go for the food.  I don't go here for the mixed drinks or beer selection either.  It's a friendly place with a great staff where I meet old friends or make new ones for the night.  I only sample their late night fare of fried perfection and its good enough to keep me ordering until midnight. For decent food and beer selection with a friendly, attentive staff and welcoming atmosphere, head to John Henry's.  I might see you there.", "date": "2011-12-29T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "The first two times I visited John Henry's I left with a bad taste in my mouth. Not because of the food or the drinks but as a result of the service we received from the bartender. I am drawn to JHP because it's walking distance from my house, the outside patio and the fact that they serve Carlsberg year round. The first two times I went with my roommate we were ignored by the bartender for long periods of time and then when he did return he was not polite. The bar was not crowded at the time so I didn't quite understand his frustration or lack of attentiveness. I chalked it up to a bad day the first time and then after we came by a second it two bad days too many. I even asked the bartender if he was having a bad day and he ignored me and mumbled something under his breath. My roommate refuses to come here now.Last week I went to JHP to grab a Carlsberg and to watch the World Cup semi final. And to my surprise I was greeted by Mary who welcomed my order and topped up my drink every time it got low. She even talked to me about the game and different options on the menu. This was beyond great service. I ordered food and stayed a little long then I had planned to. JHP would be so much better if Mary worked the bar all the time. I am a year out of college and don't expect bartenders to be  superb everywhere I go. But I also do not expect them to be out right rude. I haven't lost faith is JHP potential to be a great local bar but I will probably only come back when Mary is tending bar.Oh yeah the food was good, standard pub food but served very hot and fresh.", "date": "2014-07-16T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "John Henry's is an interesting place.  It's a combo of a sports bar with a little Irish pub thrown in.  For a little place it has a big menu that tries hard to please everybody.  They have an entire page devoted to gourmet fries.  Yikes!  You pick your type of fries and then your toppings.  I'm a sucker for waffle fries and they have them.  I topped them with Old Bay seasoning and cheese and they were great.  To balance out the fry menu page they have another page devoted to under 500 calorie options.  Nice.  There are also tons of burgers, wraps, etc.  They have lots of beer choices but nothing really special.  If you are looking for a craft beer place you'll need to go elsewhere.  This is the kind of place where you go to grab a beer and a burger and watch the game.  I was in this weekend and it was about 2/3 full.  The service was a little off and the food was slow coming out.  I waited over 20 minutes for that order of yummy waffle fries.  I'll go with three stars for now until I get a chance to visit again.", "date": "2011-05-08T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "Just realized that I have never reviewed John Henry's. I have been eating here since before it was called John Henry's. My mom and I used to have lunch here with my Great Aunts when it was called Annie's. Now that I live out of town, John Henry's tends to be where I meet up with friends when I visit home. This last visit there had been two major changes, one great and one tragic. They now have happy hour specials, which is a welcome change because the one thing we always noticed when we got our bill was how expensive it was. So much so that we tried a few other places and none really suited our needs. The second change involve my absolute favorite thing that USED to be on their menu. Waffle fries, they were so yummy especially paired with chicken fingers and their OLD honey mustard. Along with cheesesteaks it was one of the things I craved most when going home. I was so disappointed last time. The fingers were not as good and it was a new honey mustard that was just not up to par. I'll still go to John Henry's next time I'm home, but I will probably eat before we get there from now on.", "date": "2013-10-31T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "It's St. Paddy's day. Why are you spelling it with two T's? Not you, John Henry's. your customers. Anyway. Best corned beef and cabbage I've had since my mother's. She's almost 100% Irish, so yes I recommend.  John Henry's is my Cheers. I'm not like Norm, but I aspire to enter this bar one day with a snappy witticism. You should too. Eat here, I mean. Leave the snappy witticism at home. Holy crap! Somebody played Cotton Eyed Joe 80 times!  Thanks D for making the experience even better!!!", "date": "2013-03-17T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "Descent pub. The menu has the typical bar food (burgers, fries, wings, nachos, etc). They also have some \"fancier\" options like ribs, scallops and pork chops. It's almost like they are trying to be a bar that serves food and a restaurant that has a bar. The fries are really good and sandwiches are ok. The food overall is just alright, nothing special. Not a bad option for a beer though.", "date": "2013-06-24T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "Stumbled on this last nite  the service was excellent .  Food very good. Definately will come back. Waterman  cooler was great Staff very pleasant and we did not feel rushed", "date": "2015-08-30T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "I love this place. Great food, friendly service, great prices. The best servers, a local feel, and a great place to watch a game. This place is a ten out of ten. I love it every time I go.", "date": "2012-06-25T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "Good for local Soccer if the game is on FOX Soccer or ESPN.Carlsburg and Guinness $4 on Saturday and Sunday during the games.", "date": "2012-10-06T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "This is a good pub if you're within walking distance and like sports bars. The food is actually pretty good - hearty soups, good selection of fried appetizers, and reasonably priced entrees. The bar was pretty active while we were there. The decor is a bit lacking - green marble tables and green booths with and a random assortment of college pennants on the wall. The service was fast and friendly, so that was a plus.The beer selection was disappointing - typical selection of American macrobrews with Victory and Sam Adams summer ales thrown into the mix.Overall, this place isn't bad, but not really worth 4 stars either.", "date": "2012-07-14T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "John Henry has got it right...he knows what's for dinner: beer and pipping, beer battered french fries with as crispy a crust as ever. They're hot and freshly made...crunchy on the outside, smooth on the inside. These are basic bar food french fry perfection.And when dunked in some white cheddar sauce with a coating of BBQ or ketchup, you've got yourself a balanced meal of carbs, proteins, and vegetables.", "date": "2011-09-11T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "I've lived in Ardmore for about 4 1/2 years now and have been frequenting JHP since then. I think people get the wrong idea about it sometimes. This isn't a bar where you are going to be blown away by outstanding food or classy beers and that is exactly what i appreciate about it. What you will find if you become a regular, is that every time your walk in, you'll run into a friend or acquaintance. John Henry's is the local Cheers of Ardmore. I've seen staff come and go over the years and they have all for the most part, been great people. Jimmy and Kathy the owners are some of the nicest people I know and JP is not only a friend, but probably the best bartender in Ardmore along with Kevin over at Yeats. Like I said, the food is never going to blow you away, but it is exactly what you can expect from your local hangout. There are a lot of good options right off the bat on the appetizer menu, ranging from awesome nachos with chicken to mussels in marinara. If you're a wing lover, JHP has the best wings on the Main Line. These aren't dinky wings, they are nice and fat and you always get a good portion of them, not to mention the wide variety of sauces you can choose from. The somewhat recent addition of the fry menu is also a really nice touch. You can order anything from waffle fries to curly fries. Favorites are definitely the gravy fries (Disco Fries) and bacon ranch fries. Other options include Irish nachos and pizza fries. You also won't find a better cheesesteak in Ardmore and on Sunday, they are only five buck with fries included. At places like Bella Italia, where they over cook EVERYTHING, your going to be disappointed. The JHP cheesesteak is the perfect mix of cheese and juicy beef. Their chicken cheesesteaks are just as good. The one black spot on the menu is the French Onion Soup which seems to be one of the biggest complaints among Yelp users. It is always way overcooked and occasionally tastes like metal. To be honest, despite how much I love it, I don't really see it being a necessary menu item at John Henry's. If you are ever in Huntington, NY, check out Canterbury Ales. They have the best French Onion Soup I have ever had. The beer selection is what you would expect from any sports bar with the nice added touch of a couple of rotating taps. I'm on the bar's dart team and usually just order cheap stuff like Miller Lite during matches or Sunday Football, but if I'm going for the night, they have options like Blue Moon, Guinness, Harp, Flying Fish, etc. I was actually pleasantly surprised to find out the other night that they added the Dogfish Head Punkin ale on tap which is quite possibly my favorite seasonal beer. JHP isn't just a bar to go grab a beer and a steak, they also have some great events like Quizzo Thursdays with Steve. While I don't go to that to much anymore, it's usually a lot of fun. John Henry's also does an annual road trip to a Phils game every year which always ends up being a blast. They even had their first annual Oktoberfest this year working along side McClosky's and Gillanes and seemed to be not only very fun, but extremely successful. JHP also has the NFL Sunday ticket, so if you're an NFL lover, you can go there and pretty much guarantee that you'll be able to catch your game. John Henry's remains and probably always will be my go to bar and favorite place in Ardmore. From the frequent regulars to the awesome ownership, if you know what you're going there for, you'll never leave disappointed.", "date": "2011-09-27T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "I love John Henry's! I go there because it's a small place to grab a drink from friendly staff. JP is a wonderful bartender. Always friendly and quick to help.The food isn't the most amazing I've had overall, but they have great wings. I also love the mozzarella sticks. I mostly go there to grab a beer and a quick bite to eat.It's my bar of choice on the Main Line. Not so many Villanova kids because it's off the main drag.", "date": "2012-12-23T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 2, "review": "I'll have to write the dissenting opinion. I was looking for a burger and beers and decided to stop into John Henry's. I left disappointed.Interior: Ghastly.Did someone say this place was rehabbed? I'd hate to see what it looked like before. Light-colored wood. Reminded me a little of a bowling alley.Service: Less than perfect.I can't pin it all on the server, she was a sweetheart, I think she was alone and overextended. She couldn't see the high tops from the dining room and the bartender didn't back her up at all. He could have at least ran menus or water out to waiting customers, especially when there's no one at the bar.Food: I've had better.- Quesadillas: Large, greasy and heavy on the jalapeno. Cheesy & meh.- French Onion Soup: A waste. It was as if it had been cooking for days and all the flavor had been cooked out of it.- Spinach Artichoke Dip:  In light of our other options, we gobbled this up. The chips were good, from a freshly-opened bag. - Burger: Ordered well, served medium. Anti-climactic. One of the more impotent burgers I've had in a long time. Just bland, no life to it and cooked wrong. I rarely put ketchup on my burgers, I think a good burger should be able to stand on its own without it. I put ketchup on this one. I didn't even enjoy the fries the burger came with and I've rarely met a fry I didn't like. They had a generally poor flavor and consistency. How does a place with a whole page of its menu devoted to fries serve bad french fries? Riddle me that, Batman.It didn't really strike me as a sports bar, nor did I see any evidence whatsoever of Irish Pub thrown in. It seemed to me more like a mediocre restaurant with a bar you might find in some rural, small town. As the locals' watering hole, I'm sure it's fine. The outdoor seating area probably has potential, I didn't check it out. However, the kitchen did not demonstrate much skill during my visit. Was I just there at the wrong time? I can't say.I'm going to pass on John Henry's.", "date": "2011-08-12T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "Hands down favorite bar on the mainline. Very casual atmosphere, the bartenders are friendly and the food is very good for the price. It's a little tucked away being a short walk down Cricket Ave from Lancaster. They're open for lunch through the evening and things don't get too crazy until after 10 pm. The dining room off the side of the bar serves families and a portion of the restaurant/bar can be reserved for parties. I went to one once and it was a lot of fun :)They have a daily $5 sandwich special which comes with fries, most of which are better than average. Their happy hour runs early from 4-6, but it's daily and you get buy-one-get-one Free appetizers and cheap domestic beers (last I checked it was $2.50 dom drafts and bottles). They've started rotating a couple taps for seasonal and imported beers (glee), but I usually stick with the Yuengling. Best of all, the cooler temps are nice and cold so your bottled beer is well chilled and your draft beer is served in a chilled, frosted mug. Favorite menu items are the cheese steaks, chicken wings (and I'm from the Buffalo area), artichoke flatbread pizza, quesedillas, chicken sandwiches, the house salad with candied walnuts, and the french onion soup (yes, it comes with mozz, but it's still delicious). People I know that love hamburgers think that they are the best they've had in Ardmore. They have several large screen TV's for watching sports and a decent size back patio. If you show up during a Phillies, Steelers, or Eagles game, then bring your game face because the place can get packed. I know they have had music on occasions, but I've never been. The staff is great and the restaurant is always clean, though the air freshener in the bathroom could knock over a horse. If that's my only complaint then I'll take it!", "date": "2012-10-18T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "was here in my 21st yrs ago  !     !", "date": "2015-11-05T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "I've been to this cozy little spot while visiting a lot of my friends from the suburbs on a number of occasions. It's your typical sports bar with a little bit of Irish pub Americana thrown in. a good place to grab a beer, watch a game, and find at least one person who recognizes you.John Henry's also has a great party deal where you and your group can enjoy an open bar (domestic beers only) from 10-2am for $20/person. you get a whole huge bar room t yourself and they hook you up with good finger food buffet (fried goodness).They also have a good open mic night.", "date": "2007-11-20T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "My favorite local Ardmore pub. The atmosphere is a little sterile, but the food is good, the drinks are good and the price is right. The location is good, although people who dont know the Ardmore area might not venture this far off from Lancaster ave. The wait staff are also friendly and give you the real at- home feel!", "date": "2014-01-23T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "Great place to watch a World Cup game! The service is very good too.", "date": "2014-07-09T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "It's a simple, smaller in size pub. If you want to pay for your drinks and food with credit card there is minimum of 15$ to be spend. Otherwise you need cash. Service is very nice.", "date": "2014-01-14T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "John Henry's is a pretty cool, laid- back (at least when I go) environment. As I see it's pretty much a local hangout, which can be good when you don't want to be around a typical bar scene where people can't handle a drop of liquor without falling over.  But sometimes, I wish it were more entertaining because it's always been not so crowded when I go. All in all I love it here when I just want to come and relax, the back patio is a cool place you can sit at as well. The bartender's are friendly, and I dig the Corona Buckets on Friday's! Four for $10, not too bad. One of the few bars in the area that actually stay open UNTIL 2! Good Job!Haven't tried their food YET, but I am sure I will. $5 for a sand which and fries sounds pretty good to me!", "date": "2011-06-23T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 2, "review": "Found this place and thought it would be decent for a quick beer and bite to eat. The best part about my visit was the two beers I had. Cheesesteak egg rolls were decent, and my entree was horrible (buffalo chicken wrap). I had a few bites of it and decided to eat only the fries instead. Bottom line: nice pub for a beer but horrible food.", "date": "2013-05-04T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "I went to John Henry's to attend a benefit for a friend. I feel compelled to recommend their spinach dip, which was awesome. My son had chicken fingers, which were crispy and not greasy at all. The french fries are quite tasty too. A foodie's paradise it is not, but it is a nice bar/restaurant with good service and tasty bar food. They do have a nice late night menu that is served from 10PM to midnight - not that I'm ever out that late, but it's nice to know there's a place to go to satisfy late night munchies.", "date": "2012-03-26T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 1, "review": "While I think this place is OK for a beer, the food wasn't good at all.  I went there with a few friends this past Saturday night.  I ordered nachos with taco meat.  The nachos has hardly any cheese any were essentially a plate full of chips with some taco stuff on the top.  For this, they charged something like $13.00.  Not only was the price outrageous, but when I went home that night my stomach didn't feel right and unfortunately had to keep running to the bathroom.  This continued the next day.  I suspect the food wasn't fresh and that was my reaction to it.  Fortunately after 2 days I feel better, but would not go back to this place.", "date": "2013-02-11T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "Their food is pretty good, but their new menu it's quite disappointing. We will frequent it far less now because of that.", "date": "2014-09-12T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 1, "review": "A honest review. Don't get the crab cake sandwich, there is not real crab meat and the wings are the worst I have ever eaten.", "date": "2013-04-24T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "The staff is friendly. The food is nothing special. The prices are reasonable. My kids love it, and it's the kind of place that can accommodate kids bouncing around a bit.", "date": "2012-09-03T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 1, "review": "Been here a few times and enjoyed it. Nice menu, good beer selection, good TV coverage, and service is always really good. Was here recently and thought it got a lot more pricey. $7.50 for a beer and 9.50 for a drink. neither premium. Food was just ok. Service was very good, but for the price, I'll be going elsewhere.", "date": "2015-04-09T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "I love this place....we usually go in for lunch, and I get take out as I work right near the restaurant.  Anyway, the food has always been consistently good...Their garlic parmesan wings are amazing!!!  I don't really live in the area, so I haven't had the opportunity to go for dinner or to taste their great assortment of beers, but their food is great and the portions are large so you definitely do not leave there hungry!", "date": "2015-01-14T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "When I lived in Devon I found myself coming down this way fairly often...sure, I had to drive past a lot of other bars to get here, but I really liked this place.I normally came for the Quizzo (Thursday nights at the time...dunno if it still is), which is by far my favorite \"bar\" game. I never won the big prize, but won more than enough free rounds and other treats, and it was always a fun time. I never had a meal here but not for any real reason...just always came after dinner. Had plenty of snacky-treats and they were above average.Nice and cozy, no frills, not a magnet for the obnoxious brigade (and they are a nasty, plentiful bunch in and around the Main Line). My kinda place...wish it was still close!", "date": "2008-07-19T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "It definitely helps that I am within walking distance, but I do love me some John Henry's! What's better, John is actually a nice guy (I've been told he's the bartender) who's pleasant, smiley and quick to serve. Decent beers on tap (I enjoy Stella) and the food isn't bad either. I recommend the chicken parm sandwich and I also like the nachos (of course I like nachos almost anywhere).", "date": "2009-02-19T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "I have been going to John Henry's once or twice a week since I moved to Philadelphia a month ago. Staff and bartenders have all been very nice and service has been great. During the week, I like a bar that's not too busy or loud and John Henry's has been suiting my needs perfectly. My only wish is that they would rotate the beers they have on tap more often.", "date": "2011-07-22T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "It's a nice hometown kind of bar.  Solid sandwiches and a great beer list with an atmosphere that is great for families as well as adults!", "date": "2011-02-13T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "So, I'm giving it 5 to up the average, because it is well above average.  Fresh (!) fish tacos, juicy turkey burger, crispy sweet potato fries, friendly staff.  Can't miss, off the beaten track.", "date": "2014-06-08T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "This is one of the few great Ardmore bars. The service is always great, and they are always adding new dishes to the menu.  The beer selection is average.  Have not eaten a disappointing meal there yet. The bartenders pour absolute boats of wine.", "date": "2013-12-10T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "Very nice friendly neighborhood bar/restaurant. Try it you'll like it.....Recently had wings which were good albeit on the small side. Haven't yet tried their new menu, but will be eating here more often!", "date": "2013-03-24T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 1, "review": "We ate here for dinner with the kids and extended family for the first time in years about a month ago and had a great time.  The food, service, atmosphere was great and our waitress was super welcoming and told us all about the kid friendly St. patrick's Day weekend on March 7,8  & 9.  (our nighttime service was a solid 3.5 stars)We also saw they did a brunch on Sunday's which sounded good - so we decided to do brunch on March 9 with the kids.WHAT A DISAPPOINTMENT.  I'm really upset because for our family of 4 to spend $75 on brunch (before the 20% tip my hubby gave??!) - for what we got was really upsetting.  We walked in and they looked at us like we didn't belong there.  We took a seat and the server didn't talk to us.  It was really weird.  It shows a bloody mary bar on their menu - so I asked for it and he made me a bloody mary- even though the menu says they give you a shot of vodka and you make it.  That's fine - but when I asked him about it - he said nothing.  How random is that?  He didn't answer the question.  Just silence.  I just felt so unwelcome there for brunch.  Like the waiter was so upset that we were ruining his morning.  Totally opposite feeling of the dinner we had a month ago.  I used to be a regular at Annie's - and was excited after our recent visit to John Henry's to be back there.  But for what we paid - and the feeling of being unwelcome...it just kind of sucked.  Also - it wasn't a kid friendly weekend brunch at all?  I'm not sure why we were told it was St. Patrick's Day weekend for the kids.  It was just really sad and now I'm mad.  They should hire someone who talks to people - it's standard practice.   I can't believe how we were treated for that much money.  My husband and I work all the time to make money to pay bills and rarely take the family out for a treat like this - I'm just upset.  Can you tell?!", "date": "2014-03-09T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "Nothing wrong with JHP. Good place to catch a game and grab a burger. You won't be wowed, but if you're just going to relax and have a meal with a cold beer, you won't be disappointed.", "date": "2010-09-20T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 2, "review": "A fine place to drink -- nice crew, neighborhood crowd.  Food is nondescript -- standard greasy bar food.", "date": "2013-02-20T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "Not too trendy, not too divey, juuuust right. Try the ribs.", "date": "2009-12-11T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "Went to John Henry's last Saturday to get some dinner and watch some of the NCAA game with some friends.  As we walked in, the \"special\" board stated \"Heineken Special $2.00\".  So my friends and I had a seat in a cozy booth and settled in ready to conquer the evening. Well not completely. As my friends got unusually impatient because of their thirst, the waitress finally came over about 15 minutes after our arrival and asked if we wanted anything to drink.  So...my friends ordered the Heineken special (as mentioned on the board) and I ordered the usual \"girly\" drink...a Lemon Drop Martini (yummy).   10 minutes later she returned with the 3 drinks...and mentioned that the Heineken \"special\" didn't start until 10:00pm.  It was now 8:00pm.  She then proceeded to walk away.  She didn't ask if that was okay or if they wanted something else since the special didn't start until 10:00.  But my Lemon Drop was delivered without any problems...yay!Anywhoo...the food wasn't half bad.  My friends ordered the Flat Iron Steak special (they are all about the specials) and I had the Caesar Salad Bowl (a salad that could easily feed a family of 4).  Just as quickly as the food was delivered, it was devoured by all three of us.  It was then onto dessert...2 sundaes and 1 caramel brownie surprise.  By the end of that course we were entirely stuffed and ready to take a nap.  Overall, the food was not too bad and the atmosphere was very cozy with 6 TVs in the main dining room for patrons to watch.  John Henry's is definitely affordable. The final bill for the 3 of us including drinks and tip was $60.00.  And there is a private meter-free lot in the back of the restaurant to park.", "date": "2008-04-08T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "What a friendly place! The sandwich special is a great deal and they have HARP on tap along with Guinness. Wings were tasty and the veggies were cold and crisp that came with it. I'll be back.", "date": "2010-09-03T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 5, "review": "This is the perfect neighborhood bar, and I'll run into friends or family just about any night I stop by.  I try to frequent it like it is in my neighborhood, and I wish I lived closer.  Even though it has that neighborhood feel, John Henry's proves that you don't have to be smoky, dim and dirty to be everyone's favorite corner bar.  The staff, especially Jimmy and JP, is fantastic, and the menu offers a ton of options.  It's your pretty standard bar food if not just a tiny step above in the quality.  I don't eat here very often, but when I do it's satisfying.  There's a good sized bar with high-top tables on one side and a dining room on the other; they also have a cute rear patio, and unlike some other places in Ardmore, you don't have to worry about parking because there's a lot in the back.  They have good beer/drink specials and the real original Quizzo on Thursdays.  Quizzo Steve will call you stupid for your idiotic answers, but he always does it with love.", "date": "2011-08-08T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 4, "review": "I work right around the corner from John Henry's, so I've been there for many lunches and happy hours. It is definitely a local bar - the bartenders and waitresses know most people who go in there, so they're usually not in a rush. Food is surprisingly good, but lunch service can definitely be slow. Good place to grab a drink and bar food, but don't go in expecting anything gourmet.", "date": "2008-07-22T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 2, "review": "Went here with some pals hoping for a night of fun and beers. This place delivered about an hour of mediocrity before we departed for greener pastures. Didn't try the food, but the beer selection and pricing left much to be desired. Also didn't have much in the way of atmosphere. Really a boring bar with no character. You might like this bar as a place to get an overpriced domestic brew after the bingo game.", "date": "2012-09-16T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "I used to go in  there when it was Annie's Cafe. It was ok then but the then owner Annie wasn't very pleasant  or friendly. My friend used to work there and only went in there to see him but when he left I stopped going there,but that was many years ago.I've been to John Henry's a couple of times and I admit the new owners did a great job rehabbing it and it looks nice.Martha,I must disagree with you about it being affordable. I think $3.50 for a Miller Lite draft is a little pricey when I can get it cheaper and other bars nearby. Plus I had the wings and it was $8 they were tasty,but I think they were kind of small for that price.  I only go there once in while but I would go more if they lowered the prices a little bit.", "date": "2009-12-11T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "The food is consistently good and the portions are large, a good combination. Nice beer selection and fast service regardless of how crowed the place is. Not much to look at but a great place to hang out with noisy friends. Fun! The free parking after 5 in the back is a PLUS.", "date": "2009-07-05T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 3, "review": "I lived right around the corner from this place for a few years while attending grad school and found myself here at least once a week.  The food is ok - not great but not terrible and for the price it's about what you'd expect.  The decor is a weak spot.  Sort of reminds me of a Friendly's witha lot less windows and a bunch alcoholics rather than little kids.  There's a pretty regular  crowd of people most nights and on the weekends it can get busy with college kids.  They had a pga tour golf machine which was sick  - one of the only places I've seen that has one because I'm pretty sure Golden Tee sued the hell out of whoever made that game and they had to stop selling them.", "date": "2011-10-11T00:00:00.000"}
{"venue": "John Henrys Pub", "stars": 1, "review": "Went there for the first time 2 nights ago.  Food was fair and service was good, but I left my hat there. Called yesterday, no answer, so I left message about it.  Called today and got \"manager\" who was completely indifferent to the point of rudeness.  He offered no help at all about my getting my (new) hat back; no offer to look around, check w/ the wait staff, etc.  Why would treat a new customer so offhandedly?  I won't be back.", "date": "2011-02-26T00:00:00.000"}
