{"review": "My partner and I discovered this place while walking up Lancaster Ave on a cold winter afternoon. Our destination was originally PokeOno but we were very happy to stop in at MAIDO and try their Udon instead. I ordered the Kitsune Udon and my partner the Tonkatsu Don. Both were proportionate and tasty. I roamed around their market place and found myself picking up Japanese chocolate, candy and dried squid. This place reminded me of Marukai Market in Downtown LA. A very mini version.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-12-18T00:00:00.000", "stars": 5}
{"review": "this place is great. HUGE food area and a small store. its about 60% dining and 40% store. great selection of products.i haven't tried everything in the dining area but they have daily specials.the staff was SUPER friendly.parking is about as fun as brazilian waxing. JEANS: OK by farORDER: at counter then they bring your tray to you or call your name", "venue": "MAIDO A Marketplace of Japan", "date": "2018-12-09T00:00:00.000", "stars": 4}
{"review": "I stop by here every once in awhile if I'm in the area for Tired Hands. Really nice market - part fast casual restaurant, part grocery. The food in the restaurant part is Japanese comfort food, so you'll find curries, tempuras, and bentos. It's a bit pricier than I'd like, but it really hits the spot if you're in the mood for some Japanese in an authentic setting.The grocery part is fun to explore. Small area, but packed with authentic Japanese goods, including ingredients, snacks, and some packaged food. There are several ingredients in Japanese cooking that you might be hard-pressed to find elsewhere, even in Philly. For instance, there was a mentaiko (spicy cured pollack roe) spaghetti recipe I'd been looking to make, but I could never find a place to purchase mentaiko anywhere in the city - until MAIDO. Service is friendly as well.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-10-17T00:00:00.000", "stars": 4}
{"review": "My go to place to get my curry no wait for a seat and they cook your food right in front of you if u love onigiri this that makes them as well as bento boxes. And once you're done eating you can go to the back and do alittle bit of shopping for all your Japanese snacks and merch. Always bring my friends to this place the food is good and the atmosphere is good love their little festival that have but get to them early because it gets packed there.", "venue": "MAIDO A Marketplace of Japan", "date": "2019-04-01T00:00:00.000", "stars": 4}
{"review": "This is a Japanese marketplace as well as a restaurant. I've only been here twice, but both times have been a pleasant experience. All of the food feels authentic and is super tasty. I will definitely be coming back.", "venue": "MAIDO A Marketplace of Japan", "date": "2019-01-05T00:00:00.000", "stars": 5}
{"review": "Wooooooow I'm in so much shock at how terribly-made the food here is yet how people still eat here! Yes it's authentic, but just because you have no competition doesn't mean you can disgrace Japanese cuisine. We arrived 6, didn't get to order until 6:15 because of the 3 whole people ahead of us, and didn't get our food until 6:50. The portions were so TINY I was done eating by 6:59, which is surprising considering how tough and hard to chew their katsu (chicken jerky) was. No joke, I've had katsu probably at 50+ different locations and this one here  is hands down, no debate, the WORST I've ever had. It's on par with public school lunch cafeteria food.Okinomoyaki was decently flavored, but filling was mostly batter and for $12, there should be more than 2 pieces of meat that are 1 cm big. This was probably the worst tasting meals I've had in the past few years, but I can't get myself to give them 1 star bc they are nice, and the store has some items that are not available in regular grocery stores.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-05-18T00:00:00.000", "stars": 2}
{"review": "Two words. Authentic and delicious.  My favorites are the beef gyudon, shrimp tempura, chicken teriyaki, and chicken curry.  The shrimp tempura is so delicate and crispy.  The beef gyudon is so tender and the flavor taste amazing.  The chicken curry is delicious though it should be renamed potato curry with chicken because there is more potato than curry.  The chicken teriyaki is very tender and has great flavor.  I highly recommend this place!", "venue": "MAIDO A Marketplace of Japan", "date": "2019-03-21T00:00:00.000", "stars": 5}
{"review": "One of my favorite stops in Ardmore, MAIDO has something for everyone! I love the grocery store chock/full of Asian snacks and goods (skincare, frozen dumplings, freshly-made bread and buns, Pocky, jewelry, socks, pens, seaweed, crackers, and more), but I only recently just tried their sit-down restaurant food so that is what this review is for. The service is serious and a bit curt, but I think they just are very matter-of-fact and quick, wanting to do their jobs. I got the large udon with a side of pickled vegetables, a friend got yakisoba, and another ordered katsu don. She didn't like her katsu don but it's only because she doesn't like eggs and there were lots of eggs in it (heads up.) The yakisoba looked good and it was a large portion! I liked my udon but thought the portion of pickled vegetables could've been more given the price, but liked the variety of picked vegetables-I'd never seen 2 of them before! (Yellow, pink, black, and green.) I loved the open kitchen so we could see our meals being cooked, and a Japanese animated film (Miyazaki) played on the wall! There was also a stuffed bear in a chair by the window. I'll be back here for good Japanese food on the main line right near the Ardmore train station and Suburban Square.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-05-13T00:00:00.000", "stars": 5}
{"review": "MAIDO! Is a Philly suburb version of Mitzi's, near Fort Lee in Nj, which I'm sure I spelled wrong. It is 1/20th the size but holds 1/5 of the useful stuff, so it is a great place for Japanese foodies to go if the don't want to drive 4 hours, or more depending on traffic. The restaurant part has good food, with people who care about the food, and who are very nice besides, and the market has most of the good stuff you could possibly need, barring fresh fish, which you can probably get down the street at a sushi joint. I was a happy camper to find the place. Clean, well lit, with all the Japanese foodie you could need.", "venue": "MAIDO A Marketplace of Japan", "date": "2019-02-01T00:00:00.000", "stars": 4}
{"review": "This cute Japanese store includes a small grocery shop and a fast-casual Japanese restaurant. I'd rate three stars for the grocery shop and four stars for the restaurant, and then round it up to four stars for good service and the cute giant teddy bear.This Japanese grocery shop is far from those Asian markets that you can do one-stop grocery shopping. MAIDO is very small and lacks fresh produce (only one small vegetable stand). MAIDO has a great selection of Japanese foods and snacks that you can't easily find in other Asian markets. For the things you can buy elsewhere, MAIDO's price is usually higher.The fast-casual restaurant is the star of MAIDO! Food is freshly prepared in the open kitchen daily and the staff members say they bring leftover home every day. The Japanese salad here is super fresh and the bento box is nicely presented with small portions of different delicious dishes. Also, they have seasonal snacks such as takoyaki (my favorite Japanese street food). As far as I know, their main dishes are authentic and well-prepared and around the $10 sweet range for fast-casual food.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-02-17T00:00:00.000", "stars": 4}
{"review": "For some reason, it took the cook forever to make my okonomiyaki. When it was ready, the server gave it to someone else after i waited so long. Then they realized they gave it to the wrong customer since they did not even order the same thing, took away the plate from them and gave it to me. I wish they had just let the other customer keep it though. It was soggy and had wayyyy too much ginger it in. Their takoyakis are mediocre, but i definitely had better.", "venue": "MAIDO A Marketplace of Japan", "date": "2019-02-12T00:00:00.000", "stars": 3}
{"review": "We had a better experience here for a weekday lunch. It was crowded but plenty of space was left to sit at the bar. This time my bf had the lunch special gyudon which comes with udon and salad as well. I had the curry bowl with katsu and we shared gyoza. The food came very fast and everything was even better than last time. Maybe this place is just better for lunch? Anyway I'm happy to return again and have the delicious curry many more times.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-02-10T00:00:00.000", "stars": 5}
{"review": "It is good. The variety of items in the store section is vast. They have many cute stuffed animals and that is good enough for me", "venue": "MAIDO A Marketplace of Japan", "date": "2019-02-18T00:00:00.000", "stars": 5}
{"review": "I've come here several times for lunch and it's always been great. Maido has great authentic Japanese food you can't find at a lot of other places. The environment is unique, with an open kitchen space, Japanese television, and counter space, but the food is delicious. The market too is a great place to get unique items you can't find elsewhere, and I've bought curry paste, noodles, drinks, and several snacks, all of which have been great.Great dishes I recommend:Gyudon (thinly-sliced beef over rice)Okonomiyaki (Japanese savory pancake)YakisobaOnigiri (Sushi rice balls with fish)I'd especially recommend the lunch special, where you can get a small version of an entree along with a bowl of udon and a salad for a cheap price.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-02-11T00:00:00.000", "stars": 5}
{"review": "The absolute best and ONLY authentic Japanese market in the entire Philly area! Also, great curry-rice and Okonomiyaki! Yowza!", "venue": "MAIDO A Marketplace of Japan", "date": "2019-02-03T00:00:00.000", "stars": 5}
{"review": "Fun to explore discover new things you've never had before. My daughter found her new favorite soda there. Many items you will not find anywhere else.", "venue": "MAIDO A Marketplace of Japan", "date": "2019-02-01T00:00:00.000", "stars": 4}
{"review": "They have a nice selection of Japanese skincare items including Hada Labo Gokujun Hyaluronic Lotion, a holy grail item for dealing with dry skin. Fun snacks if you don't want to travel all the way to an H Mart and a lovely eat in restaurant. Friendly and helpful staff with the right touch of service - they are there if you need them but otherwise let you browse.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-12-14T00:00:00.000", "stars": 5}
{"review": "You come here for the experience! The store is pretty cute and the staff are very nice. Although you can find the stuff in the store at other Asian grocery stores, it's nice to have Maido near Ardmore since it can be pretty convenient. The food is like home-cooked comfort food. You can't expect chef quality katsu and gyudon, but it reminds me of my mom trying to prepare me a warm meal. Yes, the katsu can be a little tough and the prices aren't the cheapest, but it's nice to have Maido there.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-08-21T00:00:00.000", "stars": 4}
{"review": "Closest asian food market in the area and has a wide variety of selections. Stopped by for the restaurant and ordered katsu curry, okonomiyaki and takoyaki. The food was good and tastes very home styled, which is awesome. My expectations were really to feel a sort of \"wow\" factor but fell a bit short of that. The decor of the place looks authentic and the staff all speak Japanese. Prices were on the higher end, felt like I could've went to a fine dining restaurant for the same price. The food market section had a wide variety of asian items and is convenient rather than traveling a ways to get something similar.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-03-27T00:00:00.000", "stars": 3}
{"review": "I never write reviews on yelp, but had to for MAIDO! I returned from a 6 week trip to Shigaraki, Japan a month ago and have been craving real Japanese food since. The curry udon was like I was back in Shiga prefecture! I was amazed by the variety they have in the market as well. Sugoi!", "venue": "MAIDO A Marketplace of Japan", "date": "2018-11-28T00:00:00.000", "stars": 5}
{"review": "Such a fun place to eat! I usually go here for lunch on the weekends. This is the most authentic Japanese place you  find in the area. Also has a market stocked with items you probably cannot find in a regular grocery store. Some of the lunch items are a tad pricey however.", "venue": "MAIDO A Marketplace of Japan", "date": "2019-02-19T00:00:00.000", "stars": 5}
{"review": "I lived in Japan for 9 months; this is some wonderful authentic food that reminds me of that time!", "venue": "MAIDO A Marketplace of Japan", "date": "2019-01-06T00:00:00.000", "stars": 5}
{"review": "There food is excellent  if you like that kind of food but the wait to get a table or sit at the station were you sit is okay", "venue": "MAIDO A Marketplace of Japan", "date": "2019-03-12T00:00:00.000", "stars": 3}
{"review": "Busy and tiny but everything you'd expect from an authentic Japanese food place. It's also a grocery store. Food was great! You might need to wait around for tables but expected of most food places.  Loved the fried mackerel!", "venue": "MAIDO A Marketplace of Japan", "date": "2018-05-26T00:00:00.000", "stars": 5}
{"review": "I love the simplicity of the menu; udon, rice bowls,tempura, etc. nothing fancy but a great place to grab a quick bite. Speaking of quick, if this place is packed, expect to wait for a bit while they make your order and/or shop in their market for imported Japanese / Asian products while you wait.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-12-29T00:00:00.000", "stars": 5}
{"review": "I was pleasantly surprised to know of a Japanese market/food court near Ardmore. I was craving some warm rice home food and I'm glad I came to this place.I had the Gyudon the first time I went to this place. It was a little pricey but it was completely worth it. The whole dish was very warm and comforting and I highly reccomend everyone to try this dish!My favorite part is the onigiri ! There are a variety of flavors and sometimes they are warm which is incredible and so exciting !! Everytime I come to Maido, I always make sure to grab a pack of lychee candy. They're my favorites !!The staff are so nice and sweet. Always smiling and welcoming. :)", "venue": "MAIDO A Marketplace of Japan", "date": "2018-08-25T00:00:00.000", "stars": 5}
{"review": "Fun Japanese store cool candy and sauces. Some Japanese vegetables Part of the store serves as a restaurant with delicious curry dishes", "venue": "MAIDO A Marketplace of Japan", "date": "2018-06-28T00:00:00.000", "stars": 4}
{"review": "This place is awesome and totally one of a kind in the area. Don't come here expecting sushi, but you will find awesome Japanese food you won't find anywhere else in the greater Philly area! On the market side, you can get so much tasty things and a cute and expanding selection of housewares, toys and other office things. Be warned though- it's very small, like smaller than a Wawa. On the restaurant side you'll find Japanese comfort food like from a Japanese diner. Udon noodle soup, mild Japanese style curry with fried pork cutlet, or thinly sliced beef and sweet onions over rice. Wash it down with one of the dozens of flavors of delicious Japanese soda. While the food isn't the best I've ever had, it beats anything else you can get in the area.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-10-07T00:00:00.000", "stars": 5}
{"review": "I absolutely love Maido. I've been here plenty of times. Food is delicious. Price is reasonable. Services is good. And the mini market has great stuff. I love coming here.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-08-02T00:00:00.000", "stars": 5}
{"review": "Kon'nichiwa! The comfort food is as authentic as you can get at Maido. It's not your typical teriyaki or sushi eatery. While they do offer that fair as a side note, the other dishes are amazingly tasty. The rice bowls are my favorite. Especially the Gyu Don. There is a market which is small but has a sampling of all things Japanese. From skincare products to fresh bread & unusual candy, this little market packs it in. The staff is friendly & personable. The kitchen is open & the vibe is casual. There is a large screen TV streaming a Japanese channel so you feel as if you're not in Ardmore for the time being. Simply a great place.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-02-11T00:00:00.000", "stars": 5}
{"review": "Love eating and shopping here!!! My 2 favs are the chicken teriyaki don, and the yakisoba all mix. Sushi is good too! The staff is friendly. Cute place to eat and shop at. Love shopping in the cookies and sweets section to get my occasional Pocky and Pretz treats. They keep updating the stationary and small trinket area. Also get my Mochi ice Cream, and Ramen.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-07-30T00:00:00.000", "stars": 5}
{"review": "Usually, if I look for Japanese items, I go to Mitsuwa NJ as it has more variety of Japanese groceries. However, as I happened to have afternoon tea at Delice et Chocolat next door, I stopped by to see what they carry. Most of items you can find either from Hmart or even Wegmans so I really hope they can carry some \"special\" stuffs. Maybe their attraction is their food court so maybe next time I will try.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-10-22T00:00:00.000", "stars": 3}
{"review": "Authentic Japanese food, both at the restaurant and in the store, Maido! is at the very least an interesting cultural experience, and at best a delectable tasting of Japanese food.Maido! is the kind of place you always say you're going to go to \"one day,\" but you never seem to make it a priority. My excuse was that I'm a white guy from the PA sticks that, outside of sushi and a little bit of non-instant ramen, really knows nothing about Japanese food. That being said, I'm really happy I tried Maido!, as it offers a diverse selection of delicious food I didn't even know existed.My fiancee and I ordered the Udon (small $6 or large $9 - Japanese thick wheat noodle, dashi, soy sauce, mirin, sake) and the Chicken Teriyaki Don ($12 - Chicken , soy sauce, mirin, sugar, sake, over white or brown rice). I get the sense from both dishes that this is Japanese comfort food, as the Udon, with its rich, yet light, flavorful broth and thick noodles, reminded me of a less salty chicken soup in all the best ways possible (I'm fairly certain it knocked out the cold I had been trying to fend off for a week). I preferred it to the Chicken Teriyaki only a little bit, which was still a great dish, especially that mild teriyaki sauce that is way less salty and sweet than the more Americanized-version you're probably familiar with. Overall, I really enjoyed my time as Maido! and I'm really happy I gave it a try. Other reviewers are free to correct me, but it looked and tasted authentic, and I'm eager to come back to try the rest of the menu. Also, be sure to check out the grocery store which has all kinds of Japanese treats that I had to be physically restrained from purchasing.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-01-04T00:00:00.000", "stars": 4}
{"review": "Holy Jesus SO cute. Very fresh. Probably the only legit Japanese food in the greater Philly area. It's got a standard lunch counter with some tables. They're know for their okonomiyaki but to be honest I didn't enjoy the mixed okonomiyaki as the ones I've had before. I found their Niku Udon to be hot, fresh, and filling. We didn't get the curry options but from the surrounding tables it definitely looked like the way to go if you're starving! Definitely would go again. ALSO the little store has great authentic Japanese ingredients", "venue": "MAIDO A Marketplace of Japan", "date": "2018-04-08T00:00:00.000", "stars": 5}
{"review": "Authentic Japanese food.  Friendly service in a bright casual setting.  Katsu don was done right.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-11-13T00:00:00.000", "stars": 5}
{"review": "I've been going to Maido since their old location in Narberth. Not only is it much closer for me now, the food is just as good, and there's more of it. The market is awesome, there are certain items you just can't find anywhere else around here. Tempura udon with the tempura veggies on the side is my go-to.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-10-22T00:00:00.000", "stars": 5}
{"review": "Maido has been around for a good while and I first noticed them when they were in Narberth. I didn't think much of them and it seemed like a very small hole in the wall type of place. Now, being they're in Ardmore with much more space and brighter looking development, this place looks VERY inviting and has great assortment of Japanese and Asian goods! They are like a mini mart to get Asian food and little things that you might need instead going to Upper Darby's hmart and Chinatown markets. But it's more like an express Asian market, though for me that is god enough for many situations. They're pretty involved with the Ardmore community, which is very nice that they're putting effort to bring people together. I like that they also have English speakers to help customers out if they are exploring their food options. They also have their own restaurant of sushi, soup, and curry. Sometimes in the summer they have special shaved ice treats, which is ridiculously good but limited for the season. It's definitely an iconic place and it is not just because they have a huge teddy bear on their window right where everyone can see on Lancaster ave.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-02-13T00:00:00.000", "stars": 5}
{"review": "I simply love this place.  I am a regular, I have tried everything on the menu. Being a Japan lover and never been there but lived with Japanese natives during some part of my life, it reminds me of the quick and easy meals they have made.  My top picks onigiris, oyakodon and yakisoba.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-02-03T00:00:00.000", "stars": 4}
{"review": "This is such a cool place. Half of the place is like a market to buy a lot of tasty Asian snacks and toys - the other side is a kitchen that makes really tasty Japanese food. I tried the tempura don which is basically tempura with sauce over rice and it was delicious. They have good service and good food. I would recommend.", "venue": "MAIDO A Marketplace of Japan", "date": "2018-09-08T00:00:00.000", "stars": 5}
{"review": "3 stars for an Asian marketplace that sells stuff at a bit of a higher price compared similar locations. But 5 stars for an impressive Japanese lunch counter that dishes out plenty of impressive and traditional dishes making for a solid 4 stars.When Maido was located in Narberth (yelp.com/biz/maido-narbe…) back in the day it was like nothing I've ever seen before with its marketplace that hooked up everything from Asian noodles and sauces, brand items Pocky and Boss Coffee, and Hello Kitty novelties and rice cookers. But it was the lunch counter that dished out freshly prepared yakisoba noodles, teriyaki dishes, and my all time favorite shrimp okonomiyaki.Moving to Ardmore means that Maido finally has a spot that allows them to have a larger dinning and prep area where they can prepare even more traditional dishes like Katsu Don, udon noodles, curies, and karaage chicken. it also gives them a space to host intriguing events like a Curry cook off and a Mochi-Tsuki Festival. While I was living in Narberth originally and just settling into Philadelphia way back when Maido was like nothing I've ever really seen before. But ever since my adventures through Washington Avenue, Chinatown, and H Mart, I've come across a ton of markets that sell similar items at lower prices. That said, Maido is still the best Asian market option in suburbia, still offers plenty of deals, and can't be beat for a lunch visit.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-12-27T00:00:00.000", "stars": 4}
{"review": "This place has so much potential but falls flat. The \"market\" side has a really small but authentic selection of Japanese goods. The \"food court\" serves a couple Japanese dishes like curry, katsu, korroge, udon, etc. I think it's kind of expensive for the portions. Also the katsu doesn't come with rice. It just comes with a few undressed spring greens. That's weird! You have the option to add extra rice for $1 but ONLY for curry or katsu don bowls. They will not let you get rice for $1 for katsu. The katsu was tough and way too thick. The udon was good but very basic. The curry seemed like it was just vermont curry so also pretty basic. Overall, the entire space (both marketplace and food court) seems unfinished or haphazardly put together.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-09-19T00:00:00.000", "stars": 3}
{"review": "Drove an hour and half up from BMore to check this place out, and I should have driven another hour to Mitsuwa in NJ. While Maido is clean and well lit, it really wasn't worth the time nor money. First let's talk about the grocery store. As someone said there are two H Marts in the area (just under four and nine miles, respectively from Maido), so the selection was expected to be limited to begin with. But I was really surprised at how limited the selection really was. If you're in a bind and didn't have time to run to H Mart, this might be the choice.Next the kitchen/restaurant. It's a one man show with a couple of helpers. The setup is similar to an open kitchen at home, and while the barley tea is self serve and all you can drink, the value ends there. Ten-don is $15, katsu-curry is $14. For that price I expected my pork cutlet to be pink and juicy, not well done and dry. I expected the rice to have high rice kernel definition witha saturated carbohydrate chewiness that Japanese rice are known for, and instead it was a tad too moist and clumped helplessly. The tempura was pretty good, but that's like saying In N Out hamburger was pretty good, it's expected.Finally it took 30 minutes from order to delivery, and while I may have enjoyed watching the chef at work, it was a grueling wait for a hungry man.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-10-30T00:00:00.000", "stars": 2}
{"review": "Really enjoyed lunch today. Bf got then bento box and I got a udon soup. The staff was very pleasant. I didn't know what to expect but the overall time from the time we were seated until we were was very reasonable. I also ordered a Yakisoba dish to go since I'm working late. Lunch prices and service time is very good bc I could tell they know that most people are on a short lunch or in a hurry. Luckily I had my morning off so I didn't have to rush. But if you are in a hurry and want something good, I highly recommend this place. Really excited to eat my dinner and hopefully be back here soon! On the plus side there's a grocery store here too!! Kills 2 birds with1 stone.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-11-21T00:00:00.000", "stars": 4}
{"review": "A Japanese restaurant/grocery run by Japanese people.My four stars applies to the restaurant - it's a great venue with good food, but definitely overpriced. I've had udon, kyudon, and salmon rolls on separate occasions. The food is definitely filling and savory, but I wish they could just serve less with a cheaper price. The venue is an open-kitchen/hibachi so you can see the entire process of the cooks/chefs preparing the food. Or you can watch the Japanese baseball highlights which always seem to be on. I'll go again if I want some Japanese food before grocery shopping but don't want to go to the city!Grocery: Probably I wish they actually sold some meat/fish, so I don't need to make a separate stop elsewhere for my grocery needs. They have all kinds of Japanese snacks, drinks, and some greens.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-10-02T00:00:00.000", "stars": 4}
{"review": "Rejoice! Maido is back in business at their new location on 5E Lancaster Ave, Ardmore, PA. There's no parking lot that's attached like the old location, but there's plenty of metered on-street / public parking lots nearby.The new space is vamped up with a much larger eat-in space. The counter seats and the open kitchen are still there, but there's now a fair number of 4-tops to better accommodate groups. You can still order the awesome okonomiyaki and curry, but the menu has also been expanded to include udon noodles and rice bowls (yes, the beef bowls are not a limited weekend menu anymore!). They also added a new bento bar where you can rice (white or brown), 1 or 2 main entrees, and 2 or 3 side dishes. All the dishes were familiar and comforting Japanese bento standards, not to mention that they said the items are not the same day to day! When I went, they had pork katsu, tofu steak, and salmon teriyaki as choices for main entrees -- a good variety of choices to accommodate different diets. The Japanese groceries are back, too! Not much of a dramatic change there, but definitely a worthwhile visit to check out the new eat-in space!", "venue": "MAIDO A Marketplace of Japan", "date": "2015-09-03T00:00:00.000", "stars": 5}
{"review": "Wonderful grocery supplies and lunch counter. Friendly staff. they have a wide variety of japanese food and frozen products as well as some household goods. Absolutely recommended.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-12-06T00:00:00.000", "stars": 5}
{"review": "I went with a friend and ordered chicken katsu. It did not come with a bowl of rice. When I asked for one, I had to buy it. I thought when you ordered a meat dish, bowl of rice should be given. Also, for the price, the sizes are small. I ordered a small udon which was $6, and it was in a size of small rice bowl. Food was okay but little disappointing.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-09-02T00:00:00.000", "stars": 3}
{"review": "The most authentic Japanese cuisine in Ardmore! I absolutely love the gyudon and the curry udon. The flavors are just amazing and the $10 lunch special just makes it better. It comes with half an entree, a small udon and a small salad. Street parking can be hard to fine but worth the effort!", "venue": "MAIDO A Marketplace of Japan", "date": "2018-05-06T00:00:00.000", "stars": 5}
{"review": "Good Japanese grocery store and restaurant, love the fresh onigiri here, the tuna is amazing! The free barley tea is a nice touch as well.  Only disappointment: they don't carry green tea kit-kats. C'mon!", "venue": "MAIDO A Marketplace of Japan", "date": "2016-09-21T00:00:00.000", "stars": 4}
{"review": "Love this place! The food is incredibly delicious and the overall shopping experience is wonderful. So happy to have this in the area and I'll be coming back soon.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-09-24T00:00:00.000", "stars": 5}
{"review": "Great store and worth the trip out to Ardmore from Philly. My companion said I could have probably got all the ingredients for my okonomiyaki from one of Philly's Asian grocers, but I was glad I went. Maido has more going for it than simply a good selection, nice staff and orderly presentation. Recommended for shopping; haven't eaten there.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-06-05T00:00:00.000", "stars": 4}
{"review": "I don't know what's going on with their lunch counter but every time I eat there, I get violently ill, even the dishes that were okay at the old location. Maybe they're not properly cleaning their grill after all the customers they get now. The food -is- tasty, but I wish I knew what the deal was with this.They have a nice selection of condiments such as Bull Dog Sauce and stuff from the Otafuku brand (yakisoba sauce, okonomiyaki sauce...) plus some Japanese noodles, though not all of them are imported from Japan. It's worth it if you're in the area but there are better stores like H-Mart in Elkins Park and 69th Street.I notice a lot of people are mentioning Mitsuwa here. While it isn't as big as Mitsuwa. it's hard to make a day trip of that if you only have off on weekends, which is when they're simultaneously packed AND out of stock on a lot of things. Keep that in mind if you're going to go there. The LittleJapan store over there (near Mitsuwa) is pretty nice if you're into tokusatsu and anime, though.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-01-17T00:00:00.000", "stars": 3}
{"review": "Cute little Japanese grocery store/homemade fast food restaurant.  We tried some rice balls, beef bowl and a tempura udon. All the food was overall tasty. Nothing mind blowing, but for a quick, easy, delicious, no frills Japanese meal this place hits the spot.  There is a limited selection of items in the grocery store, but still was fun for a quick browse.  We'll be back, especially for the rice balls!", "venue": "MAIDO A Marketplace of Japan", "date": "2016-04-17T00:00:00.000", "stars": 4}
{"review": "Yummy, inexpensive. Very nice service. Awesome Japanese cartoons they put on for the kids. Interesting selection of sweets (so many kinds of Poki sticks, other things my not-so-adventurous kid has tried here). Cute decor, perfect for a family night out. A gem!", "venue": "MAIDO A Marketplace of Japan", "date": "2017-04-06T00:00:00.000", "stars": 5}
{"review": "Came in for a late lunch / early dinner on a Saturday. Place was pretty quiet. The woman that took our order was very nice. Food came out pretty quickly and was delicious. My boyfriend had the Okonomiyaki and loved it. Said it was the best he has had since he was in Japan. I had the Gyu Don, Beef with Rice which was delicious. We had a long day, and this was the perfect quiet dinner for a rainy night. They also have a small grocery section which was nice, and we were able to pick up a few Japanese snacks as well. Would recommend if you are in the area.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-08-01T00:00:00.000", "stars": 4}
{"review": "I have been driving by this store front for weeks and wondered what they sold. Then I saw it this past weekend on FYI philly what this place is all about. My husband and I went last night. Soooooo good. Everyone is so friendly. Took the time to tell me what I was buying. Then we went into the restaurant and ordered takeout. Our car smelled great, I had to ask my husband to drive faster or pull over I wanted to eat asap. Simply delicious. Clean, friendly and reasonably priced food. I will be back on a weekly basis..", "venue": "MAIDO A Marketplace of Japan", "date": "2016-01-27T00:00:00.000", "stars": 5}
{"review": "I ordered Karaage Chicken for in-house and was given a per-packaged container that was cold... and the woman running the cash register was rather rude. If I wasn't with a group of people I would have just walked out.My girlfriend got the Gyu Don (Beef, onion, soy sauce, sugar, dashi, mirin, pickled ginger, served over white or brown rice). The beef was low quality, hardly any onions... too much pickled ginger and everything else seemed missing. Also the portion was TINY (WAWA to-go bowl is bigger) for $12Other friends got got Udon (small -$6), and Katsu Don ($14) and neither looked fantastic...The small Udon is also VERY SMALL.TLDR: Overpriced, Over-hyped, Bad Service. For what I paid at Maido I could have gotten way better food in Chinatown... and a lot more. Not much reason to return.Also the selection in the \"market\" side is very small and almost everything can be found elsewhere at comparable prices...if not cheaper.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-10-17T00:00:00.000", "stars": 1}
{"review": "Driving down Route 30 a few weeks ago, this store caught my eye.  The brightly colored kawaii-style signs and a quick glimpse into the interior were all the encouragement I needed to stop in.  Even from the street view, this store looks like something special!When I visited for the first time this weekend, Maido delivered even more than I was expecting.  It is a lovely boutique Japanese grocery store that sells everything from Japanese snacks and candy to pantry staples to frozen and prepared foods to household items!  Prices are very reasonable for this kind of specialty store.  Staff are friendly and helpful when it comes to shopping because not all items have clear English labels, which can be a bit tricky for those who don't speak or read Japanese.  Having a smartphone on hand while shopping is a helpful hint, but in this day and age, who doesn't have one, right?In addition to the grocery store, Maido offers a dine-in restaurant with freshly prepared, authentic Japanese food.  While some of it is already prepared and ready to eat, there is a full menu of items that are made to order.  My dining companion and I ordered the okonomiyaki and katsu don and were not disappointed.  There was also a wonderful assortment of Japanese soft drinks in the dining area, including marble sodas, green teas and milk beverages - all very exotic and tasty choices for an adventurous Westerner!  The dining area is clean and modern.Maido is a great destination for a shopping and dining experience.  There is nothing else quite like it on the Main Line, which makes it all the more special.  Come for the Pocky, stay for the rice bowls.  You will not be disappointed!", "venue": "MAIDO A Marketplace of Japan", "date": "2015-11-18T00:00:00.000", "stars": 4}
{"review": "Cute store, exceptionally friendly lunch counter. The okonomiyaki takes a while to make, but it's really good.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-03-19T00:00:00.000", "stars": 5}
{"review": "Kyu-don and other rice bowl are as authentic as it could be. Wish they have ramen but I am happy to settle on udon.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-02-17T00:00:00.000", "stars": 5}
{"review": "The beef bowl was yummy! Reminds of the Yoshinoya chain in Cali but a better tasting one. A little too fatty but I guess the fat makes it  savory. The place is cute and bright, they have an open kitchen and bar type stools so you can see how your food is being prepped. The market on the side offers a lot of snacks and basic food stuff. Don't go there for food shopping and expect a big variety. They do have a lot of snacks and every flavor Pocky. Will go back there again for lunch.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-11-11T00:00:00.000", "stars": 4}
{"review": "Cute Japanese supermarket and food court. The tempura udon was good. They accommodated my request for only sweet potato tempura .. which was a plus. Good place in Ardmore for a quick lunch.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-12-16T00:00:00.000", "stars": 3}
{"review": "Maido! is a cozy, casual Japanese lunch counter and grocery store. The menu at the lunch counter features every day Japanese dishes, such as yakisoba, curry, and okonomiyaki, all rather tasty and filling. The store is stocked with various groceries, toiletries, and toys. There is always something amusing, cute, or generally interesting to see and buy. Lately, they have started holding events, such as curry tasting contests and mochi-making demonstrations, which, considering the crowds, are very popular. Maido! adds much fun and culture to Ardmore and its surrounding suburbs. I am not alone in appreciating its presence.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-01-12T00:00:00.000", "stars": 4}
{"review": "Grocery Store=adequate. Restaurant was an epic fail. Where was the cabbage in the Okonomiyaki?", "venue": "MAIDO A Marketplace of Japan", "date": "2016-12-29T00:00:00.000", "stars": 3}
{"review": "I came in here is take a look at what they have but a lot of the products are from china and a lot of the products are empty.  The prices are pretty overpriced as well. Compared to philly chinatown it is not worth the trip.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-09-20T00:00:00.000", "stars": 3}
{"review": "I had heard about the \"pancake\" here and. Couldn't  wait to try it. I went for lunch during the week. I ordered the veggie version of the pancake. There were three people working behind the counter and it took quite a while to make the one pancake. It was pretty bland and I really didn't like the consistency. I'm a vegetarian and this dish really left me feeling sick to my stomach.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-01-11T00:00:00.000", "stars": 1}
{"review": "Ordered the Ten Don, delicious, high quality, and fresh made but at $15 I was hoping for more than two shrimp.  A side of Miso would have been nice.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-09-25T00:00:00.000", "stars": 4}
{"review": "Wow! Authentic Japanese curry and noodles.  They have efficient service and we loved sitting at the counter watching the chefs do there magic!   Can't wait to back.", "venue": "MAIDO A Marketplace of Japan", "date": "2017-07-28T00:00:00.000", "stars": 5}
{"review": "Omg ! Yes to hi chews! This place is amazinggg! It's two sides to it. One is a grocery store & the other side is mini Resturant. Plus I was able to get some organic roasted green tea and fresh miso soup. It has a nice vibe and the food is great! I'm so glad Ardmore has added this new addition. The menu is really inexpensive and they have fresh sushi!", "venue": "MAIDO A Marketplace of Japan", "date": "2016-01-16T00:00:00.000", "stars": 5}
{"review": "Update: the quality of the lunch counter here seems to be in a bit of a decline.  Ordered a gyu don, which turned out to be more rice and less beef than before. The beef was without much flavor yet very fatty.  My wife ordered bento with salmon that was over cooked and to the point of being hard. It also tasted a bit old to. Interesting to see how Maido's lunch counter fares with two Japanese ramen shops opening in Bryn Mawr and Wynnewood in the next few months. This is the go to spot for Japanese items and \"home made\" style dishes that you wouldn't find in many restaurants. Menu rices are pretty steep for a lunch counter set up -- about 50% more for smaller portions than the Narberth although the menu is greatly expanded.  Guess that's to be expected as they're mostly likely paying for the prime Ardmore location.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-03-13T00:00:00.000", "stars": 2}
{"review": "I LOVE the new Maido! I have been going to the one in Narberth for a long time and I was sad to see them close their doors there. It's been almost a year since they relocated to Ardmore, and I am thrilled that they are back in business again. There really is NOTHING like Maido anywhere else!!They constantly get compared to H-Mart but really that is not a fair comparison, they are completely different (besides the fact that one is Japanese and one is Korean.) So for people who say that H-Mart is cheaper or has a better selection, you are really missing out! Maido is exclusively Japanese and carry things you won't find anywhere else!In addition to being a Japanese grocery store, Maido sells and prepares authentic Japanese food which is delicious and reasonably priced. And it REFRESHINGLY does not have too much sushi options, but instead hard-to-find entrees like okonomiyaki, katsudon, yaki soba, and even bento boxes. I really like that Maido has expanded their restaurant business. Originally, Maido was primarily a grocery store, with a very limited kitchen counter of three food choices. Now they have expanded their menu and added some wonderful new food items. I had the pork katsudon the other day and it was delicious. I am delighted to find a place that prepares some of my favorite Japanese entrees.The only room for improvement that I would like to suggest is that the previous Maido did not carry books and movies for an English speaking audience, and I hope that the new store does. I would love to be able to buy manga or anime in translation.Highly recommended!Pros-excellent food choices, all delicious, affordable, and authentically Japanese-lots of fun grocery items-friendly, hard-working staff-unique and different from any other place in the Tri-State areaCons -parking is tough since it is located in the middle of a busy intersection, try parking in the Suburban Square lot and walking up the street", "venue": "MAIDO A Marketplace of Japan", "date": "2015-09-13T00:00:00.000", "stars": 5}
{"review": "I really would like this place as an addition to the main line but charging 4 bucks for an extra tiny bowl of rice is ridiculous. The food is okay, it didn't blow my mind, plus it was a bit overpriced. The grocery store area seemed a bit empty. I guess it'll take some time to restock. As for now I'll save my trip and money for upper Darby where H mart is. At least it's cheaper and you'll get more bang for your buck.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-10-28T00:00:00.000", "stars": 2}
{"review": "I was very excited to see a new asian market in the main line. This may be too early to say because it still looks like they are \"settling in.\" Their selection of Japanese grocery items are limited and needs to be better shelved. The shelves still appear empty. I am willing to update my review if they update their store and \"complete it.\" Their cafe/restaurant area was cute and had frequent customers for a quick bite to eat. Will check this place out again in a couple of months.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-09-20T00:00:00.000", "stars": 3}
{"review": "Avoid the okonomiyaki! I ordered a mixed one (the have shrimp, pork, or veg options), which had plenty of shrimp and cabbage, and one thin overcooked slice of pork on top. The portion size is quite big, over 10\" diameter, for $12 would not be a bad price had it tasted good. The batter was boring and mush in the middle. Perhaps I would have said that for most versions of okonomiyaki other than Hiroshima-style, but this stood out because of how thick the pancake was in the middle.The cook was holding my plate for a minute in her hand talking to another customer until the waitstaff realized this and try to take it off her hand, at which point the cook said it's not ready yet and put on the final seaweed topping. Good thing I was not hungry! Although to be fair, the place started filling up after I ordered and dishes were served relatively quickly.The open counter space was clean, with bright lighting. I appreciated the self serve barley tea, although I'm not a fan of styrofoam cups (this seems common to number of places nearby).As for the grocery side, you can get standards like 14oz of tofu for $1.39. Plenty of Japanese snacks, drinks, instant noodles, and some veggies for decent prices.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-10-06T00:00:00.000", "stars": 2}
{"review": "Tiny Japanese grocery (more of a bodega or convenience mart) with a small restaurant attached.  Restaurant is more geared to takeout bento boxes or some quick fix food. A great addition to Ardmore - worthwhile to checkout if you appreciate Japanese food.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-11-25T00:00:00.000", "stars": 4}
{"review": "Took my girls for dinner.  Superb! It was an awewome experience.  The mochi at the end was excellent.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-02-20T00:00:00.000", "stars": 5}
{"review": "Just grabbed a sushi roll and browsed the market area. I thought there was an excellent selection and the service was great.Would go again.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-03-18T00:00:00.000", "stars": 5}
{"review": "I thought it was a cute little market. Not a big selection in the market but enough for me to grab all the items I wanted. I also stopped in the eat-in area and grabbed two salmon mayo onigiris. Yum. I had my two boys so I rushed in and out but I will come back. Both the cashiers in the market and the eat-in area were very nice.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-12-15T00:00:00.000", "stars": 4}
{"review": "Authentic Japanese cuisine. A bit pricey, but the ingredients are fresh; so I personally think it's worth it. All staff working hail from Japan, so at least you know you are getting an authentic Japanese dish.   Staff are super sweet! Seiko, the owner, and Hiro, one of the chefs, make one feel super comfortable.  The place has a relaxed feel to it.  Hopefully they will get a sushi chef in there soon. Looking forward to going back.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-09-09T00:00:00.000", "stars": 5}
{"review": "This small place is part grocery store and eatery. Very good Japanese  fast food. I had chicken curry, udon, and onigiri. All were tasty. You place your order and you pick up your food.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-11-13T00:00:00.000", "stars": 4}
{"review": "If you've even been to Mitsuwa, you'll be really disappointed.  But as an Asian market, they are okay.  They sell some staple and unique Asian noodles, pocky, sauces, spices, pocky, frozen foods, pocky, frozen desserts, and a small section of vegetables.  Did I mention they have pocky too?  There's quite a but of it!  The prices are about average in my opinion.  And with H-Mart not too far away near 69th street, Maido is good for last minute items if you're in the area but their selection is limited due to its space.  But with very limited Asian supermarket options, especially in the suburbs, Maido is pretty convenient.  The Japanese lunch/dinner dine-in side of Maido is really good. Everything is made fresh when ordered so you know you're getting good quality.  The price is slightly above average and the food is pretty authentic and tasty from my experience with Japanese foods.  The Udon noodles aren't too soft and have a little chewy al-dente texture and just right.  I'm not sure if I'll be back just because there are more affordable food options in the area.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-02-28T00:00:00.000", "stars": 3}
{"review": "Went there for lunch on a Sun. Pretty interesting Japanese market with a smallish selection of Japanese groceries. Ordered a large bowl of plain Udon, Gyoza and the Karaage chicken. Udon was simple but flavorful. But the Gyoza and Karaage chicken were a disappointment. Despite having a fully functional kitchen, both came out cold as they were prepared ahead of time and just sitting on the counter, presumably for take-outs. Gyoza was soggy and the chicken, although tasty was just like fried chicken which has been sitting for a while.", "venue": "MAIDO A Marketplace of Japan", "date": "2016-03-07T00:00:00.000", "stars": 2}
{"review": "Great place.  Udon was very very good.  The bento box was also good. Can't wait to try their other food and the grocery store.  Everyone is very friendly.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-09-04T00:00:00.000", "stars": 5}
{"review": "I was so excited when this place opened but when I ordered the Karaage Chicken and was given something that had been made earlier and was barely reheated, being upset was an understatement. It was very chewy and lukewarm at best. I was appalled that they would consider serving something like that. I liked the other dish they served me, but based on the chicken alone, I will never come back here. I don't see how Maido can run their business and serve food like that to customers! So disappointing....", "venue": "MAIDO A Marketplace of Japan", "date": "2015-11-01T00:00:00.000", "stars": 1}
{"review": "We are very happy to have Maido so close to us! Great homestyle Japanese food plus a small Japanese supermarket too.", "venue": "MAIDO A Marketplace of Japan", "date": "2015-10-12T00:00:00.000", "stars": 5}
