{"review": "Great bar for a good simple burger. Reasonably priced. Great fries. Family-like. I like grabbing. A quick bite to eat", "stars": 5, "date": "2018-12-24T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "First timer going out a new place for burgers.  We started out with potato skins which came out with 4 half slices,  one more burnt than others but other than that a good portion of fillings in each, with bacon, red onions and cheese. The cheese part was bland and could have used a sharp cheddar instead. I ordered the onion burger which came with cheddar and onion rings and a side of fries. The burger was cooked perfectly at medium with a nice char. The burger is huge! Took the other half home. My hubby had the Patty melt which was not a traditional melt.  It had whole grain toast and it was not grilled. The meat had great flavor though. Great fries too.The beers on tap had a combination of local to national options with many in bottle as options. There's a beer for every taste.", "stars": 4, "date": "2018-12-30T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "It seems weird to give a bar 5 stars but this is much more than a bar. I came in here for some bar food on a week night and got so much more than that! The place was packed so that should tell you something. This is a legit restaurant with great food. Every entree that went by my table looked and smelled amazing. I got the shepherd's pie which was huge and the best I've ever had. The interior of McCloskey's was really well done so kudos to whoever did it! It has such a warm inviting feel. When the weather is nice, they can open up the entire front and so you can sit inside and enjoy all that fresh air. ..wonderful! Live music, especially the jazz is a welcome edition. This will definitely be on my list of places to go when in the area!", "stars": 5, "date": "2016-09-25T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This was a very nice stop for us. My sister picked it, since she is a local. We were greeted upon entering and seated promptly. Our server was very friendly and took our orders with ease. The food quality was very good and no one at our table had any complaints. We will definitely come back again before we leave.", "stars": 4, "date": "2018-07-10T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Lobster ravioli and caprese sandwich were enjoyed by my kids.  My burger ordered medium was very well done and dry.  Only ate half it was that unacceptable.  Server was nice and friendly and they took the burger off the bill, but you only have one first impression and that was mine.", "stars": 3, "date": "2018-08-18T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This place is consistently good!  The only drawback is that it's small and no reservations, so if you get there late on a weekend it's tough to get in!Great burgers, good wine, and kid options on the menu!", "stars": 5, "date": "2018-03-19T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "It says it is an Irish pub but the menu is primarily American food.  The food is very good, generous portions and reasonably priced.  The staff is very friendly and attentive.  Mary and her daughter Melanie do a great job.  There is a large selection of draft and bottled beer.  They have free WiFi and they are also an Xfinity hotspot if you are an Xfinity customer.", "stars": 5, "date": "2018-05-20T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Mccloskey's is a classic Irish pub for the locals like me; though I live in Bryn Mawr. Excellent beer menu at fair prices; home made pub classics from Salads over burgers and Irish fare like fish and chips. Always a nice crowd and friendly waiters. Going here regularly", "stars": 4, "date": "2017-02-09T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "McCloskey's a great little neighborhood tavern. It's small, but a nice place to eat and drink. They open their large windows which feels as if you're eating outdoors (if you sit close to the window area. Their food portions are very large and generous! Servers here are very fast and kind. They definitely have great bar food here, but also great dinner food as well. I've had their roast beef sandwich and it was amazingly buttery like to me! Their traditional own burger is also great too, and the set of fries it comes with is so satisfying. I like that this place is kid friendly with the menu as well. They have a small section for the \"wee ones\", which are things kids typically like to have. Kind of funny and cute they have Shirley temple for the kid menu too. I've heard their Shepard's pie is yummy, which I plan to come back for eventually! Love Shepard's pie in general lol. I also saw someone getting the crab and shrimp linguine, which looked huge and delicious. You could probably and possibly split a plate with someone if you're trying to get way too full. Great neighborhood tavern to try, especially with kids.", "stars": 4, "date": "2018-06-02T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "The food was exceptional, however towards the end of our meal two mice ran right across the dining room. When I told the bar tender, she was not very accommodating and said that every business in the area has problem with mice since the construction. She seemed confused as to why this was a problem. It's a shame, I really like this spot!", "stars": 2, "date": "2018-12-07T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "First, an update to the tip I left previously.  They have as of 10/17/16 begun serving food out in the beer garden area. Yay! It's a lovely space and I'm happy you can now get more than beer there.Dee M and I stopped by McClosky's during Ardmore's Oktoberfest.  The place was crowded, as would be expected for this event, however we were seated pretty quickly and served promptly.  We loved the selection of beers - I'm an 80's gal who loves the Pilsner and isn't nuts about IPAs, and sometimes I have a difficult time finding a beer in this IPA and saison heavy market.  Thank you skilled staff for finding me a good beer!  We got appetizers, which were decent.  My \"Irish potato skins\" were just like every other potato skin, a little on the bland side, but fine. Dee got the cheesesteak Spring tolls where were much tastier.  I have to say, given how packed they were, they did a fantastic job handling everything.  We'd go back.", "stars": 4, "date": "2016-10-18T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "My first experience here was a great one. Service was prompt, accurate, and accommodating. Food was delicious. I had the hummus appetizer and the lobster ravioli. Highly recommend.", "stars": 5, "date": "2018-05-15T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I got the buffalo chicken salad. Good food. Average service. I don't feel like writing anything else.", "stars": 3, "date": "2018-11-16T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Burgers are to die for!!!! Cesar salads are amazing. Desserts are homemade. This is a good go to casual spot. Portions are huge and prices are reasonable.", "stars": 5, "date": "2018-02-25T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I love McCloskey's.  Great neighborhood spot, and always delivers on a consistent dining experience.  Their wings are awesome, and the burgers I've had are delicious. The beer list is always really good, and the servers are all really friendly.  Great spot overall!", "stars": 5, "date": "2018-07-29T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Stellar Tanqueray martini; the bartender has it down to a science. The food looked great also and very friendly staff and clientele. I will be back next trip!", "stars": 5, "date": "2017-07-03T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Like others, I'm not sure why McCloskey's is rated 4/5. The attitude of the staff was fine in itself but the food took forever. As you can tell by my previous reviews, I am not particularly picky with food. Good service and good quality mean high marks from me.Since the food was slow, it had to blow me away. It was utterly disappointing. We ordered two dishes. One was burnt with no flavor and the other was so soggy that it fell apart once it was picked up. More detail isn't really necessary when burnt and soggy are already in the description.It was just a bad experience and nobody is perfect. Maybe next time they'll blow me away but I wouldn't hold my breath. One good thing: good selection of beers on tap along with reasonable prices but you can really get this anywhere. This is a local neighborhood restaurant so maybe I'll be back one day but it seems highly unlikely.Points for: serviceable staff attitudeNo points for: food, length of time to get food", "stars": 2, "date": "2016-04-04T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Stopped in here based on Yelp reviews and loved it. The staff were very friendly, and helpful. I ordered the General Tso's chicken sandwich. The sandwich came on a tasty bun, the chicken was cooked perfect, topped with a slice of avocado and the spicy sauce. Included was a serving of fries. All food and drinks were reasonably priced. Definitely will go again just to try other items on the menu.", "stars": 5, "date": "2016-10-22T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This place is a hidden gem. Stopped in on a whim because it looked cute from the outside and it really was. A very charming Irish pub with a lot of character. Sat in the booth right by the window and enjoyed the setting so much - didn't even feel like I was in Ardmore. Friend and I ordered soup to start, Irish mushroom and Italian wedding. Both were served hot and very delicious. For lunch one of us got a burger which was fresh and tasty, and the other got a roast beef sandwich. Beef was tender, served with aus jus and horse radish. Service was so friendly and just an overall great experience. Can't wait to go back!", "stars": 5, "date": "2017-02-05T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "One of those solid neighborhood bars that it took moving 2 blocks away from to recall. While seldom my first or second option, its one of those good low key suburban food and libation options that have always managed to be consistent for the 10 plus years that I've visited.The draft list touts an admirable 15 taps that constantly sees brews from the likes of Southern Tier, Ommegang, Ninkasi, and La Chouffe; and they can make a pretty dapper cocktail when its needed. And the menu takes things up a notch with options like apple Jameson chicken wings and and a quesadilla of the week for appetizers, 10 different burger options, a multitude of pasta dishes with or without seafood, and reasonably priced entrees like a $21 filet mignon.", "stars": 4, "date": "2015-05-19T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Decent neighborhood Irish pub with big selection of beers on tap that rotate. Not a bad menu or kitchen either", "stars": 4, "date": "2016-10-28T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Came here for Valentine's Day and it was amazing!! The server was so nice and accommodating and made some really nice suggestions. I would highly recommend.", "stars": 5, "date": "2017-08-12T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Really cool place to A: hang out for a beer and talk to the bar tenders & patrons. If you don't know anyone in town, you can find a friend here. B: sit down and have dinner. It was a night night and they had all the windows open.", "stars": 5, "date": "2016-09-12T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I went in for dinner, the place was jumping! I had a great beer and some delicious beef stew. A great drink and meal for a cold day. There was a funny little fella working who knew a lot about sports, he really dropped some random knowledge on NCAA football.", "stars": 5, "date": "2017-04-17T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "As a restaurant owner I never write reviews.   The front of the house staff seemed a bit snobby as we had just come from a spin class in general exercise attireThe clearly seasoned bartender gets the full 2 stars above.  We were handed soupwithout proper silver wear,  mu prepped salad sat behind the bar over ten minutes and than was handed off to the wrong customer just to be returned to me.Bad food handling practices. The salad had about a cup of mixed greens to it. We were rushed out.  Judgment based on what one looks like is just pathetic. You need to overall your staff.  Now the bar top next to us got welcoming service. To bad most millionaires walkAround on scrubs", "stars": 2, "date": "2016-02-03T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Ugh not worth one star. They need a new chef ASAP. We started off with the egg rolls. Like 8 dollars for one strip?! I may as well go to a freakin Chinese store. It did not look right... My boyfriend got a chicken parmesan and he thought it was bland and over cooked. I got the crab and shrimp pasta which was way to watered down!! Like it didn't have any taste other than the crab. Ugh. Shout out to the server who didn't even ask if we liked our food. I bet she knew it was going to be bad. If you want to go I advise you to just get beer cause it's honestly it was over priced & no one should waste their money on bad food.", "stars": 1, "date": "2015-10-11T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I've been here a few times when I lived in Ardmore, and now that I'm in the city, it's still one of my suburban destinations. Biggest draw is their impressive beer list. It's a bit hard to see since the seasonals are all up on the chalk board, but worth a gander when you first get there. I love that they get their summer shandy in early.Once you've arrived for the beer list, don't hesitate to get tempted by the food. I have to say I've never not liked my meal here. I try to stick to the healthy side - I think last time I got a spinach sandwich with a crab cake. It was really ridiculously good for food at a bar!The atmosphere is nice. It's not loud and raucous and doesn't get too packed. Mostly everyone's just at a table and a well-mannered 'burbs crowd - no crazy Villanova drunkards in this pub. Although, I don't think I've been here much past 11...my guess is you're safe though.", "stars": 4, "date": "2014-04-14T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Veal weinerschnitzel is one of the best dishes on main line. Get with pasta. Also order a jack Daniel's. Great glass. Great pour.", "stars": 5, "date": "2016-04-22T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "It hurts me a little to do this. As you can tell by my previous reviews, I am a huge fan of supporting small local businesses but I cannot for the life of me understand why McCloskey's is rated 4/5 stars. Perhaps it was just an off night.We went to McCloskey's for a casual meal to watch the end of the Steelers/Broncos playoff game and ate at the bar. First things first, service itself was fine. We didn't order alcoholic drinks, we just wanted to be near the TV's.Now the food.This was probably the third time I've been to McCloskey's since I moved to Ardmore two years ago. Each time, the food took more than 30 minutes (this is the kitchen, not the waiter usually, so I stand by my statement that service was fine). This was one of those things that \"redawned\" on me while we were waiting since I don't go often, it's just close and convenient. Kind of like \"oh yeah, the food usually takes awhile here\"). An idea of the timeframe: We arrived at the very beginning of the fourth quarter only to get our food with about 90 seconds left in the game. That's quite awhile when a game takes over three hours to play. All we ordered were wings and a vegetarian sandwich. And they were not busy. We found seats at the bar right away with open seats next to us as well. I also saw the cooks out of the kitchen watching a part of the game while we were waiting.I honestly felt like Gordon Ramsey on Kitchen Nightmares while eating. The wings (ordered medium) arrived burnt with all the sauce on the bottom. Thus, they were dry. There was absolutely no flavor. A rotisserie chicken from a grocery store would've had more flavor. They were burnt and dry. It was as if the sauce was put on the plate and then the wings on top of it. Even so, the sauce was not great. Maybe if the cooks were paying attention to the wings, they wouldn't of been burnt? I thought maybe this is how they were supposed to look but the people next to us also got wings and they looked properly prepared with the sauce on TOP of the wings. To be fair, I remember them being better in my past trips.The vegetarian sandwich was also a disappointment. It comes with goat cheese and basil oil. It was mostly goat cheese and basil oil with some veggies thrown in. Thus, the sandwich was soggy and had no chance of staying together while eating it. It was almost as if the goat cheese was used as a way to keep the veggies together and not fall out of the sandwich, an unsuccessful strategy. My date ate half and left the rest which is saying a lot because we hate food waste. It was nearly inedible. Overall, a bad experience. The initial goal of enjoying the game while eating wasn't even accomplished because of how long the food took. The only saving grace is that their drink list is extensive including many, many beers on tap. Many of them craft beers as well. It's also a local place. These two things got it a 2/5 instead of a 1. Unfortunately, we will probably never return.", "stars": 2, "date": "2016-01-20T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Our first visit was on a crowded Saturday night. We put our name in for a table and were pleasantly surprised with the food. The buffalo wings with homemade sauce were juicy and delicious. I ordered a cheeseburger with onion rings. Both were very good and cooked at my desired temperature. My husband raved about the value and taste of the prime rib. We shared the peanut butter pie for dessert. All the desserts are homemade. Our waitress was great. We will be back to this little neighborhood gem.", "stars": 5, "date": "2017-03-28T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "One of the best places to eat and drink in the main line!!! The staff is the best and the food great!", "stars": 5, "date": "2017-05-06T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This tavern fills up fast so make sure to have a smaller party, get their early, or be ready to wait. They have an impressive draft list, just read the chalk board to see what they have, the ABV and the price.  The staff is friendly, every entree we had was well done.  The appetizer was a group favorite.  Love their fries, cool pub atmosphere.", "stars": 4, "date": "2015-08-02T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This cramped little place can't decide if they are a restaurant or bar and tries to be both with claustrophobic results. The noise level makes conversation impossible and the tables are small and unsteady. The prime rib was overpriced, fatty and bland.", "stars": 1, "date": "2017-05-17T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This is the best bar/pub that I've been too.  The drinks are affordable, i always order straight tequila in a Martini glass for only 7 bucks. And their food is phenomenal! Their Irish mushroom soup is a must and I'm also a big fan of their burgers and chicken picante. 5 stars def.", "stars": 5, "date": "2017-03-04T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I have so much love for this place. Always a great draft list, generous pours of wine, and delicious food. The staff is really friendly too. We always sit in the bar area and they're always chatting with regulars like they're family (while still doing their job!). I love the atmosphere here.My husband loves the roast beef sandwich. The new apple Jameson pulled pork sandwich is the bomb diggity- can they please sell that sauce? The wings with that sauce are great too. The meatloaf is delicious.", "stars": 5, "date": "2015-07-25T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Found this on yelp and decided to try it based on the reviews.  Food was excellent as was the service.  Our server (I think her name was Karen) did a great job and had an excellent sense of humor.  Dave the bartender came to check on us as well.  Price was right and we'll be back!!", "stars": 5, "date": "2016-11-15T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This restaurant has these super cool tables that are right in front of giant open windows that overlook the street. My boyfriend made reservations for us here so that we could sit at one of those tables at night--and we were very pleased that one was there waiting for us!I ordered the Crab Cake Sandwich; he ordered the Roast Beef Sandwich. They were both huge! Very delicious but a little on the salty side. Our waitress was very friendly. She accidentally brought my boyfriend french fries instead of onion rings (which cost extra) so she gave them to us for free. The ambiance here is very pleasant. There are always lots of people inside but it feels cozy. We got to watch the sun go down on Cricket Avenue and it was a truly lovely time overall. I would definitely recommend this restaurant if you're nearby!", "stars": 5, "date": "2014-08-08T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Good burger. Your waitress's stubborn refusal to recommend anything specific on the menu may lead you to assume there's nothing else on the menu worth trying.", "stars": 2, "date": "2016-05-01T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Ordered wings for an Eagles game because I read that they were delish.  My sources did not disappoint.  These wings were meaty and flavorful and cooked perfectly!!We got the Mild and Barbecue.   My palate cannot handle anything too spicy, so these  hit the spot.  They came with blue cheese, celery and carrots. Bonus points for the carrots.  Loved!  Cute little pub atmosphere-- would definitely go back and dine-in with a pint of Guinness!", "stars": 4, "date": "2014-11-05T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Timmy is the man, solid food good people and watch whatever you want. Oh and good pours of wild turkey 101. The steamers are legit, ask for bread. Great beer selection, go!", "stars": 5, "date": "2016-07-30T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "If not an official regular I am pretty close. Fun and friendly bartenders and everyone is welcoming. Most evenings have a good bar and restaurant crowd, of course Fridays and Saturdays very busy. The food is consistently excellent for a small local bar.  And the burgers are excellent. Best in this area. As a loyal customer I recommend McCloskey's highly. Check it out.", "stars": 4, "date": "2014-07-22T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I like this local neighborhood bar/restaurant. It's one of the original Irish pubs on Cricket Avenue & one of the friendliest. I'm addicted to the Mushroom Boursin Hamburger. I think I've got a problem but hey, there could be worse things right? Decor could be updated but that shouldn't stop you from going in for food & drink.", "stars": 4, "date": "2016-09-02T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "It's a fairly small pub tucked in a side street just of Rt 30. There are a few booths but most of the seating are normal tables. It also has a large bar with a good selection of beers written on a chalkboard so I guess specials can change fairly regularly.It's a quite restaurant and seemed to be popular with middle age+ locals. The menu is fairly standard pub fare. We ended getting a few apps: wings with the delicious apple Jameson sauce, quesadilla which was average, crab balls were good but only came with five and were kind of small, and some potato skins which were nice and crispy. I got the paddy melt which was excellent.The entire staff was very accommodating and the bar had some football games on. I can see why it's a popular spot in Ardmore. If you are coming from out of town, there's a parking lot across the street.Don't be mistaken by the name for the type of cuisine. There are a few Irish dishes like the shepards pie, but it was mostly sandwiches, burgers, and pasta dishes. Everyone was happy with their dishes though.", "stars": 4, "date": "2014-10-19T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Pretty small place but we were seated right away on a Saturday night around 6:30. Many different types of beers available which is always good to see. For an appetizer my party of 4 and I got the Cajun wings which were perfectly spiced and hot. In addition to the wings we also got the potatoes skins, which there were 4 very big skins, they were great. I ordered the classic bacon cheeseburger at medium. It is a big burger and was a bit overdone, but overall wasn't that bad. Id say if you are in the area definitely check this place out if for food or just appetizer/drinks.", "stars": 4, "date": "2016-08-14T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Truly a locals joint! Fun place to go have a cold one or sit and partake in some good grub, Irish specialties and regular pub food. Wait staff and bartenders are great! It's a go to place for us. But if you go on the weekend - prepare to wait for a table! It's a popular place.", "stars": 4, "date": "2016-05-21T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Stopped in for a quick beer , ordered a Leffe blonde. Comes in a little 12 Oz glass. 7.00. Really 7.00, that's just to much.", "stars": 2, "date": "2015-09-20T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Great pub food. Booths are a little tight for four people, however.", "stars": 3, "date": "2016-03-01T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I was visiting the Philly area a few weeks ago for my birthday and stopping by McCloskey's was the best decision I made.The bartenders knew about every beer on tap and in bottles, they were able to easily suggest a great IPA for me to try. They even have these great beer books with tons of information about all the bottled beer they serve.After a few beers I ordered the wings (which were the best birthday present to myself) and my friend ordered a burger. In the end we shared our meals because they were too good to just eat one.Service was great and super friendly, I felt like a regular even though it was my first time visiting.I'd make the trip from NYC any day to eat those wings again.", "stars": 5, "date": "2014-03-24T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "My boyfriend and I had a great meal at McCloskey's the other night. We both got sandwiches, which came with well-seasoned fries. Both dishes were cooked perfectly and came out in a timely manner. It was a bit tight in there, and a bit noisy, but honestly, I'm nitpicking. I would certainly return if I am looking for something a little more upscale than your average pub.", "stars": 4, "date": "2013-11-24T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I have a chance to visit McCloskey's maybe two or three times a year.  However I've been doing that for at least 10 years so I feel I know them fairly well.  I usually sit at the bar and drink interesting beers.  They usually have a Chimay on tap which I enjoy.  If I'm in the mood for a bite they have the most amazing Cajun chicken tenders ($6.50).  They are not battered but instead are dusted with Cajun spices.  They are very very spicy and delicious.  The Shepard's Pie is also excellent ($14).  There is a great public lot across the street so parking is a breeze.  If you go for dinner try for the table by the window as it's great for people watching.", "stars": 4, "date": "2011-05-08T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "There is literally nothing on the menu that I would not recommend.My personal favorites: hummus appetizer, veggie sandwich.", "stars": 5, "date": "2014-03-22T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Came for lunch while traveling. Seems like a nice place and I would return but prime rib sandwich was over cooked and service while nice was pretty inattentive even though the place was pretty much empty.", "stars": 3, "date": "2015-08-10T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This is a stellar Irish Pub in Ardmore. Walked in around 5 and took one of the few seats left at the bar. Some serious end of the day drinking seemed to be taking place by good patrons of the establishment. The bartender was friendly, especially after he saw my Eagles hat and what he mistook for a blue and grey Cowboys sweater (it was a film festival jacket). Had the happy hour buffalo wings which were excellent. For dinner I had a tremendous cheddar cheese and onion ring burger. The side of onion rings were a little overdone. The Paulander Octoberfest was delicious. The food was excellent. Great tapped beer list. This is a place I will return to. Highly recommended", "stars": 4, "date": "2015-10-01T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I'm for sure a fan of this place. Took a while to find time to stop by, and now it's been twice in the last three weeks. I think I'll keep coming up here!1. The place is as cramped on a Friday/Saturday night as described by others. It gets tight. To the staff's credit, they don't get frustrated over this. They accept it. It's a nice change for the client from other places here locally.2.  They do a traditional Happy Hour and Daily Dinner Specials. There are folks that come the same night at the same time every week. Top special is Prime Rib on Friday night. I mean it's big, gotta be a full 16oz.. It comes with a simple baked potato, and sauteed beans. Plain white plate.3. I prefer the bar here as the preferred spot. While Martha and I can just chat for hours.......having a beverage, watching the game or news with a well made dinner is a nice treat.4. The bartenders provide nice pours without being completely over the top. They seem to have been born in the bar as they know ABSOLUTELY everyone!!I've enjoyed every visit so far, and I'm sure I will in the future.You will too.", "stars": 4, "date": "2015-11-03T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I'm not sure if it's true, but I heard a bartender here has won the Philly.com cutest bartender in Philadelphia area award for 2015. I believe it to be Paddy.", "stars": 5, "date": "2015-10-30T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "After living in the area for multiple years now, I only just discovered McCloskey's. While the crowd was made up of all middle aged couples; my friend and I were literally the youngest people in there by at least 15 years (on a Friday night nonetheless) it was actually a nice experience. It is a small spot and was absolutely packed, which we figured spoke well for the quality of food. We managed to grab a drink from the bar while waiting for our table, but even that was difficult because of how crowded it was. We both ordered burgers and were very happy with our meals. I'm sure I will end up back here at some point, but probably not on a weekend night in an effort to avoid the crowd.", "stars": 4, "date": "2015-01-06T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I live down the street from McCloskey's, and it is far and above my favorite restaurant in the area. I have found the food to be consistently flavorful and well prepared, and the staff to be friendly and responsive. In addition to the food, they host a nice beer list that is constantly changing. I would recommend McCloskeys for friendly get-togethers, date nights if you're looking for a lively setting, or for watching sports at the bar.", "stars": 5, "date": "2016-09-20T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "The girls and I were around Ardmore for some shopping.  OK, they were shopping, I was walking with them.  Afterwards we were looking for a non-chain place to eat and found McCloskeys.  Found a table right away and were greater as we were sitting down.  Drinks were served quickly and orders taken efficiently.  We had the daily special of crab quesadillas, the California chicken sandwich, bacon cheeseburger and the patty melt.  I had the patty melt and fries.  Very good.  Big patty, grilled bread just right with tasty grilled onions.  Really very good.  Fries were also very good.  Really enjoyed it.  The other burger was the same, good size, good bun and tasty bacon.  My daughter liked the chicken sandwich and my wife liked the quesadillas.  Found the food really good, service was also good but it was pretty slow early afternoon.  When in the area will definitely go back!Solid 3 1/2 stars", "stars": 3, "date": "2014-01-01T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I've been here a few times already, and I really love this place.  It's a great neighborhood pub and has such a homey atmosphere.  The draft beer selection is always rotating and there seem's to be something for everyone.  We've sat at the bar, in the bar area and in the dining room and have had great service in all spots.  Everything we've ordered for food (burgers, pasta, fish, salads) so far has tasted great, My only complaint is that it gets a little crowded on Friday and Saturday nights!", "stars": 5, "date": "2015-12-01T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "French Fries are remarkably bad, frozen, not even an usually design. I your an Irish-like bar and you serve up rectangular fried fish blocks for fish n chips, your not an Irish-like bar. Burger was very tasty but on the smaller side compared to other bars that specialize as being burger bars. They had Firestone Union Jack on tap so that kid of made up for it but compared to places in New York City where I dine frequently Main Line restaurants are over priced and don't get quality ingredients. If I go again, I guess I'll stick with the meatloaf. Oh the fish n chips were $15.00 ridiculous and subbing onion rings for fries was an extra $2.00 I know they have done well in the past but this restaurant is resting on their laurels.", "stars": 2, "date": "2014-12-14T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Was there the other night and the handsome bartender was working again. He's so cute, short and stocky. I just wanna eat him up.  Food was also top notch", "stars": 5, "date": "2016-02-21T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "My husband and I went here last night to try it out because it was close to our salon and we had just read that they received the \"best of the mainline\" for best wings. (and we are huge wing lovers!) So we headed on over after work. I was concerned the parking would be an issue because it was ardmore, but there was conveniently a parking lot across the street. We were immediately greeted by a friendly hostess when we walked in and were able to be seated right away. I got mild wings and my husband got the apple jameson wings. Both were very good. The blue cheese dressing seemed like homemade and was also very good. The fries we ordered were lightly battered and very unique tasting- we really liked those as well. We both ordered the special cane sugar sodas that they offered (they contained no high fructose corn syrup or artificial sweeteners, which I really loved because I'm pregnant) and they were delicious! Overall, we thought the most exemplary thing about this place was the staff. They were so friendly and just seemed genuinely happy to be there. A lot of the customers seemed to be regulars, and we did see some kids in the crowd too. It was busy, but people weren't waiting long to be seated because the staff really was so efficient! We will definitely be back!", "stars": 5, "date": "2012-06-30T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I recently moved to the Ardmore area and this place has already become a staple. Great food, drinks and service! Did I mention that it's also walkable and reasonably priced? Simply awesome.", "stars": 5, "date": "2015-03-22T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "So this place falls within the category of how I feel about Irish pubs, great beer selection but lacking food quality. The wings, both Jameson and buffalo hot were very good, but that was the best part of our meal. I considered ordering the fish and chips, figuring that falls within the Irish pubs target zone, but the waitress suggested the crab and shrimp pasta, so that's what I ordered. Description was lump crab and shrimp in a white wine sauce. They forgot the crab, nothing, lump or otherwise. My wife had crab cakes, and while she said they were good, I could see that the filler far outweighed the crab. I guess this is what I get for not waiting the hour for a table at Tired Hands Brewery!  But we had the kids, who were starving.", "stars": 2, "date": "2014-11-29T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I gave them a do-over and boy did they respond!  What was once a one star restaurant in my book has completely reinvigorated me! New owners, great food, excellent service...what more could I ask for??I took a chance and went back after learning they had new owners. I have been back several times since then and have had a hard time getting in there on so many occasions because the word is out! McCloskey's is one of the best places in Ardmore.  My suggestion would be to go on the off day/times--late Monday evenings after 8pm usually will allow you to get a table. The waitstaff is wonderful and the owners actually thank you for your business! Well done, McCloskey's!", "stars": 5, "date": "2012-03-18T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I live in Ardmore, and McCloskey's isn't perfect, but it's definitely a gem. Food, 5 stars, Beer list, 4 stars, Service, 4 stars, atmosphere, 3 stars. It can be tough to get a table, and sometimes you get a cramped/crowded one. I prefer to go on off nights, or after 9 PM to beat the crowd. Burgers/Chicken sandwiches (they have ~8 or so topping options that can be made with beef, chicken, or as a veggie burger) are all always awesome, apple/Jameson wings are bomb, and their entrees are really really good. I was pretty surprised at how good their pasta and seafood dishes are. Not the fanciest, but some of the best food on the Main Line. My only complaint is that they need to fix their JukeBox and could use a couple more TVs or at least a TV upgrade. Great place, overall, though.", "stars": 4, "date": "2015-06-02T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I LOVE McCLOSKEY's! Great for dinner, drinks, quizzo and karaoke! My husband and my friends and I are regulars at this establishment. The staff is very friendly, the atmosphere is great, and the food is really something else. They have a Thanksgiving sandwich that my husband loves and though I want to try everything, I often go for the wings because they're some of the best I've ever had.They also have a great beer selection that's always changing. Thursday night karaoke with Lars is a blast. And Saturday night quizzo with Ed is super fun- probably my favorite in the area, and we go to a lot of different quizzo venues around here.If you can find a seat, give this place a try. I doubt you'll be disappointed.", "stars": 5, "date": "2012-05-18T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "The beer selection is a 4, while the food is probably 2 1/2. Decent little place to grab lunch or dinner just off the main strip of Ardmore. The food is below average pub grub with my chicken California sandwich rather tasteless, while the husband's chicken Parmesan sandwich had good sauce but smothered with so much cheese you couldn't see anything else. Fries were cooked decently but with no seasoning. I'd be happy to meet up with friends there for a beer before heading to a different restaurant but the bar area is also fairly small.  Wasn't too loud, and service was a little spotty, but friendly.", "stars": 3, "date": "2013-03-04T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "We ended up in McCloskey's as we took the scenic route to Valley Forge. Have to admit, I wanted to drive by Merion - it's as close to playing it as I'm ever gonna get, right! It was a cold, drizzly October day and could not have ended up in a better spot. Good beer, GREAT shepherd pie and service to boot.", "stars": 5, "date": "2014-10-14T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "We love coming here. The burgers are great, the beer selection is huge and the service is always good! It's worth a stop over here! Hope you get the seats by the window...they are the best!", "stars": 5, "date": "2014-08-10T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "McCloskey's has a nice local pub feel to it. The tables are candlelit, there's a bar that runs half the length of the pub, and a chalkboard with all of the beers on tap listed. They have a great beer selection. Plenty of good craft beers on tap including beers from Great Lakes, Chimay, Bear Republic, and Breckenridge.The appetizers are pretty good - I usually get the crab balls. The sandwiches are good and the fish and chips are great. Overall, the food is good, I just wish they had a bit more of a selection in terms of entrees. Then again, the beer selection makes up for that. They also serve glasses of clean ice water which is a plus.The place is always busy, and the service has always been excellent. The best pub I know of in this area.", "stars": 4, "date": "2012-07-14T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "The more I eat out on the Mainline the more my expectations wane.  This place is a good example.  it gets 4 stars on Yelp yet the food is mass produced, frozen blandness.  I had a burger which was a frozen patty slapped between a store bought bun.  It was edible but it's not four stars.  Not even close.  The fries were frozen as well. Are the palates on the mainline so starved for good food that folks have forgotten what good tastes like?", "stars": 2, "date": "2016-03-01T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "their burgers are intense! perfectly cooked, super juicy & just overloaded with toppings. I also really liked the apple Jameson wings. they give you a huge portion too! only downside is the fries.. they were lackluster at best.", "stars": 4, "date": "2015-03-31T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Good food, good service, good prices, generous portions.  Been there several times.  A little crowded at times but still worth it.", "stars": 4, "date": "2015-12-11T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Excellent food. Nice size (sharable) portions. Great burger selection and execution! Very friendly service folks. Really like this place and stands out from so many similar places in the immediate area.", "stars": 4, "date": "2014-12-23T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Met my girlfriend last night for dinner.  She had the Thanksgiving sandwich and I had the Roast Beef.  Best god damn Roast Beef sandwich I've ever had.  She said that her sandwich was awesome as well.  Love the rotating beer/draft menu! Paddy the bartender makes a mean cosmo.  Go early and hungry because this place fills up.", "stars": 5, "date": "2013-11-16T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Pretty decent bar. I would say a little more on the expensive side as well as pretty cramped.", "stars": 4, "date": "2016-01-13T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Solid burgers, roast beef, and motz stix.  A good pub to have in your rotation", "stars": 4, "date": "2015-01-01T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Oh McCloskey's...how I love thee. The food is absolutely delicious. The wings (either the buffalo or the apple Jameson) are excellent and the burgers are always top notch. The beer selection is good (not great) but they have a generous pour for their drinks which I appreciate as a mixed drink girl.  We're regulars on Saturday night for trivia and love the atmosphere. During the day it might be a hangout for the older crowd, but late night belongs to the college crowd. The servers are great, bartenders are always attentive and personable. You can feel its family owned and you feel like family when you're there. Just a great place to get food, have a drink, or meet up with friends. We love it!", "stars": 4, "date": "2012-06-22T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I've eaten at McCloskys a few times, with good food and great service. Tonight, the whole experience was BAD. I ordered a roast beef sandwich. It came to the table cold, dried out,, super well done old roast beef, with cold fries, unmelted rubbery cheese. I told my server, who literally took the plate and came back one minute later, obviously and unapologetically having popped it in the microwave for sixty seconds. Everything still cold, but drier. Wow! My sister ordered a burger medium well with blue cheese. It was welll well well well done. Seriously overcooked. Disgusting amount of blue cheese. Bacon that was more like beef jerkey. Horrible. cold, stale fries as well. We told our server, who said she would let \"them\" know, and came back with our check. No apology, nothing! Asked for a manager, who gave us his cell phone number and told us to call him next time we were coming in!(?). I think he was the food runner. Don't know what happened to the great servers and great food, but this was all around terrible.", "stars": 1, "date": "2015-05-15T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I was lucky enough to fall into this wonderful establishment some months back. They have by far the cutest bartender of all time. I believe his name was Patty or Patrick or something like that. He was so adorable that I would like to have him sleep on the end of my bed like a small puppy. If you are looking for a place that serves a mean chicken pot pie, look no further than McCloskey's on Cricket.", "stars": 5, "date": "2011-01-24T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This is my neighborhood go-to place.... always great food and friendly service. Lunches are wonderful and they make absolutely the BEST BLT sandwich ever~!!!! Ardmore ROCKS~!!!Nancy Gold", "stars": 5, "date": "2014-07-03T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "We have been looking for a spot to grab brunch on a weekend in the Ardmore area for a while, and we're rather partial to a Veggie Burger.Unfortunately this has gone from the menu, but there is a Portabella Mushroom burger, and a roast veggie sandwich, that did the trick.There is a great selection of craft beers, both on tap and by the bottle. Racer 5 IPA, on tap... yum.My only criticism of the food was that they went a bit heavy on the cream cheese in both dishes. The french fries however, were sublime.At 4pm on a Saturday it was fairly quiet, but I'm guessing that it gets pretty lively as the evening progresses.", "stars": 4, "date": "2013-12-22T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Went here for the first time tonight (9/5/13). Service and food were both excellent.  I had the shepherds pie and a salad and my wife had soup and Pancko breaded tomatoes everything was awesome. It's a bar/ restaurant where everyone feels very comfortable,young and old. Give it a shot you won't be disappointed.  The waitress told us that Tuesday is wing night (.25 cents wings and they looked good ). See you on Tuesday for sure.", "stars": 5, "date": "2013-09-05T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I live very close and seem to always be ordering take-out. My favorites are the shrimp salad, the chicken parm entree and the chicken parm sandwich. The Italian sandwich is good too! There is a great beer selection and the staff is very friendly. Plus, there is live music and karoke during the week.", "stars": 4, "date": "2013-04-23T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Great bar with lots of personality and excellent food. Probably the best burger on the Main Line, excellent wings and great beer. Friendly staff. It does get crowded around dinner...", "stars": 5, "date": "2015-07-28T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "McCloskey's......ahhh....what a place. The Sauce is always flowing and the clientele is the tops. I pop in from time to time for a cold one and perhaps some laughs. The Cajun Chicken Fingers are fab and the guinness is a great pint! I thought the service was well above average when I have been there. Martha, perhaps you were there on an off night?", "stars": 5, "date": "2010-01-27T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Packed on a friday night with a hungry and thirsty Irish crowd (kidding but it was full for a reason)Mostly a middle aged crowd (including myself in that category). Typical beers, burgers, wings menu with an upscale touch. (apple Jamison chicken wings for example)They have a set of combo toppings (blue cheese, swiss and mushrooms, etc) that you can get on a burger or grilled chicken sandwich. Prices are low for the size of the sandwich including huge amounts of toppings.this is my  favorite kind of place, good American pub food, big portions, reasonable prices, friendly staff and we will be back.", "stars": 4, "date": "2013-08-07T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Decent food great drink! What's on tap will never disappoint. The mussels are a must try! Heading into winter they'll bring out the beef stew in a bread bowl. It is the vision of homemade comfort food. Some nights they have live music or a DJ - not a great idea for such a small place. It usually clears half the bar.", "stars": 3, "date": "2011-03-20T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I have been coming to McCloskey's for years and it is by far 1 of my favorite \"go to\" spots! The staff are friendly and welcoming! The dining room and bar areas are comfortable. It's a great place for a dinner out with friends and there are plenty of tvs to watch a game. If there is a wait for a table or if the bar is crowded, there is a nice patio out back. The draft selection is great with rotating craft and seasonal beers. The food is amazing!  House made soups and salad dressings,  delicious sandwiches and burgers, weekly specials, and awesome desserts. The Apple Jamison chicken wings are a must try! Several nights per week they have live music and entertainment. I would recommend McCloskey's to anyone looking for a great meal in a casual and fun environment!", "stars": 5, "date": "2014-09-14T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "After having the worst experience of our lives at Jack McShea's, my friends and I headed over to McCloskey's to get a drink. We were greeted by a very friendly staff and immediately felt comfortable there. The bartender made certain I had the right amount of whiskey in my drink. We sat out back and enjoyed the nice evening.", "stars": 4, "date": "2015-07-13T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "So damn good! Great food. Reasonable prices. Awesome staff! Went just last night and had another amazing meal. I got the Chicken Parm with garlic sauce for my noodles. Yummmmmmmm", "stars": 5, "date": "2015-04-18T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I've eaten in and done take out many times. I've enjoyed everything I've ordered. I'd classify the food as elevated pub food. I'd recommend if you're looking for a relaxed atmosphere and good food.", "stars": 5, "date": "2012-03-16T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This place is awesome.  I ordered mozzarrella sticks wiith a cheddar bacon burger.  The mozzarella sticks seemed like they were homemade, they were awesome.  The burger practically melted in my mouth, great roll too.  I was fortunate enough to try the entrees of those who were with me as well- crabcakes (real good) and the shepherd's pie (also great).  I can see myself trying both of those in the future.  I wouldn't be surprised if everything on the menu was good here.  I also liked that they had a few strategically placed TVs with sports on.  Place had a nice sized bar and a good beer selection as well.", "stars": 5, "date": "2015-01-29T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Went to dinner last night. Full house. We all got sandwiches with fries. The waitress was very nice and pleasant. The food was pretty horrible. My husband had chicken Parmesan sandwich. The roll was stale, the chicken tasted pre-processed. I had the turkey sandwich; very mediocre. Our third had a burger. It was over cooked.We will not be returning. We've been there before and have been very pleased. Not sure what has happened.", "stars": 1, "date": "2012-07-20T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Oh boy, such a bummer. My husband and I live in a nearby town and had read some decent reviews of this place, so we decided to try it. We went on a Friday night at 8:30, hoping for a nice place to end the week with a good beer and decent dinner.  We couldn't have been more off the mark.  When we entered the place, we saw an empty booth by the front window and motioned to the hostess that we would like to sit there.  She came towards us with a nasty look on her face and said, \" nope.  I need to save that in case I get a larger group\". We pointed out that she had four open tables and that it was late at night.  She refused to honor our request and was not very kind about it.  We were seated at a small table that was about 4 inches away from the next table.  Ugh. The place was very loud and it was more than a little uncomfortable.  We were greeted?? By a waitress who simply asked us, \" what do you want\". We really were considering getting up and leaving but decided to stay. Mistake. The food was average at best and the service was horrendous. My husband did end up heading to the back of the house to talk to the manager and let him know how disappointed we were.  He could have cared less. Oh, and the booth we requested... Was filled in ten minutes, with  TWO  customers, who were obviously very friendly with the hostess As for us, we will never be back.", "stars": 1, "date": "2013-11-09T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "As good as it gets for neighborhood pubs on the main line.  Some seriously good burgers.  Wings are also very good.  Can't go wrong with any of the daily specials and the chicken parm is also fabulous. Good beer selection, friendly service.  Highly recommend.", "stars": 5, "date": "2013-03-08T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This place has the best lunch combos. Best value in the area for lunch with a friendly staff and great food. I'm a regular at McCloskey's and could not be happier with the service. I've never been anywhere else where I see repeat customers like myself on a daily basis.", "stars": 5, "date": "2015-02-05T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Always a great atmosphere, the food is top notch and the beer selection is great.  Should be 4.5 stars, but sometimes the service is inconsistent.  When it gets really busy it is easy to tell the bartenders just want you to eat then leave. Great Ardmore bar!", "stars": 4, "date": "2013-12-10T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "This is a classic bar. If you are looking for a something between a dive and a classy pub, drop in for a pint. This type of bar is a dying breed.", "stars": 4, "date": "2011-10-31T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I think some on here may have an agenda other than an honest review. I have been a regular every Friday night at McCloskey's for over six months. From day one both the service and food have been great. I have taken my kids and their families and they liked it very much as well. I just about always order the prime rib special, and it is *always* prepared properly. One reviewer complained it had too much fat on it. Of course it has fat on it . . it is prime rib. I have also had their burgers, which are right up there with the best around . . no kidding, they really are !!I have never had a bad meal at McCloskey's. Does it get crowded? Yes.  The reason being it is a good place. Is it noisy at times? Yes, but it is a bar/restaurant. That's to be expected at a popular spot.I only mentioned a couple of entrées. I have had the salmon as well . . . very tasty. But sitting at the bar I see a lot of food coming from the kitchen, and it all always looks delicious. Also, my kids have had the roast beef sandwich, crab cakes and baked salmon . . all delicious.It does get crowded, so go early.Give McCloskey's a try. You'll be glad you didPS - One dish I did not care for was the fish 'n chips. But, to each their own. Maybe you will like it.", "stars": 4, "date": "2013-11-16T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Went all the way to the 'burbs because my buddy from work claims McCloskey's has the \"best bacon bleu burger... ever.\" The burger WAS good. There wasn't a bite without bleu and the burger was cooked to perfection. My only complaint was that the bun was lacking. It kinda gave the whole burger a \"i'm not trying but you know i'm good\" kinda look. The burger was also a little too greasy. I would suggest a heartier bun and maybe then it would truly be the \"best burger... ever\". Also the fries were just ok, could have been better. All in all I was satisfied.", "stars": 4, "date": "2011-03-07T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I kindda agree both with Martha and G.T.Don't go here to have a great time....personally, I've been here bunch of times only b'coz I have to go with folks from work (which is less than 25 meters away).As a local resident, it's a good place for a drink but if you are looking to have a good time...I doubt it! If at all you end up here, just try the Crab Cakes (Appetizer)....they are good!Martha....I agree that the service and attitude of servers needs to improve significantly. However, the one lady who served us couple of times was great!", "stars": 3, "date": "2008-08-25T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Best burgers on the main line for a neighborhood joint! We love the draft list as well. One of our favorite regular spots with friendly bartenders and wait staff. Knocking off one point because the claustrophobic atmosphere can be trying at times.", "stars": 4, "date": "2014-02-21T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I work nearby and eat lunch here about every other Friday. Great bar food and the wings are really good. The beer selection is extensive and the wait staff is top notch.", "stars": 4, "date": "2014-01-22T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Have been in here a handful of times and each time has been a great experience. The staff is always friendly and they have a fantastic selection of beers. Most of the bartenders make good drinks, though had a poorly made one or two. They make great food - burgers, appetizers, fish and chips, chicken sandwiches... all fantastic. Portions are large which makes it great for me and my fiance since we enjoy splitting plates. Definitely will be making many more trips to McCloskey's!", "stars": 4, "date": "2013-04-28T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "We come here for quick dinners and usually stick with burgers/wings, although my wife loves their meatball sandwiches (without the bread). The staff is super nice and it is a very pleasant, comfortable place.", "stars": 4, "date": "2012-11-28T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Had a great seat at the window and open window at that...on a nice September Saturday.  Roast beef sandwich is typical at Irish pubs...this one was good could've had a bigger/wider vessel for the au jus.  It was one of those plastic sample cups...so I just doused my s/wich with it.  Friend had \"thanksgiving\" sandwich and said it was delish.  The waitress talked us into dessert said they were homemade not \"distributor\" (i.e. frozen then thawed) brand.  Glad she did...cheesecake was fab...will return soon for the p-butter pie based on other review :)", "stars": 4, "date": "2012-09-28T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Have eaten lunch and dinner, as well as stopped by for a glass in the evening around 50 times over the years. Every meal I've ever eaten here has been great. Mushroom soup. Cajun Chicken fingers. Meat Loaf. Meatball sandwich. I've only had great servers. Every friend I've ever brought here loved it.", "stars": 4, "date": "2011-03-16T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Terrific little spot just off of Lancaster Ave. in Ardmore. Food was great. I used my \"How Well Do They Do A Normal Burger?\" test and they passed with flying colors. I love those shiny and soft burger rolls (wish I knew the name). Fries were thick cut and seasoned perfectly. Ample bottle and tap beer selection. Service was excellent. Well done, McCloskey's.", "stars": 4, "date": "2012-04-30T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I had pretty low expectations for this place but it turned out to be quite good! Of course, there weren't many items on the menu that appealed to me but I actually ended up ordering the spaghetti and meatballs, which were quite good! The spaghetti tasted very homemade and fresh, the sauce was very flavorful and a bit sweet, not salty or oily, and the meatballs were cooked well, tender on the inside and very flavorful, except were overly salty. This dish was huge so I actually got two dinners out of it and lots of extra pasta/sauce. Only thing I wish it had come with was a side salad to balance the meal out. I was there on a Saturday night and it was super packed but we were able to get a table for 2 in just a few minutes which was nice and although it was pretty loud, I could hear myself speak and didn't feel like the noise was too overpowering that it prohibited conversation. I would give this 3 1/2 stars.", "stars": 3, "date": "2014-04-28T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "Came to McCloskey's a few times, and was happy every time! Usually just got regular bar food or shepherd's pie, but this week we both ordered one of the specials, some kind of pasta with chicken, asparagus and peppers! It was AMAZING, and the portion was huge! Reasonably priced, GREAT staff, and overall a great experience!", "stars": 5, "date": "2013-02-08T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "McCloskey's is a place where you're free to let your inhibitions run wild.  They don't cast judgment for walking in their doors before your  9:00 AM shift starts for a quick drink to wet  yer whistle...they'll happily pour you a shot of their fine Irish rye knowing your about to protect the neighborhood they call home.  Its a quiet place to slip in for a quick pint or two before heading home to deal with the headache that I affectionetly refer to as my wife and kids.  Its also a quaint spot to spend sometime away from the nagging of your wife after she goes off tedious little things like paying the bills, her mom, the delinquent kids that live in and around Havertown and all that other stuff women yap on and on about.  Its also a safe spot where you know at the end of a long night they'll be sure to call you a cab after 2AM and send you on your merry way.  Just don't ever order the soup at McCloskey's.   Never.  Seriously, I mean it....don't ever order the soup.  Even if you're on the verge of starvation just order a pint of Guinness and eat your napkin or coaster or something else instead.  McCloskeys!!!!!!!!!!!", "stars": 3, "date": "2010-01-28T00:00:00.000", "venue": "McCloskeys Tavern"}
{"review": "I've been going to McCloskey's for years and always enjoyed the food and the service. The manager and staff are always friendly but John the bartender could be a little rude at times but most of the time he  was always nice. He is no longer there but the staff is still friendly. The bar is great and you can always strike up a good conversation. I recommend go to McCloskey's when in Ardmore.", "stars": 4, "date": "2009-12-11T00:00:00.000", "venue": "McCloskeys Tavern"}
