{"date": "2019-02-21T00:00:00.000", "review": "I'm going to go 5 stars here simply because of the lunch specials they offer.  Very distinct and affordable.  The panang Duck was about $11 and adding a soup/spring roll was just a couple of bucks more at lunch.  Great value.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2019-04-15T00:00:00.000", "review": "Meh...I don't do much here besides Teriyaki, not a sushi or seafood person.  I haven't ordered in a while and had some last night, it was pretty disappointing.    First off, I was told my order would be ready in 30 minutes.  I assumed they were slammed, but still got there in 20 minutes as I didn't want my food sitting around.  Sure enough, my food was waiting and would have sat another 10 minutes had I not left early.  And the restaurant was empty, just a couple tables taken.  Off to a pretty bad start...  Secondly, it is expensive.  For 15$, you get rice, a chicken breast and a handful of greenbeans.   Maybe I should have ordered off the lunch menu which includes soup, salad and California roll for 12.50.  Not sure what the deal is on the dinner menu, or why you can't make a platter for chicken teriyaki dinner, but it seemed like quite a rip off compared to the lunch offering.  I ordered the mixed green salad for another 6 bucks to round out the meal.  Nice size, but wow, the ginger dressing was junk!  Runny like a vinaigrette, no texture to it...good ginger dressing is thicker, like it was made out of a bunch of delicious fruits and vegetables.  I wondered if I got the wrong dressing at first, but it did have a gingery taste.   The chicken wasn't hot and barely had any sauce on it...I like to dump my rice in there and let it soak up some teriyaki, but there was barely enough for the chicken.I basically paid 25 bucks for a salad, chicken breast, rice, and some green beans, it was very expensive, and very disappointing.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2019-04-14T00:00:00.000", "review": "On another visit to the Philly area we decided to take in a new spot.  Thai Pepper is a combined restaurant with Kikado a Japanese sushi house.  Honestly, I don't know what to take of the place so I am going to break it out. 1) Food presentation was 5 star.  A phaelenopsis orchid bloom adorned my shrimp pad thai entree.  It was the most perfect bloom that I wanted to rake off my plate to place in my hair.  I realized that was probably not a good thing to do in the restaurant. 2) the menu was large and covered Asian cuisine.   We had the Chinese-American dishes to Pike bowls to sushi to pad thai.  3)  the atmosphere is very nice.  Nicely decorated and not too loud even when crowded. However, the fountain at the front door didn't work, but was very pretty.4)  the service was OK.  It seemed as though they only had a few servers, and given the fact that the place was pretty large they could have used a few extra hands.  I had to ask for water a few times because my glass would oftentimes go empty. 5)  the food was tasty and well prepared.I would give this place a go again.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2019-04-10T00:00:00.000", "review": "Food was awful! We ordered the appetizer platter and beef pad Thai. This is by far my worst Thai food experience ever.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-11-12T00:00:00.000", "review": "I frequently Mikado and it's usually very solid. Tonight, that was the case. Today, I came in to get some sushi with a couple of friends of mine. The waitress, Ashley came over quickly and took our order. I decided to try the cold Thai tea. While it took a little while for the drink to come out, it was pretty good when it came out. It was fairly creamy, but also had a nice tea flavor.The actual food itself here is very good and I am actually a bit surprised to see all the negative comments regarding the food. I started off with the calamari salad, which was great! The lettuce and vegetable toppings including cucumbers, tomatoes and shredded carrots were all great and the ginger dressing was superb. While the pieces of calamari I got was great, there were only a few and the rest were just small fried pieces. When it comes to sushi, they gave a large variety and they were very good. Tonight, I had the Philadelphia and California rolls. The rice is good and the insides are of very good quality. The salmon and cream cheese were especially great! I also had the chicken teriyaki! It was beautifully played with a flower on top, it was very nice. The teriyaki was also great as the chicken was tender and moist while the teriyaki sauce took it to a whole new level. The side of green brand was also nice. It was so big, I had to bring most of it home!My only concern was that it took a while for our drinks to come. However, once I had my appetizer I felt a bit rushed when the entrees came out very fast. Also, Mikado has nice seating options including some tatami tables!Also, get the great mints they have here when leaving. Altogether, Mikado is very solid restaurant with nice ambiance and delicious food!", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-12-29T00:00:00.000", "review": "Oh Thai Pepper, how I have missed thee! Haven't been here for awhile since I moved south but came back for a visit and had to come here. The interior of this restaurant is really well done. It's very pretty and elegant and would make for a good place to take a date. Service is great here tooThis is a half Japanese/half Thai restaurant do you can order either or both! I have never had the Japanese so can't comment on that. My go to here is the green curry with chicken but I have also had the Kai Himmaparn, the pineapple fried rice, and last night I had the spicy chicken noodle (also called drunken noodle in other places). Both the spicy chicken noodle and the green curry are very spicy but in a good way. Everything I have had here is excellent and I have no complaints. I honestly think you could order anything on the menu and it will be top notch. Parking here is not the greatest since it's right on Lancaster Avenue but you will find a spot since it is more than worth it. They also have takeout if you want to order ahead and just get it to go.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2019-03-29T00:00:00.000", "review": "This place is toxic as far as the staff and manager.Went their with my wife and grandaughter. The waitress was not friendly and we ordered soup sushi and my wife ordered tempura. She said could she have it without chickenjust shrimp. The waitress brought the tempura and we expectedvegetables etc as we always have had with tempura. It was a communication problem. The waitress grabbed the menu and keptpointing to the menu saying that is what we ordered nastly.I apologized and said we have eaten in asia and many restaurantswhere a tempura ordered was filled with vegetables. Her attitude make me ask for the  manager to stop this fighting. He came (bubba) and said to me I dont want to hear anything elseI dont have the time to talk to you. We lived in this neighborhood for 20 years now in FL. We were their all the time even 2 of the sushichefs recognized me when we entered. The behavior of outrageouslike a mental institution. Didn't leave right away my 11 year-old-granddaughter was with us. I thought people should know this story.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-08-16T00:00:00.000", "review": "Spot on super delicious sushi! BIG pieces of sashimi! We go a few times a year. I like to go for my birthday and get the $59.50 sushi boat. It's loaded, enough for 3 people, but we share it between 2 people. The fish in the sushi rolls are generally larger pieces than what we see at other places. The salmon sashimi is a very smooth texture. I've had salmon that gets stringy where the colors alternate, like the silver is still affecting the texture. That is not the case for Mikado Thai Pepper, high quality. We know they have a bunch of food other than sushi, but we always go for the sushi. It's the best on the main line in my opinion. There are some places I don't like the tuna, but I think they buy a nice cut of tuna. We've been going there for about 3 years and the quality is consistent, the service is perfect, and they have alcohol which is convenient.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2019-02-01T00:00:00.000", "review": "This used to be one of my favorite restaurants when they have the location in Wayne. It's still a wonderful place to get a meal it's just a smaller location", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2019-03-24T00:00:00.000", "review": "This is place is unbelievable!!! The food is amazing and the atmosphere is amazing as well. The servers here are friendly and the food comes quick and the wait is not that long. I personally love the spicy noodle chicken dish.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-12-07T00:00:00.000", "review": "No. Just. No. I came here to meet with my sister for lunch. She was raving about how authentic the environment was. Yes, it felt like a japanese tea garden but what about the food? Our waitress was sweet and accomodating but once I received my miso soup, I lost ALL of my appetite. Because in my soup there was a COCKROACH floating in my bowl. I alerted my waitress and they only gave me 4 dollars off of my check. ARE YOU FREAKING KIDDING ME. Your gross af kitchen served me a soup with a bug in it and you only give me FOUR dollars off? I am sorry, but that was the FIRST AND LAST time I will EVER go into this establishment. I am severely disappointed with how they handled things. TLDR: COCKROACH IN BOWL, ONLY FOUR DOLLARS OFF MY CHECK.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-10-18T00:00:00.000", "review": "I ordered ahead bc I had a tight timeline to keep. Food was ready when I arrived. Tried to charge me more than they were supposed to for the food I ordered. Finally corrected the price, I pay cash and go to take my bag of food and the woman took food out of the bag. She mumbled that they made the wrong food and went into the kitchen. It would have been nice to know before I paid for the bag. She came out six minutes later with replacement items.  After I left and was enroute to work I noticed that there were no utensils or napkin provided. I called back and spoke to Sasi the manager who insisted on interrupting my every sentence even when I asked her twice to stop. They don't give out utensils according to her. Also she said that the incorrect food was my fault for not communicating well enough. ('Entree x with a combo of soup y and app z' was not clear enough to specify a combo.) when I mentioned that I had already paid for the bag of food when she began removing items from my bag Sasi insisted that it wasn't my bag even though it was presented to me at the cash register and I paid for it. Several times while we were on the phone she ignored me to speak with other employees in the background. There was no apology whatsoever or acknowledgement of any mistake on their part. No offer even of utensils. I'd include a food review but I have no utensils with which to eat.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-11-29T00:00:00.000", "review": "The food there was sub par. The chicken teriyaki felt like a microwaved chicken, the sushi that my school sells tasted better then there rolls. The service was not great as well. And to top it all off they are very overpriced. Would NOT recommend!", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2019-01-02T00:00:00.000", "review": "Unless you like the idea of having your credit card stolen, stay away from this place. We've been eating here for over two decades and always enjoyed it, but never again. After a so-so meal with lackluster service on New Year's Eve, our server brought over the bill. My husband placed his credit card inside the billfold and handed it to our server. She came back a few minutes later with the bill and billfold but no card, saying there was no card inside. We told her the card had indeed been inside. She shrugged and laughed. We started searching the floor and told her to please find our card. She offered no apology and seemed to think it was a joke. The rest of the staff had the same attitude, and said we should check our pockets. Even though we knew we didn't have it, we did just that, to prove we'd handed it to the server. The host and manager came over, and rather than express any concern or offer any apology, they accused us of lying and called the police on us!  Our credit card was never found. Either our server or another staff member pocketed it - the only other possibility is the server dropped it and a customer picked it up, but that customer would have had to be extremely quick. We're absolutely shocked that the restaurant took no responsibility for losing our card, thought it was a big joke, and accused us of trying to skip out on the bill.  This place used to be wonderful; now it's a nightmare. Avoid at all costs!Update: we reached out to the restaurant's parent company, WIN Signature Restaurants. Their director of development responded to my email by saying she was absolutely appalled by what had happened, and acknowledging the entire situation should have been handled much differently. While this doesn't change what happened, it was the right response. As long as Mikado Thai Pepper remains under its current management we won't go back, but it's good to know WIN is aware of what happened. We will visit their other restaurants if the opportunity arises.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-09-05T00:00:00.000", "review": "Stopped in for dinner on a Wednesday and the place was empty. As soon as we walked in it smelled like an old person's home (mothballs). We ordered a few rolls to share, but the only one I liked was the Ardmore roll. The rolls had a lot of rice and the fish didn't taste very fresh. Our waitress was very nice and attentive though! I would not recommend this place and we won't be returning.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-07-13T00:00:00.000", "review": "Went all in and got a boat! For the amount of food my dining partner and I typically eat the boat was a great choice to share. I like the fact that the chef chooses the sushi this way I can always try something new. The chef was very friendly and came over and explained each piece to us. All the sushi was very fresh and tasted excellent. Service was also very friendly. I made a reservation on a weekend night and was seated promptly. Typical prices you would expect for the Ardmore area. That's why we went with the boat so we didn't risk going crazy and order a ton of food. Would definitely recommend and I would dine here again.  FYI there is a parking lot across the way and is free after 6 pm.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2019-02-14T00:00:00.000", "review": "This was a miserable experience. Not only incompetent, but rude staff. We ordered three dishes and the waitress got confused with each order. When we finally got our food (45 mins later), one of the dishes didn't seem to come out right, but it was close enough to what we ordered so we didn't question it. After we were finished eating, our waitress came by and presented the dish as \"deluxe sushi platter\" which was the name of the dish we ordered. Since it clearly did not match what we had just eaten, this surprised us. It turns out she had given us the wrong dish, despite having initially told us it was the sushi platter. She tried to persuade us to eat the new dish because we had ordered it, obviously we declined because we had eaten our meal. They ended up charging us for the meal and the original dish even though it was wrong. We spoke to the manager because we wanted some sort of explanation as to why the order had been so botched, but his response was, \"you ate the food right? So you have to pay for it.\" After approaching him, he defensively backed away and yelled \"don't touch me!\" as if we were going to harm him. While the waitress apologized and was clearly having a rough night, the manager's behavior was beyond unprofessional. No apology, or refund. Definitely a bummer on Valentine's Day.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-12-31T00:00:00.000", "review": "Rice was super overcooked on sushi rolls.  Extremely hard.  Came during lunch last week.  That is all.  Need to fix!", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-10-24T00:00:00.000", "review": "Very bad service. The waiter Bobbi is not attentive, rude, and speaks in a foreign language most of the time when taking our orders. He asked us to show him ID when we ordered alcohol, and questioned the legitimacy of our drivers licenses(we are young professionals living in Haverford). Throughout the dining experience, we felt the unspoken passive aggressiveness from Bobbi the whole time.We had to ask for more water three times before he finally came over to fill our glasses. Despite the horrible service we received, the food was good.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-06-19T00:00:00.000", "review": "This restaurant is one of my friend's favorites so recently I visited with her. Our waitress was very nice and she offered her recommendations to us. The food was good and the service was quick, however I feel the taste just lacks a little compared to other restaurants in the area.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-03-09T00:00:00.000", "review": "I have eaten here before on occasion and it wasn't bad, not great, but not bad. Tonight however it was atrocious.  They served us unfiltered tap water. The food took forever to come out but was served cold. The food tasted like bland two day old fold that had been reheated repeatedly. I asked for 4 star spicy food and it had no spice at all. Even the chili's supplied on the side had no taste.  Instead of using Thai chili's they seem to have provided chili flakes. And to top it all off, one person waited 20 minutes for his dish after the rest of the table was served.  I will never come here again.We left several dishes barely touched and informed the server of the issues with the food but they did not remove it from the bill.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-11-12T00:00:00.000", "review": "Came here with the wife and grandkids tonight for dinner.  Really a five star experience. Everyone had something different and we enjoyed them all.  Little Ivan was really hungry and thirsty.  He got an orange juice and Thai tea, both at the same time.  He also got assorted sushi.  Ace wouldn't stop eating - he had an assortment of Sushi pieces.  My wife ordered a boat of sushi and gave a lot of it to Ace and didn't offer any to me - she likes Ace better!  I had the Teriyaki salmon with green beans - tres bon!  I also had the Ardmore roll, which was excellent!  Little Gloria ordered pad thai  - but she didn't eat much and took it home - although she said it was very good.  Also had a variety of appetizers - all great!  Ivan had green ice cream - he said it was scrumptious!  My wife was upset with Ivan for ordering two drinks at once - she can be frugal at times, although my wife's father spoiled her to death - he bought her new cars, paid 100% for her to go to Harvard, sent her on a honeymoon to Asia and an African Safari, bought her a condo and beach house, etc! Personally, I'd rather give than receive. Can't go wrong coming here. Our server, Ashley, while not Japanese, was excellent!  I am all about equal opportunity so, of course, would never think the the server should be Japanese.  Equal opportunity for all! That's what I say, and think, of course.  My wife totally agrees with me on this, and she almost never agrees with me on anything.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-02-04T00:00:00.000", "review": "Really frustrating night. Food was average. Dined here on 2-3-08. We had a reservation for 7pm and were seated promptly (party of 2). Our server did not visit our table for 15-20 minutes, and it was a full 30 before we received our drinks. The rest of the evening was a disorganized mess. I was literally waving my arms to attract the attention of the manager, who put in a 2nd drink order for us after another full 30 minutes before our appetizers arrived. We had to ask the server to clear dirty plates. We should have left.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-10-16T00:00:00.000", "review": "The food here is real good.  I been here a couple of times and feel in love with their Sushi and Chicken Fried Rice.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-02-02T00:00:00.000", "review": "Very disappointed. While most of the food was good, the hot food was served cold and the sushi came about 25 minutes later. The waitress didn't come back to check on us. Service was terrible. Then they added a 20% gratuity. Unbelievable.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-05-16T00:00:00.000", "review": "so far so good! Me and my family love this place. We haven't had Thai food for so long and this  is just right to it! the food and atmostphere is really nice. we will coming back!", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-05-02T00:00:00.000", "review": "Best short rib on the main line or the city. Delightful vegetable tempura. I also realy2enjiy the teriyaki dishes. This has been my family go to spot for about  5 years or so. They are extremely consistent. Only negative is the Desserts need some refinements and the wings are often soggy.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-03-05T00:00:00.000", "review": "Good tasting Thai food that'a made quickly. Prices are reasonable and the location is easy to find on Lancaster Ave.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-12-08T00:00:00.000", "review": "Actually, I don't know why I even gave this place two stars. The people were nice and the service was prompt and courteous. But the food. I only ordered Tom Yum soup and shrimp pad Thai, we vegetables, spicy, with no peanuts. The soup was pretty decent until I found a hair in it (like, a long, straight, black strand of hair; may have even been a bang stand). So that killed the mood initially. The pad Thai was bland af. It was just tasteless and not spicy at all. It literally tasted like absolutely nothing. So. Loss for me.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-05-13T00:00:00.000", "review": "The food is good however I cannot speak for the service. They don't answer the phone or they put you on hold forever. Had to come in and order in person instead. The restaurant wasn't even busy... I order and the server says 20 minutes.. well here I am sitting for over 40 minutes now and had to write this review. I hope they higher a more competent person that is more organized.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-12-07T00:00:00.000", "review": "I say this with a heavy heart: Mikado is depressingly average. Rather than focusing on one cuisine, it aims to offer a fusion experience, and falls flat.I have been here three times with similar results. I have sampled the sushi (Godzilla & Golden Crunch) and, although it is tasty, it simply does not have the same flair as one or two other spots on the Main Line. The same goes for the Thai dishes--I tried the Pineapple Fried Rice and it was nothing special.I would also like to add that it is not at all vegetarian-friendly. While I am not vegetarian myself, I came once with a girlfriend who is and she was limited to two or three dishes that are not prepared with some kind of chicken or beef broth. That seemed a little absurd to me.For the prices they list, you're better off going elsewhere for good sushi or Thai. The restaurant itself is gorgeous, and offers some very unique seating built into the floor, but it's simply not worth it.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-01-27T00:00:00.000", "review": "Mikado isn't too bad. I came here twice in a short period of time.  The first time I came, I went with Thai and got Pad Thai.  I thought it was too sweet with forced flavors. The second time I came, I got a sushi/sashimi platter and I thought it was good. Next time, i'd definitely go with Japanese.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-10-28T00:00:00.000", "review": "Everyone warned me that this place is great for sushi but the Thai food gets less stellar reviews and I really wanted to prove them wrong. I ordered the Pad Thai lunch special with a soup and spring roll. On the plus side, the lemongrass chicken soup had nice chunks of oyster mushrooms in it, which is a special treat. But the chicken tasted a little dry and I actually wish there was less of the chicken, and maybe they could've added some bamboo shoots for texture instead. As for the Pad Thai, it had lots of bean sprouts which is nice, and a good portion of it despite being lunch. Wasn't too impressed with the overall flavors though - thought it was a little bland.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-05-31T00:00:00.000", "review": "This is one of my favorite spots on the mainline. It has a great vibe and 2 different seating options. You can choose from Japanese style below floor level seats or traditional restaurant table seating. You can choose from both Thai and Japanese dishes and it is always prepared wonderfully. The rock shrimp and tempura is my go to app and their dragon roll.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-11-21T00:00:00.000", "review": "Very excellent asian fusion with really good lunch special! Lunch specials include a huuuge portion, soup and a salad. I got teriyaki salmon lunch box with sushi on the side. Really big portions for lunch and they excellent hot tea. Will be back to try out for dinner!", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2018-01-01T00:00:00.000", "review": "New Year's eve about 8:00. A chilly restaurant followed by luke warm appetizers and equally tepid entrees. The food is tasty but definitely needs some more attention before being served. The salmon entree was a good portion but my Chilean sea bass was about 1/3 the size of the salmon. And overpriced for the small portion.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-01-04T00:00:00.000", "review": "I loved the curry with duck breast. Amazing. Maybe because I've never had curry with duck. Sushi was good. Papaya salad was good. Overall every dish was tasty. Just more pricey than my normal thai place. Really enjoyed my dinner for my anniversary.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-11-28T00:00:00.000", "review": "An interesting fusion of Thai and Japanese, Mikado delivers on some the the best food on the Main Line.The main selling point of Mikado Thai Pepper is the selection. The fusion of Thai and Japanese means you get to pick from sushi to pad thai. The interior is tastefully decorated and divided into two sections, with a sushi bar and plenty of seating. Craving the Thai half of the restaurant for lunch, my girlfriend and I ordered the Crispy Calamari appetizer ($8.00), the Pad Thai Shrimp ($9.50) and the Thai Style Sweet & Sour Chicken ($8.50). The calamari was a unique variation, as it was lightly breaded and fried really light, very puffy. It was delicious by the way, and came with two dipping sauces, soy sauce and a creamier sauce. Next up was the old Thai standby, the Pad Thai. Since this dish is served in nearly every Thai restaurant, it's an excellent baseline measurement. The Pad Thai was also excellent - fresh ingredients, well prepared, and large portion size. We ended with the Thai Style Sweet & Sour Chicken. As far as I'm concerned, it was the best dish, the was a perfect blend of the namesake sweet and sour, loaded with veggies and succulent chicken. Overall, Mikado Thai Pepper meets expectations and exceeds in other categories. It's definitely worth a visit if you're craving sushi, Thai, or both and want a more formal, sit-down restaurant experience.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-05-17T00:00:00.000", "review": "Above average.spicy salmon roll - good, but not spicyscallop sushi - decenttoro sushi - delicious and butterychirashi bowl - mediocre (ratio of fish to rice is not proportional and imitation crab is a negative)seafood drunken - spicy, seafoody, a bit salty .. but overall, it was good", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-09-09T00:00:00.000", "review": "Basically I come to this restaurant because they have really good coconut soup. This is a Thai and Japanese combination restaurant with pretty decent food even if it is a bit tired. The summer rolls are worth getting. One of the dinner guests liked her sea bass. I had the Softshell crab tempura that was not good, greasy and over breaded...it was sadly almost inedible. My Server notice I was not happy with it and ignored the situation. She should have \"made it right\" but I could tell wanted the money. It is that kind of stuff that can make or break the whole experience. The bill was expensive for a middle of the road combo-Asian restaurant.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-02-28T00:00:00.000", "review": "Worst pad Thai ever ! Looking for pad Thai you should try Siamese princess in Ardmore ! This pad Thai served here taste horrible .Don't even bother ordering it unless you want a bad tummy ache.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-10-19T00:00:00.000", "review": "They have a very good Japanese lunch and a wide selection of Thai and Japanese on their lunch menu.My tempura lunch \"box\" was delicious-freshly prepared-more than enuf-good miso soup---salad---4 California rolls and of course the tempura pieces.I was very pleased.Nice atmosphere.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-05-10T00:00:00.000", "review": "I have come here several times, and I always enjoy it. The sushi rolls taste fresh, and the menu has an excellent variety. I do wish they would add a couple daily special rolls to change things up, but that is only a small complaint. The Godzilla Roll is my personal favorite.As far as the Thai food goes, everything I've ordered has been good. I especially liked the tofu red curry.Also, they will sub brown rice both on entrees and on sushi rolls if you ask.This place is a solid and consistent 4 star dinner.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-02-23T00:00:00.000", "review": "So far this is the best Pad Thai I have had in Pennsylvania !  The price was a lil steep (13.50 for chicken pad Thai) but I will certainly order it again!I also had one piece white tuna sushi which wasn't the white tuna I'm used to but was also yummy!I will be ordering from their lunch menu in the future and I am going to try the panang curry asap!The bonus is they deliver to my zip code! Yay!", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-07-28T00:00:00.000", "review": "Delicious food! I love the basil fried rice. I opted for vegetables instead of chicken and it was even more delicious.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-06-05T00:00:00.000", "review": "I got the pineapple fried rice. I had made a pineapple fried rice recipe from Vegetarian Times and it was delicious. I was excited to see it on a menu in a restaurant, where surely it would be better!What I got was plain old fried rice with some pineapple chunks thrown in and served in half a pineapple. Didn't taste like pineapple, nothing special, no special flavors. But it's gets worse: it actually had no flavor at all! It was the worst fried rice I've ever had! Completely bland and NO flavor whatsoever! Not even salt!It was so bad I said something to the waitress because I couldn't even bring myself to eat it. I was embarrassed that I even had to say anything but the dish was expensive! Instead of offering me the option of getting something else, they took it back to the kitchen, refried it with soy sauce this time and sent it back out. At least there was salt flavor now and somewhat edible.And it still cost $17.50!!! How do they get away with that??? For plain old fried rice that wasn't even any good! I can only hope their other entrees are better. I won't be returning though.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-09-14T00:00:00.000", "review": "The spicy noodles and the thai basil fried rice at this restaurant have an amazing depth of flavor. Try splurging on the beef: its always SO TENDER! Highly recommended!", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-03-03T00:00:00.000", "review": "I recently planned a party at Mikado Thai Pepper, and could not have been happier with the service we received. I worked with Edie in the planning phases, calling back and forth to set up how many people would be coming and the time table for the evening. She was super helpful and friendly with all of this and when the night finally came, greeted us like old friends at the door.They had set up a great space for us upstairs, away from the crowds with enough seating for everyone in our party and a spot for the gifts and cards. They were serving everyone drinks before the guest of honor arrived, so everyone was comfortable. And Edie helped us with the surprise when we arrived back with the birthday girl! Appetizers and dinner were amazing - I've been ordering the massaman chicken curry here for the past three or four times I've eaten here and absolutely love it. I always add extra green veggies. We also ordered a couple of sushi rolls including the Dragon Roll, which was out of this world! Eel, cashew, strawberry!? Try it! We also had their beef appetizer before our meal - it's thin strips of beef, wrapped around scallions - so decadent.Our servers were great, and pulled off the birthday cake candles with grace and style. They also let our party linger long after the check was paid, as we were chatting and kicking it at our tables. Such a great experience over all. I will keep going back for Thai and sushi in the burbs.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-03-08T00:00:00.000", "review": "Seriously horrible service. I'm usually not too needy, but our waitress (or any staff) was nowhere to be found in an empty restaurant. The sushi was mediocre to boot. Go to Mt Fuji...attentive staff and great sushi.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-02-22T00:00:00.000", "review": "I think I've eaten here about five times. Personally, I came here for the sushi (because I am always game for sushi), but it was great for having a group with several different preferences. In no world was the food worth the price though. The food was average or slightly above. The service was always good at least.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-04-24T00:00:00.000", "review": "I had an excellent Tom Kha Gai and some sort of very tasty roasted eggplant salad. The food was very good, the service was rapid and polite. The green tea was hot and she poured it out for me from a pot -- it was not a lukewarm cup of bathwater with a useless tea bag lying in it. Clean, pretty, altogether worth visiting again.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-07-25T00:00:00.000", "review": "Delicious!!!! Fresh food and fun seating. If you're ever in Ardmore be sure to eat here!!!", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-12-03T00:00:00.000", "review": "Not too shabby Mikado, not too shabby. The highly decorated interior of this establishment can only be described as a intricate amalgamation of Thai culture. It was inviting and almost too rich for my taste but it was a birthday surprise and I must say how beautiful it was.The service could have been a notch better but our waiter was great with our order. We usually go all out when ordering as you can see on the pics provided and all the items served were really tasty. Prices make sense for the caliber of the meal. While our trip to Mikado did not satiate our Thai affinity for food as we did not order anything Thai related we did go with the following:Godzilla roll(huge roll w mixed cut fish) King Kong Roll(forget what was in it but it was so good) Volcano (chicken roll was really good) Wok Sauteed bok choy w/crispy tofu (really really good) Schezuan Shrimps (this was the yummiest shrimp I ever had) We would definitely revisit this restaurant in the future and so should you alls.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-02-13T00:00:00.000", "review": "Friday night dinner before Valentine's Day.This lovely Japanese/Thai restaurant across from the Lower Merion township office did not disappoint. They offer a fairly large menu (though I wish they had traditional grilled mackerel) and a choice of seating areas -- tatami area (with chairs, thankfully!), sushi bad and a \"regular\" dining room. We were seated in the regular dining room in which voices really carried (I couldn't avoid hearing the entire conversation of the people next to me), though I would have preferred the tatami room for the charm and relative quiet. The hostess, who seemed inexperienced, did not offer us a choice. We had a friendly, courteous server and delicious fish. The Chilean sea bass on a bed of spinach and mushrooms, as well as the curry salmon with pineapple chunks, grape tomatoes and carrots were cooked to perfection. The unagi/cucumber roll was great for the price and the mango mousse with coconut rice was excellent (except that the rice should have been creamier). They offer white and brown rice, which is nice, and a flavorful green tea. $60 + tip for 2 entrees, 2 green teas, 1 regular sushi roll and 1 dessert. Easy street parking!To make the dining experience even better, I'd have instrumental background music and something to prevent voices from carrying so much.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-11-15T00:00:00.000", "review": "If I am writing a review on Yelp (which rarely happens) it is because I am either really pissed or really pleased with my dining experience. In this case, I was pissed, and I still am! I have been to Mikado a few times, and every time it was good. Thus, I recommended to my friends that we go grab a quick bite to eat here before we go out. Well, let's just say after that experience I look like a jackass for recommending this place to them. A quick bite turned into an hour and 30 min dining nightmare. First things first, the service was despicable. The waitress waited 15 minutes to greet us, another 30 minutes to take our orders, and then all of our food came out at different times (and when I say at different times I mean 15 minute gap periods). Now, I work at a food establishment so I understand when things are busy the service will obviously be slower, but the place was empty and the employee to customer ratio was 3:1... No excuse for the poor service. The best part was when I asked a waitress to call mine over so I could order, and then the chef peeps his head out of the kitchen and gives my friends and I dirty looks... SASSY! At this point I was worried about the quality of my food so I remained pleasant when the waitress walked over. We order. THEN, after 30 more minutes my friends sushi roll comes out. She said she would wait for us to eat but it was 15 minutes later and no other food had come out, so she ate her roll as my other friends and I sat there with grumbling stomachs. Finally, the rest of the food comes out... It was so average tasting. I figured that I waited 45 minutes for it to be made so it should at least taste decent. I think my school cafeteria food tasted better and that is saying A LOT. Seriously it takes two minutes for the school lunch lady to prepare a decent tasting grilled cheese but Mikado 45 minutes to prepare miso soup, a ratchet chicken lettuce wrap, and fried rice? The fried rice was bland tasting and the chicken in it was dry. Considering the fact that I got an A in cooking class when I was 13 for making some bangin' fried rice, I think Mikado should let me cook everyone some quality fried rice.Anyways, after waiting 20 minutes for the check, we finally leave. (We missed our party). As arrogant as I may have sounded in this review, I will say I have had good experiences at Mikado, and I really like to give people the benefit of the doubt.  But after tonight I don't think I can ever come back here. Food sucked. Service sucked. To top it off, my friend and I drove off with ours heads out of the car window in 45 degree weather because we felt nauseous from the food... lol.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-08-26T00:00:00.000", "review": "The Godzilla roll is AMAZING! I would have never guessed strawberries and honey could go so well in a sushi roll. YUM! I did pick up and when I arrived I was quite surprised at the smell the place had. I was not to fond of the smell, but the sushi was great, definitely will be returning. We also got the Traffic Light Roll, good; King Kong, good; and the thai spring rolls, which were great as well.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-05-15T00:00:00.000", "review": "Off the charts, delish all the way around! The lovely ambiance certainly set us up to expect nice, but the assortment of flavors that were expertly arranged to deliver joy was utter amazing! The tuna tartar? I will get it again, and I'm drooling just thinking about it. Top notch.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-01-16T00:00:00.000", "review": "Place was simply ok. Definitely very pricey for lunch. Sushi rolls lacked some flavor. They were ok, but nothing to remember really. I got the flaming dragon roll which was a really cool presentation, because the sauce was flaming blue when it came out, but the sauce was really sweet and the sushi roll itself needed more punch. I also ordered another roll that I cant really remember what it was called, but it had lobster tempura in it. Again it was decent, but for 15 bucks a roll, I was expecting a lot more. I am new to the area of Ardmore, but I suspect there are better sushi restaurants than this.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-07-02T00:00:00.000", "review": "I tried the chicken lettuce wraps, sweet thai chilli wings, miso soup, and vegetables...I felt sick afterwards. My fiance loves their chicken fried rice, but he doesn't like their shrimp tempura rolls which is saying alot. I'm not going back.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-05-09T00:00:00.000", "review": "Excellent!I adore this restaurant! I have been here no less than 15 times and it never disappoints.The staff is friendly and professional and the restaurant is very clean.The food, the most important part;), is fresh, delicious and esthetically pleasing. You can tell they take there time and care with the food preparation.I have sampled both the Thai and the Japanese menus. Both are top notch!The beverages are delicious and you get a good pour. Definitely get a bang for your buck here.I adore the Ardmore roll:)If you have not been here I recommend it highly! You won't be disappointed.Enjoy:)", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2008-07-09T00:00:00.000", "review": "Mikado is well-decorated (not visually noisy at all) and you won't doubt you're in a Japanese restaurant, even if you've never been in one. Their pseudo-traditional tables are a trip, too - you might be tempted to remove your shoes and kneel at the tables, but there's actually a depression for your legs. It's not a huge place, so if you have a large party, I'd call to reserve a table. NOTE: Seems like they also occupy the space of their former neighbor, Thai Pepper, so that should help as far as space is concerned.Average sushi, not amazing sushi. Average priced too, I thought. Service is good, with better Japanese options in the area, including Sushi Land, why go to Mikado? However, sushi is a matter of taste, so give them a try if you're in the area.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-05-31T00:00:00.000", "review": "Nice that it's a combo of Japanese and Thai. Sit on the Japanese side. They have cooler seating. It's tables leveled into the ground so you're sitting like they would at japan if you were kneeling. Best pad thai I've had in the philadelphia area so far though that might not be saying much. Really great carpaccio.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2017-01-03T00:00:00.000", "review": "Great restaurant for dine in or take out. Atmosphere is cute and spacious inside. Sushi is the best in the Ardmore area. Always fresh. My favorite Japanese restaurant- highly recommend!", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-06-21T00:00:00.000", "review": "If not the best, one of the best japanese I have ever tried! Food was delicious! Decoration was also very nice and comfortable.Great for kids!!! I'll keep coming back!", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-01-16T00:00:00.000", "review": "Given all the recent reviews, this may be an outlier, but our experience last night there deserves some mentioning.  When reciting our order to our waitress, mid-order she cuts me off saying \"Thank You\", assuming we were done and it was a bit awkward trying to explain we wanted some extra sushi/sashimi pieces on top of what she thought was a complete order.  It all eventually got sorted out, but I cut our sushi order down a bit because I was getting skeptical.  We started off fairly well with some Agadashi Tofu (lightly breaded Tofu) with a mild sauce that we both polished off happily.  The Beef Negimaki was a weird serving beyond what I had ordered elsewhere.  Both the beef and the \"scallions\" were boiled than cooked.  Maybe its more traditional, but just different than I'd expect from othe restaurants.  Looked good, delicately prepared, but weird tasting in our opinion, but can't call a fail.GIven the reviews me and my dining companion both ordered the Pad Thai with chicken, her's being extra spicy.  Our both came at the same time and my friends had a whole fingerbowl's amount of red-pepper flakes (the good asian kind) on top of her Pad Thai and she was very concerned that it was going to be nuclear hot. I agreed to switch dishes since I am used to spicy foods and forgot to ask for mine to be spiced up too.   Luckily since the flakes were so amateurishly poured on top in one location, I was able to remove a large chunk of the flakes all clumped together into a separate plate.  Had we not ordered the same thing and switched dishes, she would have burnt her mouth and/or sent hers back.   Even after I removed the extraneous flakes, the dish was spicy, but absolutely no flavor.  I hate spicy for spice sake, but no added flavor.  I couldn't distinguish between pieces of chicken and pieces of dried up tofu.  Upon closer inspection, it appears the tofu was REALLY old tofu-chunks they wanted to use up.  I know they had real tofu since the Agadashi tofu dish did have some real fresh tofu.   The sushi/sashimi was delivered and apparently their menu is very LITERAL, we ordered a piece of mackerel and a piece of white-tuna, I thought the pricing for pieces of sushi was relatively cheap, but now realize they literally give you a piece of sashimi for each order.  I am not going to call foul on being literal, when I should blame most other restaurants for not clarifying between orders and pieces, but this made a bad situation worse in context.  Just mentioning it here to warn people looking to get their sashimi orders in.  On our way out the door though, I saw some deluxe rolls and they looked of decent size/quality, so it might not be a fail there.  When the waitress came by again asking \"if everything was good\", I thought she saw my companion hadn't eaten all that much of her dish and that I had put all the tofu pieces ripped open to show the cottage cheese consistency they had devolved into.  My response to her was \"Not really\" getting ready to explain how both dishes were a disaster to which she promptly (with a big smile) said \"Thank You\" and walked off.   As we suspected early on, the language comprehension skill was just not there and our opportunity to have the matter addressed was seemingly done.  We were in a rush, so the opportunity to flag down a manager who could actually understand us and perhaps remediate the situation wasn't there.  My friend left 85% of her plate there and didn't want it wrapped up, which should have also been a clue, but we just asked for our check and left swearing it was likely the last time we were going there for awhile.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2016-11-17T00:00:00.000", "review": "We ate a dinner there and decided that all together we ate in Micado 3 times:first time,last time and very last time.When we relate to the owner about the sushi we ate-they were not prepared to order.Instead they came from the fridge he just laughed.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-04-04T00:00:00.000", "review": "This place is amazing, if you are in the mood for Thai and spicy food, there u go, u're in the right spot!!!!!!!!! Words could not describe how delicious the food is!!!!! Come and give it a try once, u'll never regret. by the way, I am not an advertiser for this res. Just want to let u all know a good spot :)", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-02-19T00:00:00.000", "review": "My family and I had gone there to celebrate an occasion.  All four of us ended up getting food poisoning and when I spoke to the manager she wanted proof that we had gotten food poisoning and wanted proof showing that we had gone to the emergency room.  Anyone that has gotten food poisoning knows that is something that just passes through and there's no medicine to fix the issue.  Then she continued and complained that all four individuals in our party did not call which seems a little ridiculous to me to have my husband and the rest of the family members call and complain individually.  Very poor customer service and no care or concern regarding the customers issues and experience.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-11-30T00:00:00.000", "review": "Really two restaurants in one (Mikado next door opens into Thai Pepper), Mikado Thai Pepper delivers solid Thai cuisine in an informal dining room.  (I'm getting tongue tied saying Mikado Thai Pepper all the time, so hereinafter it is simply MTP).  You can order Thai food or Japanese selections, including sushi, from next door.Service was prompt and courteous.  I am a huge duck fan, so I went with the Panang Duck.  Served crispy as it should be, the flavors blended nicely with the coconut milk and curry sauce.  I don't know about you, but coconut milk and curry are made for each other...like peanut butter and jelly, or peanut butter and chocolate, or peanut butter and ice cream.  Oh hell peanut butter and anything.  But I digress.We also enjoyed some of the sushi from Mikado on a take out the next night.  Pretty much a tie with Samurai down the road, it is not standout by any means but is a solid three star showing and will satiate your sushi craving.  The Super Dragon Roll will hit the spot if you are into eel and soft shell crab.  I couldn't find the peanut butter roll on the sushi menu, so discriminating diners beware.Overall, MTP is a nice neighborhood sushi/thai joint that is reasonably priced, casual, and well run.  There is a municipal parking lot across the street as well as street parking nearby.  The place filled up by 7:30pm with locals and their families, so a reservation would probably be a good idea.  Leave your tie at home.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-08-29T00:00:00.000", "review": "Love the food here! Especially the red curry, get it (almost) every time. Great lunch specials too! Only reason why I'm not giving it the full 5 stars is that sometimes the service can be a little slow.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-06-08T00:00:00.000", "review": "Congratulations on becoming a new owner of your very own Brad P!  You will have to feed him constantly and put up with his difficult temperament.  This review is part of a series on proper Brad P. care.Here are a few tips that will help you tell if your Brad P. is in the mood for Thai food:1. He is breathing.2. One of his limbs are moving.3. He is talking.If one or more of these above conditions are met, it is very advisable to bring him to the nearest Thai food establishment.  If you've found yourself way out in Ardmore, Thai Pepper is the best place to satisfy this need.--I know they do Japanese and Thai food, but I've only had the Thai stuff.This restaurant makes the best basil fried rice in the Philadelphia vicinity.  I don't know what they do differently to it compared to other establishments, but it is ridiculous.  At most Thai restaurants, I'll get the basil fried rice once and then move on to the curries, pad see ews, etc.  At Thai Pepper, this is not the case and I stick with the basil fried rice about half the time. The secret ingredient must be crystal meth or something because I get all itchy if I haven't had it for a few months.On top of this, they have some pretty wacky dishes for a Japanese/Thai food place.  I had some sort of Pesto-Linguine-Shrimp dish with a Thai twist that was alarmingly good once.  The biggest problem with this establishment is that it is quite a schlep from the city.  Their curries are freaking delicious, but not great enough to displace Chiangmai's as Brad P.'s top curry in Philly.soooo in other words, I highly recommend this establishment.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-03-07T00:00:00.000", "review": "I like Thai Pepper very much since 10 years ago. I used to order the noodle dish all time. I liked it. Then I decided to try some other dishes. Anything I tried, I liked very much. Even my husband liked his dish. He did not like Thai food that much before. The place has plenty tables. It always has available ones when I go. It is one of my favorites.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-03-04T00:00:00.000", "review": "I dont like the burbs never have never will. I will however make it a point to support my friends that refuse to move back to the city. Celebrating the birth of one of my favorite yelpers Calla W was the reason for this visit to the mainline. I was graciously invited to her surprise dinner. I wasnt overly impressed with the food here. Sushi and Thai places are pretty much on every corner in the QV and the food is less expensive and a better quality than what i had here.I had the shumai dumplings , and some spring rolls since nothing else really grabbed my attention.I will give them snaps for the asian mojitio made lovingly  with patron was quite good and i would order it again or recreate it at my house.Service was spot on and the staff  went out of their way to make sure her dinner was a success.I obviously wont be back because i dont do the burbs, but if i had a friend craving thai/sushi near the mainline id recommend thai pepper.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-07-06T00:00:00.000", "review": "Arrived here at 630 and it was still relatively quiet.  Got seated immediately and was walked through the Japanese seating area and then next door into the Thai inspired section which I thought was different especially since we didn't specify what we were having.  I know that they recently acquired their neighbor, but they need to stick with one theme instead of separating rooms.We got our Thai iced coffees immediately and then proceeded to order a set of appetizers to be followed by 2 rolls.  Now, I do not claim to be a sushi/sashimi connoisseur but I do know what fresh fish tastes like especially since I fish for bluefin tuna, striped bass and flounder.  I was interested in the uni which I inquired about and the server said \"it came in today\". I know what fresh uni tastes like, and it takes a bad batch of uni to completely ruin a whole meal, something that I didn't mind risking.Our tempura and crab nuggets came out first, and I was pleasantly surprised.  The crab nuggets looked like it was made in-house, and the tempura batter was just right.   The oil it was fried in was fresh and  didn't taste like old frying oil which was a plus.  The tempura was also drained properly so it felt light to the palate.  The vegetables in the tempura were just al dente, and were still alive with flavor.  The oil was at the perfect temperature since the broccoli didn't retain any.  Awesome.Next came the marble roll which had at least 3 kinds of fish and a funky wrapper.  The fish was pretty good, firm and placed together right.  The other roll called the sunset, left a bit more to be desired.  The plum paste was a bit salty and the shiso leaf reminded me of grape leaves.  That combo didn't bother me as much as the salmon eggs that topped the slivers of fish on the roll however.  The eggs were old and desiccated.  Yep, they weren't as fresh as they should have been.  I WILL add however, that unless you picked up one of these eggs and ate them separately, that it would be hard to tell-  the shiso leaf, plum paste and wasabi mask it up pretty well.  But yes, the pic shows the desiccated state; they should be plump, shiny and firm.The uni-  I shouldn't have ordered it.  At 4 bucks a sushi, I was expecting better, much better.  I was very disappointed with my decision to even try it; I usually gauge a sushi joint with the freshness of their uni.  Unless the uni can be guaranteed that it indeed came in that day, stay away and save the money for another round of drinks instead.Over all, the service was great, hence the 3 stars, but the sushi needs help.  We will be going back again to try the Thai side of things, we hope that our next experience with the cuisine is a better one.  Well at least it's gonna be all cooked next time around-  till then!", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-01-23T00:00:00.000", "review": "I could not expect any less from a Win signature restaurant. All of those restaurants have superb menus with creativity. So let's break it down:The service: 5/5Every time I have come to Mikado Thai pepper, my table is always ready. I did show up once without a reservation and thought the wait was going to be at least 15-20 mins, but apparently they have an additional dining room upstairs which was great. All the waiters and waitresses are very helpful and actually know the menu. What I mean about that is when I am looking to order at some restaurants, some of the staff cannot tell me how a dish may be prepared. Atmosphere: 4/5The restaurant does get a little noisy on a Saturday night, but that is to be expected. Their are a number of large tvs which I thought was a bit tacky however I did come on a Sunday night during playoffs and was great. Their was a lot of Thai decorations which did make it seem more authentic and Japanese style tables was a nice twist.The food: 5/5So the sushi I found to always be great, the best on the main line without a doubt. The fish is always fresh, the presentation varies on what types of sushi you order. So I was a big fan of their specialty rolls, I love mikado roll and super dragon roll. I normally order a rainbow roll everywhere (I think it's a fair balance and variety). For the other dishes, I have had the soft shell crab tempura which I thought was a very generous helping. Honestly I was enough to feed 2-3 people. Pad Thai I thought was very well done. The yakitori bowl is a great bang for your buck. My new favorite is the spicy noodle with chicken. I love the restaurant and definitely will be back again and again!", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-09-14T00:00:00.000", "review": "Cockroaches on premises- that should give you enough information to decide if you want to have a meal at this place.  Before I saw them running around we tried Pad See Ew, which had no flavor and a curry dish, which was too spicy and I like spicy food. It really doesn't matter if anything tasted good - the place had cockroaches!", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-12-21T00:00:00.000", "review": "My fiancee wanted some last-minute pickup food from a sushi place at 10:15pm on a Friday. She ordered a California roll and some Miso soup. The hostess was cordial and the food prepared quickly (10 minutes, maybe). I waited by using the restroom which was quite clean and simple. The food tasted good and was even good the next day from the microwave.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-09-05T00:00:00.000", "review": "Everything I orderd was bad.  Sushi was bad.  We orders over 100.00 worth of food none of it was worth it at all.  Thai food was too sweet and the sushi tasted old which isn't good when it comes to raw fish.    I personally will never return here ever.  Rather spend my money where it's worth it.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-01-24T00:00:00.000", "review": "I've been going to Thai Pepper for close to 10 years, and I've always loved their spicy noodles. I've tried other dishes as well and have never been disappointed. Their location in Ardmore, now combined with Mikado's sushi restaurant, adds more authentic asian food to the menu. Not to mention their staff is SO nice!!! They've accommodated my friends for both off-service hours and large dinner parties. This is one of my favorite restaurants in the Philly area! I've actually been to Thailand, and Thai Pepper is still one of my favorite Thai restaurants!!!", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-12-10T00:00:00.000", "review": "I eat here at least twice a month. Their sushi is the best around - always fresh and delicious. I LOVE their ginger dressing on the house salad... I wish they sold it by the bottle. Also great are the pad thai and teriyaki salmon. I highly recommend this place.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-12-30T00:00:00.000", "review": "great food and even better service. The food was fresh and delicious.  There were plenty of sauces and variety.  Tim, our server,  was amazing.  Our drinks were constantly refilled and he went above and beyond when we couldn't get our camera to work.  He took a picture for us and emailed it to me right away.  Fantastic family place and date night option.  highly recommend", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-01-09T00:00:00.000", "review": "My favorite Thai food is miles away at Teikoku in Edgmont and not that easy to get to.  I thought Mikado Thai Pepper would be my new fav since it is closer and brought to you by the same people who own Teikoku (and Azie and Mixx).  Unfortunately, it didn't take the top spot, but it will have a good place on my rotation.The beau and I went on a Friday night at 6:30 and there was no wait!  Huzzah!  I am glad they combined the two cuisines since that is what I was used to at Teikoku.  The menu was more reasonable than I have come across at other Thai places, so that was nice (and a bit surprising on the Main Line).The service was great.  I introduced my boyfriend to the simple joy of steamed edamame.  He liked it, though I thought it was a bit undercooked.  He ordered the spicy noodle with chicken and I ordered the shrimp pad thai.  Both were good and we commenced our thai food coma immediately after.  The only thing is that I know Teikoku's pad thai is amazing and so I thought since they were owned by the same people, it would taste the same.  While it was good, it didn't live up to what I love.There was a large flat screen TV in the dining room that was broadcasting the Sixers.  Me and the boy were totally happy about it, but I could see how that would annoy those who wanted a quiet night out.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-03-27T00:00:00.000", "review": "Our experience tonight was only OK. Nice, courteous waitress who made sure our waters were always full and checked in without nagging. Just as last time, the massaman curry was AWESOME. But the dragon roll was nothing special - definitely not worth the \"specialty roll\" price. It was average, at best. The calamari salad dressing had great flavor, but the calamari was overly fried and I tasted more breading than squid. Lastly, we were disappointed that the rice portion was so small to begin with, and then they charged us $1.50 when we asked for a little more. Cmon...$1.50 for rice? You barely gave a scoop to start!", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-08-29T00:00:00.000", "review": "Disappointed after many years of going there. Decor is very tired. Sushi rolls still very good but our large order was delayed 20+ minutes. Server said virtually nothing and when I approached the \"man in charge\" he told me that things were late because they had too many takeout orders. Very bogus IMO.later they brought us a tempura fried ice cream ball as a compensation. Not too impressed after spending $150 on dinner.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-07-07T00:00:00.000", "review": "Mikado Thai Pepper is easily one of my favorite restaurants located along the Mainline in Ardmore. As soon as you enter, you realize the words present on the restaurant's web page, \"experience the enchantment. . .\" Of course, if a place has delicious food, that typically is all that matters for me, but ambiance is a plus. As you notice by its name, Mikado Thai Pepper presents two types of cuisine, both Japanese and Thai. That being said, the restaurant has a dual theme; you can choose to either sit in regular upright chairs, or a Japanese-style setting that brings one closer to pristine, wooden floors, reminiscent of a tea house.In the few times that I've had food here, there were no complaints, aside from one instance of slower than usual service. But the food was delicious. I try to stay true to the restaurant's theme, and choose both Japanese and Thai items. Shrimp shumai, one of my favorite small dishes, is done very well. The shrimp is fresh, and the dumpling sheet is not overly chewy. Dipped in the sauce it's served with, I'm always tempted to order a second plate. Many of the entrées served here are also worthwhile. True to tradition, the food is colorful, flavorful, and a lot healthier than other alternatives. The Thai Style Green Curry (also offered in red) with tofu (or chicken) is a tasty dish. More recently, I had the Thai Basil Fried Rice with crab. It packs a zesty punch, served with a variety of leafy greens and firm vegetables. If you have room for dessert, have no fear, there are some excellent options. Have you ever had fried ice cream? Think ice cream and your favorite tempura roll, but just the breading; it's something like that. If you're not interested in a fried dessert, try mochi ice cream. You have the option of a few flavors of ice cream, wrapped in a chewy, rice dough (mochi).As a Thai enthusiast, I highly recommend Mikado Thai Pepper, especially if you're looking to explore the realms of Asian cuisine.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2008-06-27T00:00:00.000", "review": "When living on the main line you have so many excellent restaurants to choose from ... unfortunately Mikado is topped by several others in the area.  This is probably a good place to go for a new sushi eater - but we weren't wowed by the selection we ordered.  On the plus side the decor is nice and feels like a sushi place should.  The service was also friendly and prompt.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-02-19T00:00:00.000", "review": "My friend and I were out in Center City on a snowy night trying to find parking so we could get a bite to eat, and found nothing. So, since I live closer to the Main Line anyway, he got the idea to head out that way.  So we did.Looking at the outside, for a moment I actually thought it was a Japanese and Thai restaurant side-by-side, due to the signage.  But once inside I realized it was two restaurants in one, more or less.  Perfect!  I was dying for Thai food anyway. I appreciated the decor, and as I was wearing a skirt, I was semi-relieved to be seated at a regular table than at the tatami mats.  Although, next time, if I am actually planning on coming here, I would wear pants and sit cross legged.For my appetizer I had a spicy tuna roll and one piece of tuna belly (Sorry, I forget the proper Japanese name for it) sashimi.  All of it was delicious. I gave my friend a piece of the roll and he agreed it was delicious. He ordered an Asahi (a Japanses beer), which he was pleased to see on the menu.  I just had a glass of pinot grigio.I had the Thai Barbecued Chicken with coconut rice and a light salad with a ginger dressing. The chicken was crisp-skinned yet juicy and tender. And I adore coconut rice. Although it is a simple item to prepare, this was exceptional. The rice was not overly sticky and fragrant with coconut milk. I could have eaten another bowl of it.  My friend had Beef Teriyaki and said it was excellent more than once.So I am very happy to have stumbled upon this place and intend to go back. Just think, if there had been parking anywhere in Center City, we never would have found this place!", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2011-09-10T00:00:00.000", "review": "I'm typically not a fan of hybridized Asian restaurants, but this place does well in a pinch for when we're looking to eat before our movie at the BMFI.  Service is friendly and quick, while the furnishings are clean.  Points for the tatami mat seating arrangements as you walk in, though if you're not keen on sitting cross-legged, you can ask for the tables on the other side of the restaurant.Since they're offering both Japanese and Thai food, you can imagine that either side of their menu is pretty basic -- having said that, the tom yum goong soup has the ability to make my heart sing, while the sushi is about as good as you can get on the Main Line.  Can't complain about their green tea ice cream either, even if that seems to be the standard in all Japanese restaurants.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-11-04T00:00:00.000", "review": "I had a rougher then normal Tuesday afternoon a few weeks back. Had just received the 2nd worst news ever in my life. Didn't want to be around too many people, so I sough solace in this quaint lil-gem located caddy corner to area's finest, Lower Merion Police Department. Instilled by the fact that worst-case scenario, the authorities were just meters away, I figured it be a good night to try some Spicy Kung Pow Chicken. Boy was I overwhelmed by the kick this baby packed. It felt like Zeus himself has throw down his lightning bolt directly onto my virgin-like pallet.The service was pleasant, and I found the waitress amicable. I was a bit disturbed by having to sit down on my rear-end to eat dinner. I thought I may have spied one of those Arab folks eying up my size 12 Assic Crosstrainers. They make you take your shoes off. Good thing I left my nice Avias at home.I recommend this joint for that time in your life when a friend may be hard to find, but you need that comfort that only Asians know how to bring.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2011-01-28T00:00:00.000", "review": "Once the Thai Pepper craving hits there is nothing you can do but comply. Approximately at least once every two-three weeks, my roommates and I crave the two most amazing things on the menu. if you every come here and are not a fan of the Japanese food, I HIGHLY recommend:1. Spicy Noodles with Chicken (TO DIE FOR)2. Thai Fried Ice Cream (with its crispy shell and vanilla ice cream filled center, once you've had this, you can never go back!)Listed above is THE perfect meal. I have heard that some of the other non-sushi dishes are not that great such as the Pad Thai, but just get the spicy noodles with chicken and you'll leave completely satisfied. The ambiance is very nice and classy, so if you're looking to go somewhere for a romantic date, this is a great place, I really love the tea house setup where the chairs are below the ground level.Right now I'm living six hours away and having a serious craving. Anyone want to bring me some food?", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-03-13T00:00:00.000", "review": "Haven't been there for 3 years and went this Monday for lunch. The eel roll was not fresh and smelled funny. The spicy tuna did not have much tuna and was not spicy. The miso soup was completely watery. I was seriously disappointed and will not return to here again.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-09-08T00:00:00.000", "review": "Had Pad Thai Shrimp for lunch. Mediocre at best. Restaurant nice, service good meal very weak.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2007-07-15T00:00:00.000", "review": "If you find yourself in the suburbs around lunch time and are looking for a good meal to fill you up, then go here and get one of their lunch box specials. it will fill you up with soup, salad, California roll, and a good piece of teriyaki salmon  or chicken in no time flat. and it offers up a lot more delcious and reasonably priced items on it's menu.the bar is also stocked with a good supply of Kirin and Asahi.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-07-20T00:00:00.000", "review": "MIkado is definitely a great sushi spot! The overall decor of the restaurant is very cool and the set down seating gives it a very hip vibe. I ordered the Poseidon roll and two small Salmon rolls. Both items were very good and the fish was fresh! My friend ordered a handful of different rolls and he enjoyed all of them as well. The service was very friendly and the waiter was very helpful!", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-07-17T00:00:00.000", "review": "thai food is always expensive.. money aside the food was excellent and the portions were huge!", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-10-25T00:00:00.000", "review": "So incredibly good. Husband and I each had a curry dish. Perfection. Excellent service. Will be back again & again.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-11-06T00:00:00.000", "review": "We've started taking our car to the Honda dealer up the road, and were happy to stumble upon this spot as a good place for lunch while we waited. I'm guessing these were once separate restaurants, but they've combined pretty seamlessly into one. It's nice having a Japanese and Thai menu to choose from, not to mention the options of sitting at tables and chairs or on the floor in a tea house type setup. We've sampled from both and have enjoyed everything so far. And, when the \"watch this guy eat this gross thing\" show came on the food network on the tv in the dining room, the waitress noticed me grimacing and averting my eyes and offered to change the channel =)", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-08-15T00:00:00.000", "review": "Sashimi was fresh  but the spicy chicken noodle was not spicy at all. It was ground chicken on dough with a side of lettuce. Waitress disappeared in us", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-12-07T00:00:00.000", "review": "Thai Pepper: I was there on 12/6/13 for a family birthday celebration, and the experience was wonderful. My family has mixed food needs, ( gluten free, vegetarian, and regular)  and everyone got what they wanted and really enjoyed their selections. The food service was outstanding. Our food was brought, one course at a time, so nothing got cold and we had plenty of time to \"share\". I've been to Mikado many times, but this was my first time at Thai Pepper, at this location. The ambience is great, the food is special and the service was extraordinary. A perfect Birthday celebration. Kudos to the management. I will be baaaaaaack~!  :)Nancy Gold", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2011-04-08T00:00:00.000", "review": "Does every Thai place have to throw in lilies with their entrees? Gotta admit though, their food is pretty decent. That Sara Lee pound cake fried ice cream dessert is delicious for those who like fried ice cream. I haven't had a chance to try to sushi but based on what I've seen, I'll be back to try some. Ambiance is lovely, great place for groups, good choice for a date.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-11-18T00:00:00.000", "review": "This rating is based on the drunken noodles that I ordered at the restaurants.  I asked to order it extra spicy....and all they did was loaded it up with red pepper flakes!!!  What is that about!  What happen to thai chillies?  I don't think these people are from Thai to be putting dried red pepper flakes on my drunken noodles.  The flavors of the drunken noodles weren't impressive either.  I can't speak on the other dishes since all we ordered was the drunken noodle.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2015-06-18T00:00:00.000", "review": "LOVE LOVE LOVE! They have such good Thai food and sushi. I have ordered take out and dined in as well. I have never had a bad meal and the prices are pretty reasonable. The staff is always very friendly too. I highly recommended this place!", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-01-05T00:00:00.000", "review": "Mikado is one of the best Japanese restaurants in the Philadelphia area, and Chef Iinuma is renowned for preparing specialty rolls. I still remember one of my all-time favorites a few years after I had been there last. The Tiger Roll consisted of eel, mango, honey (and perhaps more, but those were the key ingredients). Even after it disappeared from the menu, they were still willing to make it for this regular customer.The sunken tables add to the unexpected atmosphere you can get in the suburbs. Mikado is also the only sushi restaurant that I can remember my friends from Philly asking me to take them there for dessert. You can't go wrong with the tempura ice cream or green tea ice cream. Sake selections are also impressive.Please note that I'm rating this strictly in regards to Mikado, as I was never as crazy about Thai Pepper next door. The Thai half only gets 3 stars. Most fare was average, although I would in particular recommend against the hot and sour soup.Service on either side is quite good, however, and I would recommend it to anyone in the area.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-02-15T00:00:00.000", "review": "With such wonderful reviews, we were excited to experience Mikado for the first time. Compared to several other Japanese/Thai restaurants, we had high hopes for good quality food and even though it was pricier, we knew that meant the food was going to be worth it! WRONG! There was absolutely NOTHING about our  meal which had us thinking Mikado was any different than an over-the-counter Japanese spot. The tempura was soggy and pieces were actually cold (not \"warmish,\" but cold), the sauces were bland and smelled like chemicals, and an order of vegetables turned out to be nothing more special than what I could take out of a freezer bag and steam in the microwave. The prices went from \"reasonable for good quality\" to \"way over priced.\" I realized quickly that if I wanted to pay for this type of cuisine, I would get the same meal at one of those \"other Japanese/Thai restaurants\" we had avoided in the first place.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-10-05T00:00:00.000", "review": "I have been here a few times and it is one of my favorite spots for sushi. I have never had their Thai, but always get their sushi and have never been disappointed. The service has always been good and the restaurant has never been loud. I went for my birthday twice and they accomodated our large group. I would go more often if I lived closer to the area.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-05-02T00:00:00.000", "review": "We know the chef has changed through the years but to serve a Massaman with a chicken that could not be cut?   Really?   Even the pad Thai chicken had horrible chicken - was probably cooked much earlier in evening and reheated.   I don't care if I come to your restaurant at 8:30.  You should still serve a fresh meal to me.   Horrible.  We returned the dish.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-11-08T00:00:00.000", "review": "Excellent sushi. Been there 3-4 times for various birthdays and dinner. Service was never slow. Always had a full glass of water and a full stomach after dinner. Good portion sizes on the sushi.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-07-21T00:00:00.000", "review": "I drive out of the city to go here.  Seriously, that's how good Mikado is.  I was a fan before the Thai Pepper merger and I didn't think my love could grow stronger but I am now learning I am indeed capable.  Last year during the first months of the merger there were a few growing pains but Mikado Thai Pepper has blossomed into a beautiful swan of a restaurant. The place is broken up into two sections.  The original Mikado contains a few tables and a really cute traditional Japanese seating area.  The new section is in another room and consists of your usual tables and chairs, with a nice atmosphere.  There's a television on the wall, which takes away from the atmosphere except when a Phillies game is playing, as it was last night.  Otherwise, it's really out of place.  I think from now on I'll request the original side of the restaurant to avoid any atmospheric interruptions.  The service is pretty amazing, last night's was a bit slow but otherwise good. The food comes out pretty fast and I've only had slow service on one out of at least ten occasions so I'll just chalk it up to our waiter having a bad night. Please note I am a vegetarian so this review is solely based on the veg foods offered, of which there are plenty.  When I go to Mikado my stomach is beyond empty and my wallet is full.  The menu is packed with my favorite foods.  Vegetarian items are clearly marked, a big plus in my book.  Here is an example of gluttony, i.e. the order my husband and I placed last night for the two of us:Vegetable Tempura AppetizerCrispy Tofu with a Plum Peanut SauceWasabi Mashed Potatoes2 beers of his liking that I really can't remember1 Vegetable Roll1 cucumber/avocado/cream cheese rollRed Tofu Curry Fried Ice CreamMoji Needless to say you could have rolled us out of there.  Everything was absolutely amazing.  The red tofu curry is seriously one of the best things that I have ever put into my mouth; so good I may have to amend the last meal of my Yelp profile.  It comes with three generous rectangles of fried tofu, artichokes, green beans and an assortment of peppers placed upon a red curry sauce, or what will be known to me from here on out as the sauce of the gods.  My mouth is watering like a Pavlovian dog.   The appetizers and rolls are also amazing.  It's really hard to mess up vegetarian sushi though so maybe don't take my word for it but I've visited with fish eaters and they've never complained.  The tempura is crisp and varied, the tofu was yummy and the plum peanut sauce gave my taste buds a lovely massage.  The wasabi mashed potatoes are glorious.  If you add some of the red curry sauce or some soy sauce they are absolutely perfect.  I wish I had some right now. My only complaint is the dessert and really it's not so much a complaint as I have no business ordering dessert after a huge meal and I know it.  I've had several desserts here and have never been totally satisfied with any of them.  If you're going to order dessert stick with something traditional like the green tea ice cream or the moji.  Last night's fried ice cream came out smothered in honey so I had to send it back.  Maybe I was being a jerk but I am a firm believer that honey should not come anywhere near my ice cream, or really anywhere near any of my food for that matter.  Anyway they were nice enough to bring me some honey-free fried ice cream, but it was just okay.   I'm keeping my rating at five stars despite the desserts and the television and the slow service of last night.  That's how strong my love is for the food at Mikado/Thai Pepper.  Mmmmmmm.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-06-10T00:00:00.000", "review": "Have stopped by here on many occasions with groups from 3-6 sometimes with children! One of the best aspects is you can order from either menu, so you are bound to find something. the staff has always been very friendly even when the 2 children run around the place! I want to go back soon, as this is one of the few locations that actually makes a sushi roll with cooked chicken! YUM!", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-07-09T00:00:00.000", "review": "Food was great. A little on the pricey side. Interesting floor seating. A little on the loud side. Great spot if you're craving thai.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-09-15T00:00:00.000", "review": "Well, we ordered in... have been for years.. BUT, THIS time, something was very different... VERY! We thought it must have changed hands.. well, not too far from that, it is a new chef who is \"learning the recipes...\" I found out after I called in to tell them that not only was the order wrong... it just was not good. The Pad Thai was absolutely inedible & greasy.... fried tofu in a fairly unappetizing sauce.  The salmon skin in the salmon skin roll was VERY salty & NOT what I normally like about it.. I ordered a hand roll & got this, NOT GOOD. On top of everything, I ordered ginger dressing & although it only costs 50 cents, it is only half full! Ridiculous! Fill it up & charge a buck....There was hardly any ginger (3 slices ) for 3 rolls.... ridiculous.. again... then I was told that I did not order what I know I ordered.. I always order the same thing. Now, that being said, I will say that the manager offered to comp me a Pad Thai upon my return.. IF I return.... VERY expensive... Cost us over $70.00.. for what???? VERY disappointing... sad to say....", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-04-15T00:00:00.000", "review": "I got food poisoning after eating here.  When I called to let them know, the person who answered the phone couldn't have cared less. She told me that it must have been something else that I ate and that was the end of the conversation. Even in the cleanest places, it is possible for something to get contaminated, I would have understood that. It was unacceptable that they didn't care that they might have made someone sick.  Needless to say, I will not be back!", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-07-13T00:00:00.000", "review": "Great sushi.  Creative.  Tried Godzilla roll - strawberry and cashew, sounds weird but was amazing.  Very fresh.  Large portion sizes.  Thai red curry amazing. Would definitely return.  Fun menu with mix of Japanese and Thai - it works!", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2008-04-03T00:00:00.000", "review": "I passed by Mikado numerous times, telling myself that I really should give this place a try. So my adventurous, sushi-loving friend and I stopped by for a dinner.As we walked in, I immediately loved the authentic feel this restaurant had. From the sunken floors to tradition wooden doors, I liked everything except how the restaurant was small and I felt somewhat cramped. We didn't have a reservation, but we got seated very promptly at a table.As for the food, however, I felt very indifferent about it. I ordered the salmon, tuna, red snapper, and some other rolls. It wasn't horrible, but either was it excellent. Something in-between - perhaps mediocre - would describe my experience. I didn't notice that the fish were extra fresh or tasty. Maybe that's why each dish was fairly cheap. Since the price range was on the lower side, we ordered a lot and ate until we couldn't breathe.Overall, Mikado was just okay - but definitely nothing to write home about. Still, Mikado is undoubtedly the best option for those of you who live out in the suburb. If you are craving sushi, but don't feel like driving out to Downtown, then consider Mikado as one option.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2008-07-09T00:00:00.000", "review": "Having dinner with a girlfriend recently, we popped into Mikado for dinner and drinks.  It was crowded, it was hopping but I'm not sure why. The restaurant felt warm and kind of sweaty for some reason- not good qualities for a place serving raw fish. Meal choices were basic and kind of blah- not that many exotic choices of rolls and cooked \"meals\" felt strange- my teriyaki was simply protein with sauce on it and a side of green beans. I could have made that at home. Oh wait, they added a flower on the plate. Wow. It also came with a side of white sticky rice. Thanks so much. I'm quiet underwhelmed.My friend had a California roll- there aren't many other choices really and a mixed tempura plate. It also came with sticky rice.Wait service is friendly, smiling, just fine.I don't have anything else to say- there's nothing remarkable about the place or the food.  I guess if you love vanilla ice cream, this is your place.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2008-08-26T00:00:00.000", "review": "Thai is a decent place to eat but definitely overrated. I could have given it 4 stars but didn't because it could be a little better. All the food is plated beautifully and tastes delicious to boot. It does serve its own alcohol so there is no need to BYOB. The staff are very professional and listen attentively to you. The dining room is small but the decor is quite lovely and inviting. Very nice decor inside.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2008-01-30T00:00:00.000", "review": "There's a lot to like about Mikado, from the high-quality sushi to the very attentive service. It can feel a little cramped unless you're in the sunken tables on the first floor. If you're pressed for time, try to get a table on the first floor. The service upstairs is fine, but because the servers are going up and down the stairs a lot, it's not quite as quick as downstairs. Still, it's not been a real problem on our visits.The sushi here is quite good. Along with Ginza in Narberth, it's our top choice for sushi in this area of the Main Line. We think it beats Sushi Land, Samurai and Fuji Mountain in nearby Bryn Mawr, but everyone has their own sushi preferences. Specialty rolls are tasty, fresh and generously sized and there's a good selection. Volcano roll could use a little less sauce, but is still excellent. Dragon and Godzilla rolls are other good choices, and the shumai and gyoza hit the spot. The fried oysters appetizer not so much. Mikado also has a decent wine and beer list with several Asian beers like Kirin Ichiban, Sapporo and Asahi, and they're reasonably priced as is the food. Highly recommended.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2008-07-07T00:00:00.000", "review": "Mikado just absorbed their former neighbor, Thai Pepper, so their menu now boasts Thai specialties like spicy chicken salad and red & green curries. Now they have a ground-floor room with regular tables that are handicapped-accessible, unlike the room with the nifty, if awkward, sunken tables.On this particular visit, we stuck to Japanese vegetarian basics: edamame, inari (sweet tofu skin over sushi rice), seaweed salad, miso soup, tempura vegetables. All of these dishes were good, if not stunning, and they were very reasonably priced. The best part of our meal was the fragrant green tea.Mikado isn't going to knock you off your feet, but it's a pretty decent place for a meal.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-01-03T00:00:00.000", "review": "Incredible food. 5 star quality food at $$ prices. The menu is simple with its classic and staple dishes. So you won't find any exotic or fusion choices at a 5 star restaurant. But everything the 7 of us ate was PERFECT. The tofu red curry to rice dishes to the sushi to even basic edamame and green beans. All of us have lived and travelled in many us cities and all agreed this was a top Japanese experience at any price point.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-05-02T00:00:00.000", "review": "I say a 3 1/2.  I like to order from here and enjoy that they combined now, as I am often in teh mood for suishi and thai! I love the lunch specials and their pad thai is good.  Enjoyed the lemon grass soup & coconut soup. The duck is delish and pretty much everything i have had is pretty solid. the decor is ok nothing too exciting but the location is very central and a good place to go.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-06-16T00:00:00.000", "review": "I never had a bad meal here!!!Try the Basil Chicken!  I don't know about them since the merger... :/", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2012-04-02T00:00:00.000", "review": "Good food, kinda uptight atmosphere. That's the Main Line for ya.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2014-07-26T00:00:00.000", "review": "Strange concept with decent food. The restaurant itself looks like 2 separate restaurants that the owner decided to merge. On one side the decor is very Japanese and the other is Thai. We ordered 1 poseidan roll and a panang duck. The roll was alright but overpriced. The duck was pretty good but not that memorable. If you're in the mood for Asian variety this place isn't a bad option if you don't want to go far.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2007-04-27T00:00:00.000", "review": "For a Japanese restaurant, Mikado is moderately experienced, but reasonably priced. The decor is traditionally minimalist. Most of the downstairs seating consists of sunken booths, which isn't the most handicap accessible, but there are regular table-and-chairs seating available as well. Mikado also has upstairs seating for overflow. I'm not a sushi eater, but my friends found the rolls to be fresh and well-constructed. I thought the edamame and chicken teriyaki was delicious, so if you don't find raw fish delectable, you won't go hungry. I also highly recommend the green tea ice cream. I really have to commend the wait staff; they were attentive and accomodating. It's a great place for groups, and when you've got money to spend.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2007-06-28T00:00:00.000", "review": "This is my neighborhood Sushi Place, and it happens to be excellent.I realy like the volcano roll, which is a spicy tuna roll, arranged in the shape of a mountain, with this crazy spicy tuna lava dripping all over it.The sashimi is high quality, too.  On the days when I feel vegetarian, there are still lots of good options for me.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-04-05T00:00:00.000", "review": "This was a solid sushi place. I wouldn't rave about anything here, but the Godzilla roll was really good. It had strawberries and honey crunches on top. We also had the soft shell crab roll and the salmon asparagus roll. I didn't expect the salmon to be cooked, and I'm not a fan of cooked salmon.  it would have been really good raw. oh well. The plum wine was so good, tasted just like a dessert wine. They had an impressive sake collection too. The decor was a simple typical sushi place, and some of the tables were at floor level and had a hollowed out floor, so that it looked like you were sitting on the floor, but could actually dangle your legs. It's a little touch to describe. The rolls were average price, maybe a dollar or two more, and the server was darling.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-04-19T00:00:00.000", "review": "These two restaurants- Thai and Japanese are now combined with two rooms and joint Staffa be kitchen. The results are not bad. Decent wines (some bottles were half off when we went).I had the panang duck, my wife had chicken Mussaman curry. While not as spicy as I prefer, the food was tasty and the wait staff did a good job.We would visit again when in the area.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2008-07-12T00:00:00.000", "review": "Sushi Land gets better reviews than Mikado??? That's a travesty!Okay, so maybe I'm biased -- a friend of the family took me out for my first taste of sushi at Mikado YEARS ago, and I've been a sushi addict ever since. I've been to the majority of the sushi restaurants on the Main Line, and I even visited my cousin in Okinawa Japan and had sushi daily for a month, so I feel pretty confident in saying that Mikado is one of the best I've had in our area.I've never had a bad meal here -- all the special rolls are tasty (and the dragon roll on fire [think that was the name] was just plain amusing), the tempura is great, the sukiyaki is delicious, and the lunch menu is reasonably priced. As a bonus, Mikado is now owned by the same people as the Thai Pepper, so they've added some interesting Thai dishes to the menu as well as the VERY addictive Thai Iced Tea.Also, as an interesting side note, the person who took me to Mikado for the first time had a Japanese exchange student living with her. This girl had gone to every single Japanese restaurant in the area, looking for one that served rice with the right amount of stickiness, and she said that Mikado cooked it perfectly.The wait staff is always very friendly and very prompt. I've had slow service maybe once, and that was on a night where they were severely understaffed, so it was unusual. Also, as other reviewers have mentioned, the decor is neat with the depressed \"pseudo-traditional tables\", a gimmick I've never seen in any other Japanese restaurant.I've been to the restaurants around here enough that I tend to go to one over another if I'm in the mood for a certain dish (for instance, Samurai has the best chirashi I've ever had), but as I've never had a bad meal at Mikado, I often choose them over the others.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2011-04-08T00:00:00.000", "review": "The Unaju (broiled eel over rice) dish I had for lunch today was awful. The sauce smelled metalic and the eel was not very fresh. When I asked the waitress for a explanation why the sauce smelled weird, she offered none but stated that they don't sell many of this dish. So, that should have been my hint to not touch the dish. However, against my better instincts, I proceeded to eat it and for the rest of the afternoon, worried about whether I would exhibit food poisoning symptoms or not.", "stars": 1, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2011-10-28T00:00:00.000", "review": "We have been going to Thai Pepper for years and never had a bad meal here. Tum Yum Soup, Pad Thai, Curry Chicken, etc. I love them all. You can also order good sushi and other Japanese items from Mikado (the two restaurants are adjoining and you can order off either menu). Service is good, and the prices are moderate. I highly recommend it!", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-01-21T00:00:00.000", "review": "Dramatically attempting to be an upscale sushi place, they really do try to look the part. Alas, the food just does not deliver (especially for the over-bloated price!). How do you make kobe beef taste lame? Too sad. The Thai food is equally uninspiring. This place will remain packed because of the location, not because of the food.As for kids - the staff seem ok with them. The other customers seem uncomfortable at the sight of them. I'd live the kids home (or better yet, spend your money elsewhere!).", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-04-05T00:00:00.000", "review": "The Godzilla roll is amazing with the strawberries, avocado, and honey crunch! The soft shell crab roll  and bar b q eel were very good as well. The waitstaff is very very kind.  I've only lived in Ardmore for 4 weeks and I've taken three different friends there.  And have enjoyed it everytime.  I also love the sweet iced thai tea.  It's so so good.  The decor is really nice too.  They have these tables that look like you're sitting on the ground... but really there's a chair in the floor.  It soften any awkward mood for a date.  Another good thing about this restaurant is that you can order thai food here as well, just in case you bring a non-sushi fan.The only thing is it's a little expensive.  My friend and I got a glass of wine, an iced tea, and 3 sushi dishes for about $48.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2011-06-02T00:00:00.000", "review": "I only ate thai at this combined Japanese and Thai restaurant  This is not awesome Thai food, but it's a decent way to get your Thai fix in a pinch. The restaurant is clean and simply decorated. The food is pretty tasty. I enjoyed the Thai soups and green and red curries. The thai menu is limited to very standard fare.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-03-30T00:00:00.000", "review": "Such a cute little place! Great ambiance. Good food. Polite service. I'll definitely return.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-09-25T00:00:00.000", "review": "Japanese items - pretty good / not badThai items - limited, and best to go elsewhereThe overall atmosphere - very strange.   Thai food and Japanese food together?  I am sure that there is a historical/legacy reason for this.   This strange combination does not instill much confidence.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-04-27T00:00:00.000", "review": "Went here on accident when I wanted to go to Siamese Princess. The food was actually good, but there wasn't a very big selection on the menu for thai food. The service was super slow but the girl did a good job.GET THE MANGO SORBET FOR DESSERT. It was really really really good.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-04-01T00:00:00.000", "review": "I have dined in great restaurants here and abroad for sixty years..  At Thai Pepper last night I enjoyed two dishes that are as great as any I have ever had:  the Chilean Sea Bass with a mustard sauce, and a desert, Ginger Creme Brulee. The desert was among the two or three best I have ever had: a creamy creme base topped with a crunchy sweet but not overly so, browned ginger topping.  Divine.  The sauce on teh sea bass was the stuff of fantasy. I have eaten here four times, and each time the menu seems to be getting better.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2013-01-23T00:00:00.000", "review": "This is one if my favorite restaurants. I've been here so many times, dinners, lunch, group dinners. It doesn't matter which side you sit on, you can pick from both menus, obvi the place is split up, if you really want to sit on a specific side, just ask and make sure you make a reservation on weekends.  Great food, great atmosphere, great service. Try it!", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-07-02T00:00:00.000", "review": "Another confusing Japanese/Chinese/Thai combo restaurant. Great space inside but the Tatami room was a little odd - they have holes cut in the floor so you actually sit western style. it was entertaining to watch people get in and out. Menu was suprisingly lite on Thai standards - basil, lemongrass, pad woonsen, tofu todd. Had all the chicken and shrimp you could want, but very little beef other than steaks, which I don't think you would find in Thailand.They served a strip steak with a slightly fried jasmine rice - very tasty. Tried the tofu pad thai, tasted like a japanese or chinese version - a little saucy. The chicken and basil was a grilled sliced chicken breast topped with veggies and brown basil sauce. Good, but not Thai to me. Pricey at $80 dinner for 2 with no drinks. Good service.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-05-26T00:00:00.000", "review": "Mikado is a mediocre Japanese restaurant that merged with the mediocre Thai place next store. If you are really hungry for Sushi and don't feel like leaving Ardmore, its one of the few options. The service is actually decent, but Sushi quality is below average. People who are giving this place 4-5 stars need to get out more.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2011-12-30T00:00:00.000", "review": "i wanted to like this place. the staff here was very nice and attentive. i was seated on the \"mikado\" side which was very cute and \"traditionally\" japanese. my friend and i both had the miso soup and 2 rolls of sushi each. the soup was fine and a generous portion. i had the mixed veggie roll and the popeye roll, both of which had cold steamed spinach in them, which wasn't exactly what i was expecting when i read spinach as one of the ingredients. the popeye roll was basically a giant lump of cold steamed spinach wrapped in nori. it was so unappetizing i couldn't even finish it. i haven't tried any of their thai dishes so i can't speak for them but i would probably not go here for veggie sushi again.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-02-28T00:00:00.000", "review": "My first introduction to Thai food and Spicy Chicken Noodle. The best Drunken Noodles I've found.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-02-15T00:00:00.000", "review": "We've been back numerous times for one thing or another and I think the sashimi and sushi has gotten better.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2008-09-07T00:00:00.000", "review": "Not great. I got take-out from here once, after hearing great things about it from friends. I ordered a chicken dish with broccoli, and it was dry and unexciting. I've had much better Thai food at other locations near here.", "stars": 2, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-03-06T00:00:00.000", "review": "i think mikado is great! you can order japanese and thai in the same place! now that usually would overwhelm me with so many options but you can mix and match, and i usually take out from here so i can make it into like 3 meals. I usually get the chicken pad, salad, shumai (the best i've ever had). my body starts to crave this combo weekly! for what it is (they're not trying to be some award winning trendy hot spot), mikado thai pepper is great! it's nice enough that you feel like you're indulging but not too much that you need to bother getting dressed up. i definitly think it's one of the best japanese places on the main line, and the only thai place ive tried.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2011-08-19T00:00:00.000", "review": "Because there are a couple sushi places in the area I like better than this one, I probably won't go back. Not because it was bad - just because there are others I prefer. I think it's weird that Mikado just plain can't use brown rice for your sushi instead of white. They just tell you they only use white. That's annoying but not the end of the world. Overall, it wasn't bad, but again, there are better places on the Main Line, like Samurai in Bryn Mawr.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2011-08-14T00:00:00.000", "review": "We've only tried a few of their Thai lunch specials and some of them are actually pretty good.  The spicy chx noodle (it comes with a side of iceberg lettuce) and salmon terriyaki are good.  They leave the crispy skin on the salmon which is great.  The chx curry is ok.  The chx terriyaki is bland and generic.  Overall the food is pretty average however, for the cost of some of the lunch specials, it's a good deal and again, not bad.", "stars": 3, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-08-24T00:00:00.000", "review": "Great food the spicy noodles are veryy good!", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2010-11-04T00:00:00.000", "review": "i have been living on the mainline for years and have tried numerous sushi places and this is by far the best one! always fresh and the service is good.  the other food besides sushi is delicious also.  whenever my family comes to visit they insist we go to mikado!", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-06-06T00:00:00.000", "review": "The decor and ambiance is lovely, as is the front of the house service.  The sushi and noodles are excellent, if a bit overpriced, but the desserts are well worth saving room and money for.  The tempura baked ice cream was excellent.  The Thai options next door were also above-average fare.  This is a great place for groups unable to settle on what to eat since you can order from both houses in both locations.", "stars": 4, "venue": "Mikado Thai Pepper Restaurant"}
{"date": "2009-05-01T00:00:00.000", "review": "I've been here quite a few times, I've always had decent service and the food has always been good.  They have some great lunch specials like combination platters for $10 and they're awesome and a god amount of food.", "stars": 5, "venue": "Mikado Thai Pepper Restaurant"}
