{"stars": 5, "review": "This place is awesome. It's been around for nearly a century and not much has changed. It has an authentic vibe that you won't find anywhere else on the main line. The bar literally has a phone booth in it. It's totally unique and is a staple in the area. The bathrooms are a little funky, but it's all part of the experience. The beers are cheap and the hot dogs are delicious. This is a great place to stop after work for a bite. It is a smoking bar, so thats something to consider, but I didn't find the smoke to be too overwhelming around happy hour. Lots of character! Check it out", "date": "2019-03-20T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 5, "review": "This is THE ultimate dive bar on the mainline, you can smoke inside, play darts, use the juke box and play your favorites tunes and enjoy cheap dollar beers. The food is bar food which despite cheap as well is very filling and tasty. Besides the cheap drinks there are also quality beers and booze at very affordable prices. Occasionally celebrities like Charles Barkley show up there. So it is a dive but with mostly non dicey people, excellent hangout place", "date": "2018-12-10T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 5, "review": "Great little dive bar right here on the main line. Don't expect anything fancy but the food is good drinks or cold.", "date": "2019-02-02T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 5, "review": "I love this place.  It's a local bar with a decent bar menu with good prices. The bartenders take care of you, the other folks at the bar (at least during after work hours, the only time I've been) are friendly.  It is decidedly not fancy, and if you are looking for ultra premium drinks probably not the place for you.  If you want a spot to stop after work for a few drinks and fun bar talk, you can't pick a better spot.I only get to visit 3 or 4 times a year when I visit relatives in the area.  It is always part of the trip I look forward to.", "date": "2017-09-26T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 4, "review": "dive bar through and through. onion rings & fries surprisingly good. there were some regulars when we arrive but overall very friendly atmosphere.", "date": "2018-10-21T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 5, "review": "This is a wonderful neighborhood bar with friendly clientele and a wonderful staff. The beer is cheap, the burgers are delicious and the service is great. What more can you ask for?", "date": "2016-11-18T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 4, "review": "What they lack for in craft beers they make up in food quality and value. Smoker friendly.", "date": "2015-05-26T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 5, "review": "Best old time shot and beer bar on the Main Line. Huge burgers, chicken salad sandwich is very good, and how do you beat $2.00 pints of beer?", "date": "2013-11-13T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 4, "review": "Dive bar. Smoking permitted.PBR on tap. Cool bartenders.I like this joint.", "date": "2011-06-09T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 4, "review": "I only went to this bar once, and it was to drive my neighbor to the airport. he told me to be ready at 4am, and his flight was at 7am. i checked the math, and it made sense, so I said OK.  it turns out his airline had not accounted  for some type of cloud formation, you know like stratus or nimbus or some shit like that. so when got to the airport, his flight was shutdown.Instead of going home, he said he had to stop by somewhere. well it turns out Roaches was the place we had to stop by. its an elegant little joint, sprightly perched on the troves of Lancaster ave. i figured my neighbor had been here before, because everyone there knew him. the beer was cold and served quickly. it was actually bustling, as Roaches opens at 6am or so to serve the night crew workers. i had a great conversation about one guy who is saving up to buy the internet. he said he heard being online was awesome, and I got going about Yelp, and it was just pretty awesome.you may want to keep an eye on your wallet, as a few less-then-savory characters were present. this was about 10 years ago when I went. i remember because it was around the same time as Y2K bug. that was a bad time in my life.", "date": "2010-09-03T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 5, "review": "Roach & O'Brien's has the second oldest PA liquor license on the Main Line (Lacy's Tavern, later You Bet Your Life, later still Mallory's, now The Grog, was first).A great drinking person's shot and beer joint. Look for the real Emmy Award statue above the bar... A long story, but Frannie will clue you in of you ask. The place is small and gets crowded on special nights. The ball game is always on and the guy on the next stool  will gladly share his (usually expert) opinion on why the team in question is either doing well or not so much. I mean these guys know up to the last at bat averages on everyone.That said, I stopped being a shot and beer guy long ago. The reason I still stop in is to grab a booth on the back for a burger and onion rings.Without doubt the burgers at Roachies are the best. Fresh meat hand formed, toasted hard roll and cooked just right. Go at lunch and Frannie O'Brien himself is both cook and waiter... And be ready to hear the latest joke.  A neighborhood taproom in the best sense of the word. Hungry for a real burger? RUN, don't walk to Roach & O'Brien's.Fun Fact: AA rents the storefront next door to hold meetings. A little too ironic.", "date": "2011-12-29T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 3, "review": "I like roaches mostly because i can get a cheap beer and their bacon cheeseburgers are pretty damn good. Now if your looking for something other then a dive bar you can smoke cigarettes in then keep on walking.Its the kind of place that still has the softball trophies from the early 80's hanging out all over with some antique radios and a god damn phone booth in the middle of the bar. i shit you not...a freaking phone booth with one of those big phones you put change in. Who has change anymore? Its probably the only stand alone phone booth on the whole main line. Get this...I come to find out that it is the bar phone too. Hello Roaches!!!!.....payphone. haha. Old school dart board with real sharp darts. Fun. Now onto important thingsThe jukebox. This is the most technology that has entered this bar in 20 years. The still have tube TV's...no flat screens...and the 2 TV's aren't even in front of the bar. You have sit with your head turned sideways...anyway, back to the crazy future music box.   The jukebox has a decent selection and if their is an artist you like but the song you want isn't on the list...you can download it right there. Cool. So I put my money in, choose a song and blammm!!! The music starts screaming out of the sides of the Jukebox. Yep....not a single speaker through out the bar. All the sound and power is flying out of the box. Now try having a conversation while sitting next to that. It was difficult and comical at the same time. Roaches is about cheap beer and experiences....and every-time I've been there I've had some kind of experience. Either from 1980 or the FUTURE!!!!", "date": "2010-01-29T00:00:00.000", "venue": "Roache  Obrien"}
{"stars": 5, "review": "went there 2 wks ago for my 50-yr haverford reunion. place was packed every nite, rightly so: except for the prices, it coulda been 1963, and the prices are still affordable. lotsa beer, plus burgers, an analog jukebox and a dart board that looks like it's been there since, oh, 1947. an astute fella reunioner found that  the db gets changed every three wks but always with the same model. this is not a fancy place--eg, i don't recall ever seeing a menu. in 1964 i asked the father of the present owner for a cheeseburger and a coke. he said, \"this ain't no restaurant, kid.\" if you're near there, go. if you're almost near there, also go", "date": "2014-06-15T00:00:00.000", "venue": "Roache  Obrien"}
