{"review": "We met up with my parents for a quick lunch here, and we all had a good time. The ambiance is pretty nice, and it's in a good location. There's plenty of parking nearby, and it's right on Lancaster Ave in the downtown area.Each of us ordered a dish, and the experience was great overall. The food came out quickly, and all the food tasted good. We had chicken korma, chicken tikka masala, dal, and chicken vindaloo. The vindaloo was delicious and had some nice kick, but unfortunately I did find a few strands of hair in it. Everything tasted great, and they were generous with the rice!Overall a good experience, and I would eat there again. One nice touch on their website is that they clearly denote the allergies that should avoid certain foods.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2019-04-05T00:00:00.000"}
{"review": "So relieving when restaurants actually indicate allergens on the menu - takes the guess work out of ordering gluten free.  We came here for lunch on Saturday, pretty quiet.  I ordered the dal tadka (yellow lentils), a far deviant from my usual chicken tikka.  It was a real wildcard for me b/c I never had it before, but no regrets whatsoever!  It was very tasty, and the portion for lunch was very generous.  I had leftovers to take home.  I ordered it medium, and it was spicier than I anticipated, so maybe go mild if you're not in the mood for spice.  Everyone else also enjoyed their dishes (chicken korma, chicken tikka, chicken vindaloo) so I would come here again.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2019-04-03T00:00:00.000"}
{"review": "Delicious food, delivered fast, and arriving warm and ready to eat. I got several different sauces with my naan that were great and I would not have selected on my own. The balsamati rice was perfect, not too sticky and not too soft. I had the shrimp and it was excellent. The crispy cauliflower was perfect.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2019-03-17T00:00:00.000"}
{"review": "Always one of our favorite places (and our favorite Indian restaurant to go before or after a movie (across the street) or whenever we're in Bryn Mawr.  The food has been consistently good and the are staff very nice.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2019-04-01T00:00:00.000"}
{"review": "I've ordered delivery and also ate in the restaurant. The food is good, the aesthetic is alright. Service in the restaurant is quick and friendly. Delivery can be hit or miss. Sometimes they're really delayed in delivering my order? But then they send extra naan or something. If you have to get one dish, I'd say get the butter chicken.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2018-05-11T00:00:00.000"}
{"review": "Service is beyond horrible.Walk in to an unwelcoming staff member, so be it. Not asking for much there. Sit down, get not 30 seconds later I'm asked if I'd like to order. \"Ok, a little fast... but I rather fast than never.\" I ask for another minute. I'm ready within the minute and push the menu to the other side of the table to show that I'm ready. I go on my phone to read the news. \"It's been quite a while...\" been about 4 minutes. I attempt to waive over a staff member but behind the kitchen divider table they just stare past. I continue on my phone. Finally after 7 minutes someone comes over, but not for my order! They want me to move tables! I do because there was a larger group but still the waiter did not ask for my order I had to tap his shoulder as he walked away to say \"I'm ready to order.\" Absolutely horrendous service before even ordering. Oh, and before I forget, the table I moved from was not even used for the larger group. Sat open the entire meal.Service remained lackluster throughout the meal. Food was good, but unexceptional.I highly recommend elsewhere. I've not been to Ekta but I've heard good things. I'll definitely be going there next time.", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2019-04-13T00:00:00.000"}
{"review": "Delicious! I got the chicken korma, samosas, and naan and was completely full. One curry can easily feed two or last you for two days. My only two complaints are that A) the cost, as is with most Indian restaurants, is very steep. And B) the parking isn't great. But the interior is really cozy and intimate. This would be a great place for a date!", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2019-02-18T00:00:00.000"}
{"review": "Solid Indian chain for some mainstream Indian, which is not necessary a bad thing. You will find all the tandoori, tikka masala, Korma and naan breads. All solid and tasty. As this is a BYO is a plus too. Inside is very basic and casual and many people use their take out. We prefer their curries which you customize with your choice of protein and well as the tandoori grill.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2018-02-13T00:00:00.000"}
{"review": "Fantastic korma!!!!!! Wow,  packed with flavor and absolutely delish. We got Paneer Korma and chicken curry w roti and naan. The curries come w rice. I will be back when in town.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2018-05-21T00:00:00.000"}
{"review": "Really amazing food. We usually have trouble finding good Indian options in this area, but Tiffin's dishes never disappoint! Particularly love the Paneer and Chicken Tikka Masala dishes.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2018-08-11T00:00:00.000"}
{"review": "Great food but four stars because the seating and decorations are a bit boring. I know they must have good business because they have been open for so long but there was only like one or two other tables with customers during our meal there. We got vegetable korma and paneer masala and they were amazing!! Definitely good for the area but might do take out next time", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2018-01-14T00:00:00.000"}
{"review": "The service is not bad and the people were nice, but the food is not worth the price. We ordered the lamb and it was served cold and the rice was undercooked. It was very little food and the meat and rice were both very dry that was hard to eat. They were not freshly made and not even warmed up enough. For the price there are better options than this place and better Indian restaurants. Hope this was a one time thing and they do better.", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2018-05-28T00:00:00.000"}
{"review": "We visited this location for a work lunch. Initially we ordered for pick up but when we walked in it was completely empty and decided that we would dine on. The staff seemed annoyed at this - not sure why because we ordered for about six people. This included entrees! Anyway- the food was awesome. I'm really surprised. I had avoided this chain simply because I'm Pakistani and am often disappointed by American-Indian restaurants. I loved that they offered various spice levels. I ordered the chicken tikka masala with rice and naan, channa masala, and samosa chaat. All were extremely tasty! The chicken tikka masala especially! I would definitely recommend the food for carry out. Didn't have the most pleasant dine in experience unfortunately. Had to get up several times to ask for water refills.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2016-07-27T00:00:00.000"}
{"review": "The was good although the relationship with yelp does not work well.  Time to pick up was off by 20 min, cost was wrong They told me to call instead instead of going through yelp24", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2018-04-23T00:00:00.000"}
{"review": "Average Indian fare. I'm curious if some of their dishes are premade and frozen or reheated to order. This is okay in a pinch but There are much better options for Indian. Even in the suburbs. My old office used to eat here all the time and loved it...but I never understood. I have tried a good number of Indian and Pakistani restaurants and can name many I prefer.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2017-03-15T00:00:00.000"}
{"review": "After waiting an hour and a half for delivery, I called to check on my order's status. The man on the phone hung up after \"it's on the way\" as I was asking if there was anything he could do to compensate. The food is usually great, but when it takes an hour and a half to get to you... Food was completely cold, soda was warm. I had to process my own credit card because the delivery person kept typing in the number wrong. You can keep my \"t-coins\" - I'm not ordering again.", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2018-03-19T00:00:00.000"}
{"review": "I usually eat at the one on Girard Ave.  This was perfectly acceptable. But nothing special. Dinner for 4 was $60 so it's reasonable. Tiffin brings Indian to the masses. I guess that's a good idea. Right?", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2017-06-23T00:00:00.000"}
{"review": "I have been to thousands of Indian restaurants in pa and nj Tiffin has the best tasting chicken tikka and butter chicken. I order from from all the since I moved here. The price is a little high but worth it for the taste.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2018-02-13T00:00:00.000"}
{"review": "The Tiffin in Bryn Mawr is my favorite Indian restaurant in the area! I have been coming here for years and the service and the food is exceptional. I always order the Chicken Tikka Masala and it is so creamy and seasoned very well. The employee Subash is the nicest guy, and personally made me a new order of my favorite dish when the one I received for dinner wasn't up to par. I've come here both for lunch and dinner, and at each dinning hour the food was delivered in a timely fashion and water was always refilled, I absolutely love this place and would recommend it to anyone who is looking for a great Indian food restaurant!", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2017-10-08T00:00:00.000"}
{"review": "I'm regular customer at Tiffin, we love their take out.  The other day their system went down and my order never arrived. I called to cancel and complain. They apologized and gave me a credit of $33.92 to use for the next order.  Today they really tried to make it right and the order arrived half an hour early, I wasn't home yet so they had to come back a second time, $36 meal cost only $2 and $8 tips.  I appreciated the gesture and that's how good business should run.  Hey, I ordered chicken vindaloo but it tasted funny, turned out it was lamb. oy! Thanks for trying guys!", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2018-04-25T00:00:00.000"}
{"review": "The food was delicious and certainly fast! The people were very gracious and we enjoyed our dinner very much. The to- go process via internet was easy and user-friendly! Only very small problem was the Samosas crust was not flaky but a little chewy. All in all the meal was great", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2018-07-28T00:00:00.000"}
{"review": "Just okay.  We had the following:1. chicken kabob marinated in yogurt: solid and generously portioned.2. fried cauliflower with cheese and spices: eat it as soon as it is served as it is only good when fresh out of the deep fryer!3. malai kofta: pretty bland and lacking that creamy flavor burst4. chicken korma: solid with a good, creamy flavor.  This was pretty good and was fantastic with the garlic naan.5. garlic naan: pretty standard naan although it was slightly doughy and there was no brush of ghee6. peshwari naan: just okay.  The blend of sugar, coconut, and raisins was decent but the bread itself was on the thick side.  7. kheer: solid and creamy but not overly sweet.Overall, it's decent but nothing to rave about.  Still does not compare to Desi Village in KoP.  The seating is also very cafeteria-esque with hard wooden chairs and tables.  It's definitely more of  take-out option.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2015-11-13T00:00:00.000"}
{"review": "I usually love the food here but the last few times I've eaten here my food has been really mild even when I've asked for it extra spicy.", "venue": "Tiffin Bryn Mawr", "stars": 2, "date": "2018-02-12T00:00:00.000"}
{"review": "I've eaten at both locations BrynMawr and DekalbPike and both were excellent. Pumpkin Lamb at brynmawr location and shrimp chettinad with onion bhajji at dekalb pike. service was quick and pleasant. food was great, a definite go", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2017-09-23T00:00:00.000"}
{"review": "Really disappointed with the food at the Bryn Mawr location. The Mt. Airy location has great food, so I was anxious to try Bryn Mawr. The Tikka Masala chicken was overcooked and it was so spicy I didn't eat much of it...they gave no sauces to accompany the dish...definitely not worth $14 and a 15% tip...I won't be eating here again. The counterperson was pleasant though which helped getting the 2 star rating...", "venue": "Tiffin Bryn Mawr", "stars": 2, "date": "2017-09-29T00:00:00.000"}
{"review": "Giving low rating on account of an almost 2-hour wait for food to arrive via delivery.Naan was dry.  Palak paneer was decent.  Samosas we're good.", "venue": "Tiffin Bryn Mawr", "stars": 2, "date": "2017-08-02T00:00:00.000"}
{"review": "The Daughter and I decided to have a little something something and stopped here late in the afternoon. It was too late for the lunch special and too early for dinner. So we got a bunch of appetizers which was perfect!Vegetable samosas were good - I've had much better down the street and if you're from around here you know which establishment I'm talking about. Now the Onion Bhaji was so delicious I could have ordered more and then more to take home. For me they were perfect!Chicken Kabob was perfectly seasoned chunks of yum on a plate.The Cheese Kulcha was the first time I had this type of naan and it won't be the last.The Daughter had the Chili Naan and was having a mini eyes rolling in the back of her head moment. It was that good.They serve all this with three different chutney/sauces all delicious.Our server was very sweet and pleasant. We were the only people in the restaurant so everything came out quickly and it's a nice clean modern feel.Definitely will return to try more dishes!", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2015-08-14T00:00:00.000"}
{"review": "The food is okay, but if you're ordering delivery, don't bother. The last time I ordered, it took over 2 hours to arrive. I ordered again tonight and it took an hour and 40 minutes. This place is 8 minutes from my house. There's no excuse for this. When I called (repeatedly) to inquire about my order, I was given no explanation or apology, just an \"it will be there soon.\" (Spoiler: It wasn't.) Either pick it up yourself or order from a place that hires a sufficient number of delivery drivers. I won't be eating here again.", "venue": "Tiffin Bryn Mawr", "stars": 2, "date": "2018-02-14T00:00:00.000"}
{"review": "YUM!! Came here for dinner on Saturday night without a reservations, and they were able to seat our party of 7 right away! Service was very attentive! They were constantly filling my water and checking in!I ordered the paneer butter masala and it was heaven!! The paneer here is my favorite! I don't know if they make it themselves, or just use pre-made, but it taste better than any other paneer I've had. The portion was plenty and prices were decent!Also tried the garlic naan, which I highly recommend! I wish I was living on the Main Line again just so I can eat here more frequently!", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2015-05-04T00:00:00.000"}
{"review": "Tiffin is pretty decent. There are way better Indian places in the city, but on the Main Line I would choose Tiffin over pretty much anything else. They're always consistently good, I've never had to wait, and the staff has always been nice.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2017-06-03T00:00:00.000"}
{"review": "Average food.  Service is friendly but once we got our food they didn't check back in until it was time for the check.  I had to get up and go to the counter for service.  Wasn't that busy.  Sauces are good in korma and tikka masala.  Chicken is a little over cooked.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2017-06-02T00:00:00.000"}
{"review": "My favorite Indian place in the burbs. Food is delicious and prices are reasonable. Definitely my go to choice for Indian.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2017-04-11T00:00:00.000"}
{"review": "I'm giving Tiffin four stars, but it has some issues.  The good news:  This place has the best sauces ever.  Chicken Tikka Masala, Dal, Curry -- all had intensely flavorful sauces without being too salty, too greasy, etc.  Bread:  All the wheat bread (Roti, etc.) was perfectly baked.  Now the bad news:  There's not enough meat in their dishes.  The Lamb Pumpkin Curry seemed to have no lamb.  The perfectly cooked chunks of chicken in the Masala were sparse.  Environment:  It's way too cold.  There's no antechamber to block the cold wind.  That makes half the restaurant unuseable in the winter, IMHO.   If Tiffin would up the meat content, it would be 5-star food.  The cold issue needs a rethinking of their store.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2015-11-24T00:00:00.000"}
{"review": "Delicious Indian food. I have been ordering from here since I moved to Bryn Mawr and I have yet to taste something I do not like. I especially enjoy their butter chicken and paneer butter masala! Yum :)", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2017-11-03T00:00:00.000"}
{"review": "Aaaaaamaaazing amazing flavors. Sitting here in a hospital room with my sibling. Ordered myself dinner since my sibling had an unexpected stay and I was stuck with them. Lamb dish and Naan bread is flavorful. Will definitely keep this place in mind wish they were closer to me", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2016-08-18T00:00:00.000"}
{"review": "I've been here four or five times.  Today I got take out that I thought was good.  I got onion and samosa apps that I thought were good.  I love the chutneys.  We also got Paneer Tika Masala, Chicken korma and butter chicken.  The chicken korma is my absolute favorite.  We get those every time and love it. Today for the first time we tried the shrimp curry and it was outstanding.  It was my daughters favorite. It will definitely be added as a new regular item to order.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2017-03-29T00:00:00.000"}
{"review": "It's all about the bhaji. More here:rowhousegourmet.com", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2016-10-15T00:00:00.000"}
{"review": "I went to tiffin for the first time and had the lunch special. The price was decent and the portions were generous. The samosa that came with the meal was very disappointing. It was pretty tasteless. They also do not give you any raita even though the meal was spicy. The paneer came with mostly sauce and maybe 10 small cubes of cheese. No veggies. It was average at best.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2017-03-24T00:00:00.000"}
{"review": "Nice little place with great service and decent food.The menu is what you'd expect for an Indian place, and they provide excellent service, which makes for a great meal.  The fact that they are conveniently located near the Bryn Mawr theater means that it's a great place to go for dinner before or after a show.I'm not sure I'd go out of my way to visit just for the food, but it is certainly a good choice if in the area.  The place is clean and well-kept and they are very attentive with their service.We'll keep coming back for more!", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2016-01-05T00:00:00.000"}
{"review": "I've only tried the tikka masala here because I get it every time...it's great!  This place is great for larger groups and the atmosphere is really nice.  Everyone I've taken here has loved it and left happy.  Bryn Mawr College is close by and it's a great place for students to come if they want something on a different level than dining hall food/ambiance :)  Across from the Bryn Mawr Film Institute and well worth coming before or after a show.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2016-05-05T00:00:00.000"}
{"review": "First time trying Indian food yesterday here at tiffin. I can say that there is nothing to be afraid of. It's good food. Nothing great or anything that makes me say hey I'm going to crave it again but it was good. Their lunch special for $11 is an absolute deal! So that might make me swing in again for sure. The service was nice and courteous and I really appreciate that because looking and feeling out of place when trying something new doesn't make it easy to eat new food.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2015-03-01T00:00:00.000"}
{"review": "Visiting Bryn Mawr College staying at the Alumnae house on campus and ordered delivery. Food came in the time stated and was very good well flavored generous portions. No utensils or napkins and I had made it clear we were in a hotel room- could have been a disaster but Bryn Mawr came through...", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2016-09-26T00:00:00.000"}
{"review": "I love good Indian food, and Tiffin in Bryn Mawr did not disappoint. I ate for lunch this past week and I was pleased with the food that I ordered. On weekdays (Monday thru Friday) they have lunch specials where you can choose from a variety of Vegetarian entrees, rice, a vegetable samosa and plain naan for $9.00. You can opt to upgrade to a non-vegetarian entree for an extra $2.00. I opted for the latter choice and decided on the Chicken Tikka Masala as my main entree choice. The dish was super flavorful and blended perfectly (not too overwhelming). It left me wanting more despite the generous portions served for lunch! The rice was good, as was the naan which was soft and warm. The chutneys were standard fare and complimented the dish nicely. The vegetable samosa was so so, a little too mushy for me. It wasn't bad, just not my taste. The food came out piping hot and was plentiful for the $11 price paid.In summary, a solid 4 star lunch. I look forward to coming back and trying more dishes. Give this one a try, it won't disappoint!", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2014-11-15T00:00:00.000"}
{"review": "I went alone Mon 9 Mar. (This was one of 3 Indian meals this week, each of which included Vindaloo - my favorite Goan dish). So which is better - Ekta or Tiffin? Bryn Mawr has both and provides a great locale for comparison (which isn't exactly what I did). I had an ordinary, but pleasant Mango Lassi and kinda bland Peshawari Naan with my main dish. I'm not a fan of the dull white bird, but I got Chicken Vindaloo because my gal isn't a big fan of lamb (admittedly, my favorite meat). (My tab including tax & tip was $27.32,) Together, the two of us shared the leftover Vindaloo (her favorite dish) last night, comparing it very favorably to Ekta's, to which it was superior in flavor, if not in heat; I'd definitely get it again. Overall, though, our Ekta/Tiffin comparison proved inconclusive; we'll have to try again.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2015-03-11T00:00:00.000"}
{"review": "Tiffin has now gone to near the top of the list for Indian food on the Main Line. This place is almost always busy and has a heavy amount of takeout traffic as well. With that in mind, on a cold night try to avoid getting a table inline with the door as it will result in a chilly night every time someone enters and exits. Food recommendations. The Tandori Chicken has out of this world flavor thanks to the Tandoor oven. I do wish the Chicken Tikka Masala had the chicken cooked in the tandor as it lacked a bit in flavor in comparison. Vegetarian dishes are almost all delicious with special love for the Baigan Bharta. Mango Lassi is a must drink if you forgot to BYOB.Service is great. Can't wait to be back!", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2014-11-29T00:00:00.000"}
{"review": "This is the best Indian restaurant I've been to. I have been to many Indian restaurants and I believe this one may be the most authentic one. I like the Tikka Masala. mmmmmmm... SOOO GOOD! And the samosas are the best for an app. I come here about once a month.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2016-02-22T00:00:00.000"}
{"review": "Average to below average food.  Went for lunch, and pretty sure the appetizers were  frozen.  Nan was a little dry, as was the chicken in my curry chicken.  Service was disinterested once we got our meal, even though the place was empty. Had to ask for the check twice.", "venue": "Tiffin Bryn Mawr", "stars": 2, "date": "2017-03-29T00:00:00.000"}
{"review": "I'm not the biggest expert on Indian food as I've only had it a handful of times, but most of the food I ordered from here was pretty good. I ordered one of the lunch specials - Tandoori grilled Paneer (cheese) simmered in a creamy tomato sauce/homestyle lentils flavored with tomatoes, cumin and garlic/diced winter squash stir-fried in a tomato onion sauce - and was pretty satisfied with it, although the red sauce on the Paneer was so RED that it was a little off-putting. Interesting way to serve cheese, to say the least, but the lentils were by far my favorite thing on the plate - very good. I also tried the Onion Bhaji which was really good, the red onion naan bread which wasn't bad, and the spicy mixed pickles - pickle lover that I am I had to try them, but I couldn't tolerate the taste of them at all and they ended up in the trash. Some sort of flavor in there just didn't work for me.We had some issues ordering online - I don't know if our computer system was just slow or what, but we had a heck of time getting our orders in before 10 a.m. (which is apparently what you have to do if you order a lunch special to be picked up). It took us a while to connect so that we could pay for it via PayPal (which we didn't even want to do but it seemed like we HAD to). I had decided to order some extra stuff to bring home to the fam, so I had no problem bringing my total over the $20 minimum. Three coworkers decided to put their orders on one bill, but had trouble ordering online, so I went ahead and put their order through on my account (since I had finally figured it all out).  Anyway, lo and behold, suddenly there was a pay cash when you get there option so I guess I went through all that PayPal nonsense for nothing. Needless to say, I don't think I've ever been so frustrated ordering anything online in my life.It also seemed to take forever to get our food which we had ordered to be picked up between 12:00-12:15 p.m. Well, we didn't get out of there until 12:45 p.m. so that was a lot of waiting, especially since we had ordered well ahead of time. The guy at the counter was helpful and friendly though, so that helped.  All in all, it was just an okay visit. Like I said, I don't go for Indian very often so I don't know if I'll wind up here again or not.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2015-03-24T00:00:00.000"}
{"review": "Tiffin offers one of the best Indian food outlets on the Main Line. Even though it's a chain (regional chain, not national), I still find the quality of ingredients, taste, and overall service to be vastly superior to the one-off Indian restaurants in the area. You must try the Chicken Tikka Masala and the Lamb Byriani -- both incredible and absolutely delicious! The service is usually prompt and everything is made fresh, including the bread, which is made on the spot, per order. Prices are a tad high for my taste, but well worth the taste, honestly. The restaurant itself is clean, organized, with decent space. Parking is somewhat difficult (street parking only), but there's little to be done about that.The only reason why I'm not giving Tiffin 5 stars is because it's always a hit or miss on whether they'll deliver the food to my address or not. According to their website, I'm within their delivery radius in Wayne, PA and they have delivered 3 times to me in the past. But 2 of my last 3 orders have resulted in cancellation whereby they call back and tell me they can't fulfill my online order because I'm not within their radius. The online system is based on zip code, so I was left confused as to why my address was excluded. Regardless, a terrific spot and well worth the visit!", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2016-04-19T00:00:00.000"}
{"review": "Went here yesterday spur of the moment.  Overall, food was good.  Baingan bartha was too salty, I told one of the waiters and he said, \"I'll let the kitchen know,\" that's it.  Tandoori chicken was awesome!So service is less than average as most people have said.Price is way way too much.  $14 for 4 small/medium sized pieces of tandoori chicken.  Imagine paying $3.50 for a single drumstick.  The breads were too much as well.Based on price, quality, location and service, I wont be back.  Too many other good Indian restaurants with better pricing.If you like the location and don't mind the high prices then I would recommend it.", "venue": "Tiffin Bryn Mawr", "stars": 2, "date": "2015-04-03T00:00:00.000"}
{"review": "Just came home from our first visit. We went with two little guys, 5 &3 (not ours) as well as our teenage son. The property was clean as a whistle, the waitstaff was kind and prompt..And the food was awesome..Tiffin's menu is much less complete than most Indian places, but what they serve, they serve quite well! We had lots of somosas, Eggplant Chaat, tandoori chicken, naan, basmati rice, Chicken Korma' saag paneer.. all dishes were done perfectly and were tasty.  portions were appropriate. A little pricey, but not absurd or even objectionable, but that's the way it goes out here.. I don't mind paying a few extra bucks for predictably good food...Rest  assured that we will return", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2015-08-11T00:00:00.000"}
{"review": "My review is from an experience not too long ago, but so tragically horrendous, I'm compelled to write about it.Service is profoundly lousy. There were three tables. I waited 10 minutes before anyone came over with menus. Expect to be treated badly for interrupting whatever they were doing.Food is bland. The water has more flavor.Dessert is where it went completely off the rails. I ordered some concoction they called dessert - an indian take on a creme brulee - and it was unbelievably, nauseatingly bad. After one bite, I told the server as much, and asked if I could get something else, or at least ask to have it redone. She said, and this still sticks with me - I took a bite, so there isn't anything she could do. Then she stood there while I contemplated her answer; service was poor up to this point, but I was struggling to understand how their expectation of payment jived with my expectation of not being revolted. I looked over, and she said \"I had it before and I didn't like it either.\" I was dumbstruck. I suppose that counts as empathy, yes?In any event, I paid the bill, left a tip and vowed never to go back.I sincerely hope all Tiffins aren't like this, but I shan't be a guinea pig for that particular experiment. Good luck.", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2014-11-10T00:00:00.000"}
{"review": "Comparatively food better than lot of Indian Restaurants. Prices are little high and serving size is less. I visit here often.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2015-09-13T00:00:00.000"}
{"review": "The Family pachage is awesome for 4 people (which included 2 teenage boys).  Delicious and a GREAT value!!  A new favorite for our family.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2015-06-28T00:00:00.000"}
{"review": "Reliable high-quality Indian place on the main drag in Bryn Mawr. Our favorite dishes are the samosas, chicken tikka and saag paneer.  We have eaten in, ordered take out, and had delivery.  Tiffin has an open kitchen and the restaurant and food prep areas are always very clean. If modern and stainless is \"Americanized\" we are OK with that and have never been sick in 15+ dining experiences at Tiffin's Bryn Mawr and Wynnewood locations.Delivery is sometimes a challenge and we have a couple of times seen Tiffin staff overwhelmed on the busiest nights.  A better option for delivery seems to be calling Main Line Delivery instead of the restaurant directly. Ekta (one block down Lancaster Ave) is also a good option for Indian and has a lunch buffett - but we prefer Tiffin.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2012-08-13T00:00:00.000"}
{"review": "Fallen from grace.  Fallen hard and far.  What a disappointment.Been here many times (at multiple tiffin locations) so we know of what we speak.  It used be pretty good.  Never great but an excellent value for good Indian food at fair prices with competent service.Now....Food is bland, Service is very slow and unresponsive, atmosphere remains fine.  Let's break that down further...FOOD:Inedible Onion Naan:  Cold bread stuffed with rancid pieces so bad we spit it into our napkin.Aloo Papri Chaat:  Watery, soggy, lacking in any significant textural differences and with no distinctive spices.  (What's great about a well done Chaat is that crunch with the pop of chutney and a mix of sweet and sour and herbal flavors.  None of that here.)Paneer in cashew sauce:  Flavorless and the normally smooth sauce was lumpy and unpleasant to look at or eat.   The main thing is... it had almost no flavor.SOME edible food included:*Lamb Chettinad:  Fine.  Nothing great and maybe a small step down from previous times (because it lacked real flavor) but still the lamb was tender and the sauce was fine.*Chutneys (3 kinds):  Pretty good.   No problems here.SERVICE:There were lots of staff... but totally inadequate service.  It was hard to get peoples attention, 3 tables arrived after us and were able to order and receive food well before we did.  Asking for more water, or the check, or anything else was hard.  People seemed to be jockeying about who should wait on which table.  We left ourselves one hour to eat before our movie but didn't get served until 40 minutes after we arrived.  Luckily we didn't like the food so that wasn't a big problem.It was cruel that we went to see \"The Lunchbox\" (a fine movie staring some excellent Indian food) immediately after leaving Tiffin.  We then went home and had dinner.", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2014-04-07T00:00:00.000"}
{"review": "Nice spicy Indian chicken dish. Large portions. I took half home, enough to feed another person", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2012-12-21T00:00:00.000"}
{"review": "Our favorite Indian on the main line! Consistently good tandoori, curries, and the peshwari naan is great.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2014-12-21T00:00:00.000"}
{"review": "Tiffin is clean. Service is okay. The food is okay. For my parent's birthdays we usually try Indian restaurants in the metro area and for flavor and selection we rated this place below average.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2014-06-23T00:00:00.000"}
{"review": "Tried Tiffin after hearing about it from some people and had trouble picking where to eat. I have to say, it was amazing. The ambiance is simple but very pleasing to the eye. The lamb chettinad is what I had and it was flavorful with a slow spice build. The cauliflower appetizer was probably the best thing I've ever had. I highly reccomend it for Indian food!", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2014-08-01T00:00:00.000"}
{"review": "Terribly disappointed. The service was worse than a fast food joint. And the food was tasteless. It seems like they trained someone to cook indian food instead of hiring a chef. Will not be going here again,ever.", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2013-03-06T00:00:00.000"}
{"review": "\"Meh. I've experienced better.\" that's exactly how i felt while eating at Tiffin. it was okay indian food that was very americanized. didn't taste very authentic. it's a great place to go for people that are trying indian food for the first time. the portions were pretty small and service wasn't all that great. it was just okay. decor was nice and it's byob, which is always a plus. extra star because it was really clean.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2011-04-02T00:00:00.000"}
{"review": "You walk in and your like: Wha these people aren't even Indian? How's the food going to be any good? They're from Nepal and they can compete with anyone Indian any day on Indian food. The place has a nice simple decor and everyone is shy but friendly and helpful. The food was good too. We ordered fried balls that go with the chutneys and a \"chaat\" that's chutney'd up too. For our meals, we ordered lots of chicken and veggies in Indian sauces. Can you tell I'm not Indian? Well you don't have to be to enjoy the food here. I'd return.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2011-04-19T00:00:00.000"}
{"review": "Food here was okay. Nothing too special, but not too bland either. The naan portion size was the smallest I have ever seen in my life at any Indian restaurant. It was literally one small naan cut into four slices. And even though we ordered several entrees, we only got one small bowl of rice to share. They ran out of items on their menu, and the waiter started clearing the dishes while we were trying to pack our leftovers, leading to him reaching under us to get to our plates.Also weird was the fact that we ordered a chicken entree, and there was a cube of paneer (cottage cheese) in it. They ended up getting us a replacement entree (but by the time it arrived, we'd already basically finished eating). Again, the food here is not bad, it's just that nothing \"wowed\" us. And the really small naan and rice portion sizes are a bit of a letdown.", "venue": "Tiffin Bryn Mawr", "stars": 2, "date": "2013-03-22T00:00:00.000"}
{"review": "I ordered from here and not only was the food delivered cold, it also tasted like AMERICANIZED Indian food. If you want REAL Indian food, I would look somewhere else.", "venue": "Tiffin Bryn Mawr", "stars": 2, "date": "2015-11-19T00:00:00.000"}
{"review": "I can't speak to the food, because we never received it.  We attempted to order food at 4:15 in the afternoon for delivery.  We were given an estimate of 25-45 minutes.  90 minutes later we received a call from the driver saying they were outside our house (we live in an apartment).  There was some mix up with our address.  We gave them the correct address (they were about 3 miles away at this point).  We called 20 minutes later and were told that the driver took our food back to the restaurant because they couldn't find our location.  They said it would be quickly delivered.  Another 40 minutes later (now 2 hours and 30 minutes from when we ordered), we called to cancel the order.  We received two more calls before they finally agreed to cancel our order and refund out money.  Waste of time.", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2015-10-09T00:00:00.000"}
{"review": "I graduated from Bryn Mawr and moved away in May, but I still think about this place. I have yet to find Indian food to rival theirs.I always ordered takeout and delivery (through mainlinedelivery.com), so I can't say much for the ambience of the place. I always got my food quickly,  and I always loved it.The chicken tikka masala is so rich and creamy; if you haven't already, this is a must-try. I always got two orders of naan for all the sauce. Their naan was good, but it's really the chicken tikka masala that knocked it out of the ballpark.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2011-10-09T00:00:00.000"}
{"review": "Overall, I am pleased with Tiffin's food. It's pretty typical Indian food-- standouts for me are the chicken tikka masala and the samosas (which are large). Everything is really tasty and there is a ton of sauce to go around. But I am not so pleased with the presentation of the dishes. The way Tiffin serves the entrees is to bring out individual plates for you to pile your rice and sauce on, but it gets really crowded due to the extra bowl for rice (especially if you have a small table). An easier way to do things would be to put the bed of rice on the individual plates and bring out the sauces separately. That would make things less cluttered.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2013-04-08T00:00:00.000"}
{"review": "The paneer tikka masala is so amazing that I can't bring myself to order anything else when I come here! I haven't found a paneer tikka masala in Philly that is anywhere near as delicious. I have also had the samosas, which did not disappoint. As someone who can't handle a lot of spice, I appreciate that the food is pretty mild by default. But if you prefer more heat, just remember to ask.The portions are large, which is great because I get to eat it again for dinner the next day. I've gotten take out/delivery many times, which has always been reliable. It's a nice place to dine in as well, especially in the summer when you can sit outside. Service is attentive and helpful. Plus it's a BYO, which is a nice bonus.I have only good things to say about this place. Highly recommend!", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2013-12-28T00:00:00.000"}
{"review": "I stopped at Tiffin with my boyfriend after a movie at the Bryn Mawr Film Institute. We were thinking of going to Ekta, but we saw Tiffin right across the street with a good crowd and decided to head there instead. The food was pretty good, and the service was friendly and prompt. It was a nice cap to our night.We started with mango lassis, which were more yogurt-y than mango-y, but pretty good all the same. When I asked our server to recommend one of the lamb dishes, he steered me toward the lamb saag; my boyfriend ordered the paneer tikka masala. My lamb was tender and flavorful, and the saag was savory and richly flavored without being overwhelming. His paneer was spongy-chewy and pretty good -- I'm not a big paneer fan, but he liked it. And the tikka masala sauce was delicious. Portions were big; we were hungry and eating a late dinner and we still took home some leftovers.There were two disappointing things, though. One, they didn't ask how spicy we wanted the food; they just made it mild. Both of us would have liked a little more heat. Two, the garlic naan wasn't that great -- the naan itself was very good, but there were little bits of minced garlic sitting on top of the bread. They were a bit too raw (I guess it's better than burned) and the garlic flavor didn't penetrate into the naan at all. There has to be a better way to do garlic naan.Still, the important part is that the entrees were excellent and the service was good. I just have to order the regular naan next time.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2013-07-06T00:00:00.000"}
{"review": "Everything was great until we saw the maggot crawling across the delicately placed almonds on our Chicken Korma.  I'm out.", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2011-12-27T00:00:00.000"}
{"review": "Amazing indian food. We called for delivery and had very fast service. The food arrived hot, fresh and super tasty! My husband and I both had the chicken tikka masala - I cannot describe how delicious it was. The sauce was extremely flavorful and rich. We each also ordered the naan which was equally yummy. Along with the order they gave us a ton of rice, 3 dipping sauces, and soup. Overall, excellent service and food.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2012-11-10T00:00:00.000"}
{"review": "Really great indian food. Have also gotten delivery and it is very prompt, although the onion bhaji are sometimes a little soggy from the heat. Just have to pop them in the oven for a couple minutes! Love that they send a ton of rice with each curry order. All the tiffin locations are top notch!", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2012-07-09T00:00:00.000"}
{"review": "We just moved into the neighborhood and walked over to Lancaster Ave looking for a byob dinner. Decided to do Indian food. Got Saag Paneer and Chicken Biryani. Both were very good. Service was attentive without being intrusive. We're looking forward to a return visit to this restaurant.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2014-10-11T00:00:00.000"}
{"review": "Indian food is my favorite kind of cuisine, and this is the best one I've found in the area. I went to college close to here and went as often as I could afford and then when I moved to Wayne I drove all the way back just to get the good Indian food. I now live in Philadelphia and the places I've tried near me do not come close to this. I have a few favorite meals and when I decide to be adventurous it's just as good and becomes a new favorite. Get the naan with any meal, it's a delicious addition to any entree. I highly recommend coming to eat here if you live or travel close to Bryn Mawr! Note: there are more Tiffins in Philadelphia and the surrounding region though I have not tried these locations yet. I would expect them to be comparable to this.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2014-01-27T00:00:00.000"}
{"review": "This is the best indian restaurant around.  The Korma and Tikka Masala dishes are unbelievable, and the food is always fresh, fast, and delicious!  They have new specials all the time which make it very interesting at every visit.  The staff is very nice as well.  Plus it's not too pricey and it's casual!  What more could you ask for?", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2012-09-11T00:00:00.000"}
{"review": "My husband and I tried Tiffin with a groupon.  We were a bit hesitant to try the restaurant because of the negative reviews, but we were pleasantly surprised.  The food was very good.  All of the sauces were nicely seasoned, and the service was attentive.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2014-06-27T00:00:00.000"}
{"review": "Wouldn't classify it as authentic but the food is ok. Some issues with service though", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2014-11-06T00:00:00.000"}
{"review": "This is one Indian restaurant which does not have a buffet. The lunch specials had a pretty good options and I loved their samosas. I ordered Navratan Korma and my friend ordered Paneer tikka masala. My cashew base sauce was pretty good, but the vegetables were undercooked. Their Daal was really good. Good portion of food and I highly recommend to anyone who loves Indian food.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2012-01-08T00:00:00.000"}
{"review": "We get take out from tiffin very often.  Try the tikka masala and the sag paneer, they are excellent.   Sometimes their credit card machine has issues, bring cash as backup.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2012-03-17T00:00:00.000"}
{"review": "My order took 3 hours and 20 minutes to be delivered. The only explanation I got was that they were \"really busy\" and a half-hearted apology from the driver. The food was ok, but I'll not be patronizing this restaurant again after the atrocious service. Check out Khajuraho in Ardmore for a much better experience and better food. I've been eating at Khajuraho for 10+ years and rarely had a bad experience. They typically deliver in less than 15 minutes. I should have stayed with the tried and true...", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2011-09-24T00:00:00.000"}
{"review": "The naan, chicken tikka masala and rice pudding keeps bringing me back. Plus the fact that our original waiter and the owner remembers exactly where we sat and throws in a little extra something whenever we order take out. Even though I found another Tiffin closer to where I live, I'll be making the trip to this one anyway.", "venue": "Tiffin Bryn Mawr", "stars": 5, "date": "2011-05-03T00:00:00.000"}
{"review": "Ate at Tiffin for the second time the other day, and could not have asked for a more delicious meal! As far as service and decor goes, I can't complain, either. It gets a bit loud considering the small capacity of the place, but it's not a huge issue.I've had chicken saag from here in the past--it's good, yet not any more or less so than the other dozen or so place in which I've tried it. The other night, however, I split the Navratan Korma and their February special, the pumpkin kofta curry. Both dishes were awesome, clearly made with fresh vegetables and the sauces for both were great, albeit, as usual, not very spicy. (Must remember to ask for more spice, next time!) The pumpkin kofta curry was unlike anything I've ever tried--in a good way, of course. The sauce was rich with pumpkin flavor, and drenched homemade vegetable balls composed of coconut and assorted veggies. Just, wow! I love pumpkin, and was thrilled to see this dish--I must try and concoct it on my own! As for the Navratan Korma, it was similarly delicious, exuding the nutty cashew and almond flavor in every bite. I haven't eaten this dish elsewhere, however, so I don't have any comparison judgements to make. I would have liked for slightly larger portion sizes, but I suppose the quality ingredients and originality of the pumpkin dish made the prices per size of the dishes worth it. I'm hoping to check out Tiffin's other Philly locations and see how they compare, but all in all it was a great meal while out in the suburbs! My preference for Ekta over Tiffin in the Bryn Mawr area is now challenged.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2012-02-12T00:00:00.000"}
{"review": "I went there a couple of times. The food is very good for such a small place. I believe it is better than any other Indian restaurants that you usually find in America suburbia. I was actually impressed by the food. It is very consistent, no bad surprise, and very affordable.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2012-11-24T00:00:00.000"}
{"review": "I just had the worst experience at Tiffin Bryn Mawr last Friday. I called in at 11:30 to place an order for the dinner tiffin. The person who answered first of all told me that the they stopped making the tiffin at 2:00 PM. I told the person that dinner tiffin ran until later and he said that he was new which was totally fine. I picked up my tiffin and when I went home, I noticed that it was not the dal triveni and it was instead dal makhni. I called in to say that they did not give me the right thing and they argued that they gave me that because they were out of the other dal. First of all, had I known that it was dal mahani I would not have ordered it, second, don't you think that you need to atleast have the courtesy to let me know that you are switching my order on me!!! In all this, I did not hear an apology and he wanted me to travel back half an hour each way to return my food to give me credit! I am truly baffled. I went on to say that this was not right and he wanted me to talked to the general manager (I was already talking to a manager) and I said it was his problem to fix his order at which point he hung up. I called back and he knew he had hung up on me at which point he said, they were busy and to call back in two hours!!! Thank you for asking me to wait for two hours to call on a order that you screwed up that I called for at 11:30 AM! Great job!!!", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2013-09-24T00:00:00.000"}
{"review": "good lunch and dinner specials that can be ordered online. i've had several vegetarian dishes from here and they were all good, as is the naan.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2011-12-30T00:00:00.000"}
{"review": "Nice clean Indian food.  Staff is a bit 'absent'.  Busy doing other things which could be good if you are trying to eat lunch and have a conversation without being interrupted every few minutes.  Small portions and a little pricey but considering all the prep needed to make Indian food, seems worth it.", "venue": "Tiffin Bryn Mawr", "stars": 3, "date": "2011-03-24T00:00:00.000"}
{"review": "Went on a Friday night.  Handsome modern design.  Food was very good as was the service.", "venue": "Tiffin Bryn Mawr", "stars": 4, "date": "2011-05-15T00:00:00.000"}
{"review": "loved this restaurant until i got very sick following a dinner from here. if you don't want to get sick, i suggest not eating here.", "venue": "Tiffin Bryn Mawr", "stars": 1, "date": "2013-02-14T00:00:00.000"}
