{"date": "2019-04-20T00:00:00.000", "stars": 5, "review": "I've been coming to this location for many years, and love the food, the coffee, and the people who work there.I'd also like to give a shoutout to Farhad, the one cashier who is one of the nicest people there. :-)", "venue": "Wawa"}
{"date": "2019-02-25T00:00:00.000", "stars": 3, "review": "Typical Wawa a little outdated. Went in there for coffee and some snacks the line was slow but then it is just a Wawa", "venue": "Wawa"}
{"date": "2018-04-28T00:00:00.000", "stars": 4, "review": "Typical Wawa location with quick reliable service and standard options to choose from. Clean location and friendly staff.", "venue": "Wawa"}
{"date": "2018-04-18T00:00:00.000", "stars": 4, "review": "I often lie awake at night, pondering the great questions of life.  Why?  What is the purpose of it all?  What caused the Permian Extinction? Can true love really be found in the confines of this mortal coil?  And then...in my mind I hear a still small voice, growing ever louder, eventually becoming like a thunderclap on a hot summer evening.  The voice tells me to look to the Wawa Sizzli..and it was in the Wawa Sizzli, with sausage, egg, and cheese on a croissant...that I find inner harmony, purpose, and meaning.  Bite after bite comorts my inner being, like putting on that well-worn pair of jeans, sliding tired feet into flannel lined slippers, or the affection of an old and loyal dog.  And I realize that my identity...my very self...begins to merge with the Sizzli, rendering me powerless to resist its calling.  I look at the Sizzli, in all its greasy goodness, and ask, \"who is the slave...and who is the master?\"", "venue": "Wawa"}
{"date": "2018-03-29T00:00:00.000", "stars": 1, "review": "So bad with delivery and getting orders right. They once gave my order to the wrong driver, couldn't care less, didn't even attempt to make it right, and blamed it on GrubHub. Never again.", "venue": "Wawa"}
